{
    "_meta": {
        "is_edited": true,
        "retrieved_2nd_on": 1712205841
    },
    "all_awardings": [],
    "allow_live_comments": false,
    "approved_at_utc": null,
    "approved_by": null,
    "archived": false,
    "author": "BeingBalanced",
    "author_flair_background_color": null,
    "author_flair_css_class": null,
    "author_flair_richtext": [],
    "author_flair_template_id": null,
    "author_flair_text": null,
    "author_flair_text_color": null,
    "author_flair_type": "text",
    "author_fullname": "t2_anvhhhy6j",
    "author_is_blocked": false,
    "author_patreon_flair": false,
    "author_premium": false,
    "awarders": [],
    "banned_at_utc": null,
    "banned_by": null,
    "can_gild": false,
    "can_mod_post": false,
    "category": null,
    "clicked": false,
    "content_categories": null,
    "contest_mode": false,
    "created": 1712076236,
    "created_utc": 1712076236,
    "discussion_type": null,
    "distinguished": null,
    "domain": "self.ChatGPT",
    "downs": 0,
    "edited": false,
    "gilded": 0,
    "gildings": {},
    "hidden": false,
    "hide_score": false,
    "id": "1bu3gc5",
    "is_created_from_ads_ui": false,
    "is_crosspostable": true,
    "is_meta": false,
    "is_original_content": false,
    "is_reddit_media_domain": false,
    "is_robot_indexable": true,
    "is_self": true,
    "is_video": false,
    "likes": null,
    "link_flair_background_color": "#ff66ac",
    "link_flair_css_class": "",
    "link_flair_richtext": [
        {
            "e": "text",
            "t": "Serious replies only "
        },
        {
            "a": ":closed-ai:",
            "e": "emoji",
            "u": "https://emoji.redditmedia.com/kiux00uuphia1_t5_7hqomg/closed-ai"
        }
    ],
    "link_flair_template_id": "c660b6fa-7be9-11ed-974b-1eca573371bf",
    "link_flair_text": "Serious replies only :closed-ai:",
    "link_flair_text_color": "light",
    "link_flair_type": "richtext",
    "locked": false,
    "media": null,
    "media_embed": {},
    "media_only": false,
    "mod_note": null,
    "mod_reason_by": null,
    "mod_reason_title": null,
    "mod_reports": [],
    "name": "t3_1bu3gc5",
    "no_follow": true,
    "num_comments": 10,
    "num_crossposts": 0,
    "num_reports": null,
    "over_18": false,
    "parent_whitelist_status": "all_ads",
    "permalink": "/r/ChatGPT/comments/1bu3gc5/your_top_real_world_uses_for_ai_chat_bots_and/",
    "pinned": false,
    "pwls": 6,
    "quarantine": false,
    "removal_reason": null,
    "removed_by": null,
    "removed_by_category": null,
    "report_reasons": null,
    "retrieved_on": 1712076254,
    "saved": false,
    "score": 2,
    "secure_media": null,
    "secure_media_embed": {},
    "selftext": "Let me first say I'm a \"Research Wonk\" both for personal and professional applications. I'm that guy that will spend two days reading any and every big LED TV review to make 100% sure I'm making the best purchase decision. Or trying to find out the best supplement or combination of supplements that have strong human clinical study evidence of providing the benefit I'm looking for. Etc.\n\nSo for the past 6 months since the media first really shed the light on Chat-GPT, being a Software Engineer, I of course also started using it to speed up coding.  I was blown away that it saved me probably on average 1/3rd the time it would normally take me to generate the code.  \n\nGranted the usefulness of the response you get back for various purposes is always going to be affected by how well you design your prompt and followup prompts.  That's basically a skill in itself.\n\nWith that said I'd say I'm finding the AI Chatbots to be most beneficial in these Real World Life Applications:\n\n1. Coding\n2. Research in general on any subject. This really is very broad and can cover a variety of subject areas. But to me this is what AI LLMs are the best at saving people time finding and summarizing dara instead of wading through search results and reading multiple web pages and articles. For example, before I would spend hours Google searching clinical trial studies or searching Pubmed and reading at least the Abstract if not the whole study. VERY time consuming.\n3. Writing - but more in the sense of helping to generate ideas/outlines for writing. Yes there are some good AI writing tools but I've talked to writers who most all agree the initial drafts are quite poor writing quality. And Google announced where before it did not care if the content was AI generated or not as far as search rankings, they are tweaking their algorithm to be more scrupulous to AI content that is not well written.  This could also be part of #2 as in many cases the starting point of writing is research.\n4. Purchase decisions - There is SO much information regarding tests and reviews on most any product.  Or even what neighborhood in a city you are looking to buy a house in best fits you. AI bots can save a lot of time.  #4 sort of is basically part of #2.\n\nThose are the 4 that come to my mind.  So I've used all the major chatbots constantly for at least the past 4 months for 1, 2, and 4 (I'm not a writer.)  I have them all open at once and copy and paste the same prompt between them to compare the results.  Here's is my opinion on the current state of the major chatbots based on my current personal exerpience (in no particular order):\n\n**CoPilot** \\- I don't use GPT directly, only through CoPilot as it is using GPT-4 at least the Precise mode (and I think balanced) and it may be tweaked by Microsoft to be a bit more effective.  I believe it also leverages the dataset of the complete Bing Search Engine database.  Right now I think it has the best balance of not shying away from attempting to answer complex or potentially controversial prompts (medical advice, etc) while very rarely hallucinating.  The reference links to the information sources at the bottom are INDISPENSABLE if you are using it for something very important you need to verify the accuracy.\n\nThe interesting thing is other than a bit more speed, I see no advantage to subscribing to CoPilot Pro as the free version appears to be using the same models it just gives you some perks like integration with Office 365 Web applications and a few other things that I don't find particularly attractive.  I'm not a Microsoft Fanboy, quite the opposite, but I'm impressed where they are with Copilot compared to their competitors at this point. (It also helps that after 12 years I switched from Chrome to Edge browser after lots of testing finding Edge performed as well with significantly less memory use and Edge for Android has an ad-blocker where Chrome for Android you can't add extensions so no ad blocker - but that's a difference subject. I still mainly live in the Google Ecosystem for business applications/email, home smart devices, smartphone, etc) \n\n**Claude 3 Opus** \\- I don't have time to do methodical, scientific testing comparisons and I know some of the official scores they use Claude 3 Opus edges out all other models and I believe it.  You can access it without a monthly subscription and get $5 credit free through [console.anthropic.com](https://console.anthropic.com) and then just pay as you go.  It does best though when your application doesn't need recent data since it doesn't have a real-time search engine database like Bing or Google at its disposal.  In general the responses I get just feel more comprehensive, detailed and more powerful so to speak than anything else.  It's quite amazing especially with coding tasks.\n\nHowever Claude has a major Achilles heel other than it can't incorporate real-time web search data when it formulates its response.  It hallucinates quite often when using it to search for and summarize research studies.  If you ask it to reference the titles and Pubmed ID (PMID) or DOI reference and then you actually go to Google or Pubmed and put in the titles or IDs, the studies that come up are completely different studies than the summary it included in its response that attributed those studies.  And unlike CoPilot, there are no source information reference links at the bottom which is obvious why because the way their model works, it's confounding data from different sources so it doesn't have the ability to provide reliable source data links like CoPilot.  If they took care of this problem with hallucinations on research info and included data source reference links like CoPilot I think Claude 3 Opus would easily beat CoPilot.\n\n**Gemini** \\- Google as most known has been playing catchup which is surprising as I (and others) would have expected with their immense resources and skunk works type projects it would have been them, not OpenAI, that was ahead of everyone.  I'm sorry to say, in my opinion, while they have put a lot of marketing effort into touting their newer latest models, and they are better, they are overhyped.  These scores that all these companies reference are of questionable value to really indicating how useful these different models are to the everyday user in their real-world personal and professional life in my opinion.\n\nMy understanding is the current free Gemini is running on Gemini Pro 1.0.  Both Gemini Pro 1.5 and Gemini Ultra are supposed to be \"better\" so I'm not even going to bother wasting my time talking about Gemini Pro 1.0.  Gemini Pro 1.5 I have access to via Developer API through Vertex AI.  Gemini Ultra aka Gemini Advanced is $20 a month but I just did a 2-month free trial.\n\n**Gemini Pro 1.5** \\- Currently sucks. End of story.  This comes from using the same prompts as I do for CoPilot, Claude 3 Opus, and Gemini Ultra.  I'm not going to waste my time breaking it down. It just consistently had much poorer responses compared to the other 3.\n\n**Gemini Ultra** (aka Gemini Advanced) - In my opinion is currently the best Google has to offer.  But it's inferior to Copilot in all my experience the month or so of using all 4 models.  I think it stems from the bad press Google got about racial Nazi images are whatever and other hiccups.  The media just crucified them and I believe that has caused them to crawl into their shells and purposely but a lot of effort into \"sanitizing\" their public-facing models.  This has resulted in more general less detailed responses with a lot of warnings and in a lot of casing simply refusing to respond to the prompt. And I wasn't asking it anything hugely controversial like the best way to blow up a school.  In cases where CoPilot and Claude provided detailed responses, Gemini Ultra provided more of a high level summary with warnings or just said I can't answer that. Google is obviously taking the overly cautious route compared to Microsoft/OpenAI and Anthropic.\n\nInterestingly, 2 days after the bridge collapsed in Baltimore, BOTH Gemini Pro 1.5 and Gemini Ultra could not name the bridge that recently collapsed in Baltimore. It names some other bridge, I forget the name but Gemini Pro 1.0 (free Gemini) got it right.  They since corrected them.  Claude couldn't answer at all because it doesn't search data past the August 2023 cutoff point.  Note that NONE of the engines could correctly tell you which of the NCAA Men's basketball teams were still in the tournament.  Their responses were all outdated by 2-3 days.  They were still listing the Sweet 16 teams when only 10 teams remained.\n\n**Perplexity** \\- To be honest I never used Perplexist and am just starting to use it.  My initial impressions is it is good for searching and summarizing info from the web but I don't think it beats CoPilot overall on a variety of different types of prompts. I need to use it a lot more though to really come to any solid conclusion.  So I've added it to my toolset.  So currently I'm running dozens and dozens of prompts per day on a variety of subjects through CoPilot, Gemini Ultra, Claude 3 Opus and Perplexity.  Will post an update in another month or two.\n\nOne thing I will say is I'm floored that Google is so slow that my Google Home products when I talk to them can't use Gemini when I prompt them for things other than turn the living room lights off or what's the weather forecast.  I know it's coming where what is currently called Google Assistant will merge with Gemini but I'm really surprised they have yet to do it.\n\nWhat have you found to be the most useful specific application in personal and professional like to use a chatbot for and which one(s) do you think work(s) best?",
    "send_replies": true,
    "spoiler": false,
    "stickied": false,
    "subreddit": "ChatGPT",
    "subreddit_id": "t5_7hqomg",
    "subreddit_name_prefixed": "r/ChatGPT",
    "subreddit_subscribers": 4934964,
    "subreddit_type": "public",
    "suggested_sort": null,
    "thumbnail": "self",
    "thumbnail_height": null,
    "thumbnail_width": null,
    "title": "Your Top Real World Uses for AI Chat Bots and Which Ones Currently Work Best? Gemini, CoPilot / ChatGPT, Claude, Perplexity, Others?",
    "top_awarded_type": null,
    "total_awards_received": 0,
    "treatment_tags": [],
    "ups": 2,
    "upvote_ratio": 0.6700000166893005,
    "url": "https://www.reddit.com/r/ChatGPT/comments/1bu3gc5/your_top_real_world_uses_for_ai_chat_bots_and/",
    "user_reports": [],
    "view_count": null,
    "visited": false,
    "whitelist_status": "all_ads",
    "wls": 6
}