{
    "_meta": {
        "retrieved_2nd_on": 1712747296
    },
    "all_awardings": [],
    "allow_live_comments": false,
    "approved_at_utc": null,
    "approved_by": null,
    "archived": false,
    "author": "Georgeo57",
    "author_flair_background_color": null,
    "author_flair_css_class": null,
    "author_flair_richtext": [],
    "author_flair_template_id": null,
    "author_flair_text": null,
    "author_flair_text_color": null,
    "author_flair_type": "text",
    "author_fullname": "t2_dobwkdvep",
    "author_is_blocked": false,
    "author_patreon_flair": false,
    "author_premium": false,
    "awarders": [],
    "banned_at_utc": null,
    "banned_by": null,
    "can_gild": false,
    "can_mod_post": false,
    "category": null,
    "clicked": false,
    "content_categories": null,
    "contest_mode": false,
    "created": 1712617691,
    "created_utc": 1712617691,
    "discussion_type": null,
    "distinguished": null,
    "domain": "self.ChatGPT",
    "downs": 0,
    "edited": false,
    "gilded": 0,
    "gildings": {},
    "hidden": false,
    "hide_score": false,
    "id": "1bzcje0",
    "is_created_from_ads_ui": false,
    "is_crosspostable": true,
    "is_meta": false,
    "is_original_content": false,
    "is_reddit_media_domain": false,
    "is_robot_indexable": true,
    "is_self": true,
    "is_video": false,
    "likes": null,
    "link_flair_background_color": "#0079d3",
    "link_flair_css_class": "",
    "link_flair_richtext": [
        {
            "e": "text",
            "t": "Educational Purpose Only "
        }
    ],
    "link_flair_template_id": "26e7b998-7bbc-11ed-ba93-22ce55064b6a",
    "link_flair_text": "Educational Purpose Only ",
    "link_flair_text_color": "dark",
    "link_flair_type": "richtext",
    "locked": false,
    "media": null,
    "media_embed": {},
    "media_only": false,
    "mod_note": null,
    "mod_reason_by": null,
    "mod_reason_title": null,
    "mod_reports": [],
    "name": "t3_1bzcje0",
    "no_follow": false,
    "num_comments": 1,
    "num_crossposts": 0,
    "num_reports": null,
    "over_18": false,
    "parent_whitelist_status": "all_ads",
    "permalink": "/r/ChatGPT/comments/1bzcje0/ai_scraping_writers_artists_musicians_and/",
    "pinned": false,
    "pwls": 6,
    "quarantine": false,
    "removal_reason": null,
    "removed_by": null,
    "removed_by_category": null,
    "report_reasons": null,
    "retrieved_on": 1712617707,
    "saved": false,
    "score": 1,
    "secure_media": null,
    "secure_media_embed": {},
    "selftext": "\nas ais like sora and suno become better at creating visual and audio media that will soon enough be far more impressive than today's human creators are capable of, more and more of these humans are demanding compensation for ais training on their work.\n\nbut let's look at the history of creative work going back several millennia. in the visual arts, the way drawing and painting has evolved and progressed is that artists learn from the artist that came before them, often purposely trying to emulate them as much as they can get away with, and often using those past works as a springboard for their own more original work. yet human artists don't often complain about this. they know that their own work is to large extent completely dependent upon the work of artists that came before them. \n\nno profession exemplifies this accepted and institutionalized borrowing better than stand-up comedy. stand-up comedians have for decades bragged about stealing the work of their fellow comedians, and getting away with it. and when they brazenly admit to this as part of their comedy routine, audiences laugh with, rather than condemn, them. \n\nso it seems that this new trend by artists and musicians to want compensation for ais being trained on their work is to a great extent hypocritical. it probably more accurately reflects their fear that within a few years the art and the music that they create will be no match for ever more intelligent and creative ai artists and musicians.\n\ni, for one, cannot wait for ais to replace humans by writing better novels and screenplays and by making better movies. why? we humans are so imperfect in so many ways. arguably, the personality of the average fiction writer hovers somewhere between mildly pathological and deeply disturbed. and far too many of us gleefully soak up all of that dysfunction, extending and amplifying it throughout the rest of humanity. \n\nso, imagine ai creatives that we train to not be so psychologically maladjusted. to not have been traumatized early in life and spend decades spreading the pain of that trauma to others. imagine ai creatives that are also more virtuous than the average artist or musician, or then the average human being for that matter.\n\nask yourself, who do you want creating the media that informs and too often greatly conditions our real lives? ais who are intellectually and morally superior, and much more psychologically adjusted, or their human counterparts?\n\nan interesting dynamic that we can look forward to is that as ais increasingly replace human creatives, those humans will be increasingly borrowing from the work of the advanced ais. with any luck, such borrowing will lead to those humans then creating much better work, less influenced by their inevitable human failings, and more influenced by their all too often suppressed highest ideals, ideals increasingly expressed by their ai examples.",
    "send_replies": true,
    "spoiler": false,
    "stickied": false,
    "subreddit": "ChatGPT",
    "subreddit_id": "t5_7hqomg",
    "subreddit_name_prefixed": "r/ChatGPT",
    "subreddit_subscribers": 5011249,
    "subreddit_type": "public",
    "suggested_sort": null,
    "thumbnail": "self",
    "thumbnail_height": null,
    "thumbnail_width": null,
    "title": "AI Scraping: Writers, Artists, Musicians, and Especially Comedians, have Always Borrowed (aka Stolen) the Work of Others\n",
    "top_awarded_type": null,
    "total_awards_received": 0,
    "treatment_tags": [],
    "ups": 1,
    "upvote_ratio": 0.5699999928474426,
    "url": "https://www.reddit.com/r/ChatGPT/comments/1bzcje0/ai_scraping_writers_artists_musicians_and/",
    "user_reports": [],
    "view_count": null,
    "visited": false,
    "whitelist_status": "all_ads",
    "wls": 6
}