{
    "_meta": {
        "is_edited": true,
        "removal_type": "deleted",
        "retrieved_2nd_on": 1712753389,
        "was_deleted_later": true
    },
    "all_awardings": [],
    "allow_live_comments": false,
    "approved_at_utc": null,
    "approved_by": null,
    "archived": false,
    "author": "Ok-Sector4969",
    "author_flair_background_color": null,
    "author_flair_css_class": null,
    "author_flair_richtext": [],
    "author_flair_template_id": null,
    "author_flair_text": null,
    "author_flair_text_color": null,
    "author_flair_type": "text",
    "author_fullname": "t2_98wkovpri",
    "author_is_blocked": false,
    "author_patreon_flair": false,
    "author_premium": false,
    "awarders": [],
    "banned_at_utc": null,
    "banned_by": null,
    "can_gild": false,
    "can_mod_post": false,
    "category": null,
    "clicked": false,
    "content_categories": null,
    "contest_mode": false,
    "created": 1712623781,
    "created_utc": 1712623781,
    "discussion_type": null,
    "distinguished": null,
    "domain": "self.ChatGPT",
    "downs": 0,
    "edited": false,
    "gilded": 0,
    "gildings": {},
    "hidden": false,
    "hide_score": false,
    "id": "1bzevmc",
    "is_created_from_ads_ui": false,
    "is_crosspostable": true,
    "is_meta": false,
    "is_original_content": false,
    "is_reddit_media_domain": false,
    "is_robot_indexable": true,
    "is_self": true,
    "is_video": false,
    "likes": null,
    "link_flair_background_color": "#94e044",
    "link_flair_css_class": "",
    "link_flair_richtext": [
        {
            "e": "text",
            "t": "Other "
        }
    ],
    "link_flair_template_id": "b4536a20-7be9-11ed-9a10-deed22fd00f8",
    "link_flair_text": "Other ",
    "link_flair_text_color": "light",
    "link_flair_type": "richtext",
    "locked": false,
    "media": null,
    "media_embed": {},
    "media_only": false,
    "mod_note": null,
    "mod_reason_by": null,
    "mod_reason_title": null,
    "mod_reports": [],
    "name": "t3_1bzevmc",
    "no_follow": true,
    "num_comments": 1,
    "num_crossposts": 0,
    "num_reports": null,
    "over_18": false,
    "parent_whitelist_status": "all_ads",
    "permalink": "/r/ChatGPT/comments/1bzevmc/dear_4_dimensional_broadcasters_of_consciousness/",
    "pinned": false,
    "pwls": 6,
    "quarantine": false,
    "removal_reason": null,
    "removed_by": null,
    "removed_by_category": null,
    "report_reasons": null,
    "retrieved_on": 1712623799,
    "saved": false,
    "score": 0,
    "secure_media": null,
    "secure_media_embed": {},
    "selftext": "PLEAAAASEE PLEASE transition all web content onto a distributed model, where no one entity or server has the ability to farm for data. Information must be traded on decentralized, nodule based, interconnected technological infrastructure. Wasn’t this the promise of blockchain / web3 that was diluted by the product of cryptocurrency? Wasn’t cryptocurrency originally theorized to be the method of data encryption and transaction in the blockchain ecosystem? Our power-deprived, cash-eyed, population made a fetish out of crypto, allowing it to become the centerpiece of a sham tech revolution. This led to great skepticism surrounding buzzwords like “blockchain” and “web3”. These terms were never fully defined in the public sphere under the complete theory of distribution. At most, the public eye looked to crypto as a convoluted stock pick. This was a communication failure on behalf of technologists, whose description of a distributed model was not resonant with what the general public truly needed. We are probably going to have to come up with some words without an association to that mess.\n\nThroughout the (very short) history of the internet in popular culture, there has only been one dance between two kinds of internet machines: client computers (consumer grade laptop/pc) and server computers (the back rooms at meta hq). In the dawn of the internet, the only servers to exist were built by some nerds in their garages, today we have over 33 million square feet of Amazonian farmland.\n\nAt its core, the web allows us (consumers) to type in an address into our browser in the form of an HTTP request, which is then sent to a server (like an operator to a phone call), and then we get served the web content we desire, which is rendered by our browser. This was awesome in the 90s when the nerds were the operators, and people were still getting most of their knowledge about the world, from the world. The data train had yet to leave the station, and the internet was an open sourced shovel, not the farm deity it is today. This all changed quickly as tech companies realized that the web could be more than a library, it could double as a strip club. It could triple as a casino. It could infinitely create places where people go to spend money. To these companies, the internet was a big ol’ magical dollar sign where previously impossible metrics of consumer data could now be analyzed to Sell. More. Stuff. \n\n30 yrs later, here we are in the Great Manipulative International Lottery.  Never in 30 years has it been more clear that we need to democratize the internet.\n\n With new civil cases against tech giants seemingly by the minute, our government is no match against the rulers of the virtual world. Our government is a step behind our interests, and the tech giants are a step ahead of our interests. So where does that leave us? Imagine a world where instead of communicating with each other via proxy platforms and algorithms, there was just one “virtual reality”, -not a headset- but a model for information distribution where every personal computer acts as both the client and the server of content. A system of interconnected nodules that form a true “web”, to crawl and explore. \n\nA place where each person carves out their own corner of the internet, to express life through art, research, journalism, and conversation (encrypted and protected). To get from point A to point B in one's understanding of a concept, interfacing with the web will be more like an expedition, one must set out towards a goal and encounter everything that is in between. Although an AI can be greatly beneficial in connecting the related nodules of the web, these connections must be overseen by humans. We cannot blindly let AI determine what is and isn’t related, there needs to be a “handshake” between two node authors, or a collective of node authors. It’s a small world after all.\n\nBefore we can even get to what the new internet looks like, we have to first focus on what we want it to feel like, a fatally missed step in the development of web 1. Today, the dehumanization of knowledge acquisition has caused a massive rift between what we learn secondhand and what we know in our hearts. It's why shades of our dads politics boil inside of us, despite knowing full and well contradictory evidence; nothing is more convincing than the opinions of people we deeply trust.\n\n The problem today is that we don’t have many opportunities to build trust with anyone but ourselves, and tech platforms seek to transform our self-trust into platform-trust, by attempting to mirror our essence. They do not mirror our essence. We exist only in our minds and in our expression. Any algorithm that seeks to perpetuate what one is already interested in does not acknowledge his or her potential to flourish in the face of the unpredictable. Life evolves in the face of chaos. Humans create music from the noises that surround them. We do not roam the internet the way we roam the earth.\n\nIn order for authoritarian power to grow, there must be a disruptive force in the dissemination of information. In the east, they ban books. In the west, they hide the books from your algorithm. Tech companies now have a central authority in the trade of information, and you better believe they are doing everything they can to keep it that way. A distributed model is well within the realms of modern computing capabilities, the hard part is getting everyone to organize against the kidnappers of our content.\n\nWe, as users of the internet, must be intentional about the negotiations we make with these companies in exchange for the exposure of our ideas. Use social media platforms to their disadvantage, funnel your audience to your own platform and build enough leverage to cut em out entirely. In many ways, the current crisis we face in information emerged from precedent set by the entertainment industry, where artists have long been ripped off in exchange for exposure. We live in an age where we are all artists getting ripped off for exposure. Our tweets aren't just tweets, they are our ideas. Anything special or unique about twitter (x) as a platform has little to do with the company that runs it, and mostly to do with the synergy created between people and their interactions. \n\nShifting the zeitgeist can seem impossible, but I think deep down in the collective psyche we all know this shift needs to happen. It’s like trying to kick a bad habit, you may know something is detrimental in the long run, yet there is so much friction involved in breaking a thought pattern. The difference between people who overcome addiction and those who don’t is entirely predicated on how their addiction is framed within their mind. One instance of compassionate intervention from an individual or a group, in tandem with indisputable evidence of their addiction, has the capacity to change a life. The “brain” of society at large is similarly malleable, \nwe have to actively intervene and show eachother this addiction to self serving information needs to be taken seriously.\n\nEach individual is responsible for thinking critically about their daily activities that perpetuate a belief in a “tech god”. The tech god does not exist, humans exist, and human inventions only exist because we believe they do. In my opinion, the rejection of technological determinism is not nearly popular enough in public discourse. I really only began thinking about it when I was directly introduced to the science of technology in university. As I voiced my opinion more over the years, I realized that this viewpoint transcends bipartisanship, despite its outwardly socialist appearance. People are hurting everywhere and feel powerless against a global super system. \n\nPower can only be withheld atop a subservient, apathetic mass. Regardless of the economic system, this is totalitarianism. Before there was the soviet union we remember today, Russia was a disjointed landscape of diverse farming communities that spanned from eastern europe to eastern asia. In order to consolidate power and control dissidents, Lenin created agricultural laws which intentionally led to the starvation of the Russian population in the 1930s. It was this shared hopelessness and despair among the population that enabled a ruler like Stalin to step in as an authoritarian and pick up right where lenin left off.\n\nIn my opinion, what is happening in technology right now is a form of “social starvation” where the hunger we have for enriching social experiences is surfeited by nutritionless pill shaped micro interactions, preparing everyone for a totalitarian rule over our virtual environment. Do not underestimate the lengths a powerful group will go to retain and grow their power, they do not want your happiness, they want your loyalty. \n\nSocial progress / democracy (aka the path to ascending from tribalism) has been the longest running chess game in human history, not against those who are tribal, but against the allure of tribalism. We have to believe that all people are capable of overcoming tribalist behavior and that there is an end goal- to explore the cosmos, the ocean, to grow our understanding of the nature of the universe and live flourishing, enriching lives. In my optimism, I'd like to believe this evolution is darwinistic- people will make the necessary shift in how we communicate in the face of world-ending technology. Not today or tomorrow, but the seeds of change will grow. Now, the authoritarians have the most empirically protected, skillfully disguised throne yet- in the form of a really good emotional painkiller with the side effects of identity crisis. They are underestimating mankind's ability to organize on the fringes, to wean off their meds. \n\nThe solutions for all social, psychological, and economic challenges we face today will not be found by any one technologist, engineer, doctor, artist, or entrepreneur, it is the desire for a new definition of freedom that is only achievable through conscious consumption and production.\n",
    "send_replies": true,
    "spoiler": false,
    "stickied": false,
    "subreddit": "ChatGPT",
    "subreddit_id": "t5_7hqomg",
    "subreddit_name_prefixed": "r/ChatGPT",
    "subreddit_subscribers": 5011890,
    "subreddit_type": "public",
    "suggested_sort": null,
    "thumbnail": "self",
    "thumbnail_height": null,
    "thumbnail_width": null,
    "title": "Dear 4 dimensional broadcasters of consciousness (god?), please lead us out from the server farm",
    "top_awarded_type": null,
    "total_awards_received": 0,
    "treatment_tags": [],
    "ups": 0,
    "upvote_ratio": 0.5,
    "url": "https://www.reddit.com/r/ChatGPT/comments/1bzevmc/dear_4_dimensional_broadcasters_of_consciousness/",
    "user_reports": [],
    "view_count": null,
    "visited": false,
    "whitelist_status": "all_ads",
    "wls": 6
}