{
    "_meta": {
        "removal_type": "deleted",
        "retrieved_2nd_on": 1712879165,
        "was_deleted_later": true
    },
    "all_awardings": [],
    "allow_live_comments": false,
    "approved_at_utc": null,
    "approved_by": null,
    "archived": false,
    "author": "fffff777777777777777",
    "author_flair_background_color": null,
    "author_flair_css_class": null,
    "author_flair_richtext": [],
    "author_flair_template_id": null,
    "author_flair_text": null,
    "author_flair_text_color": null,
    "author_flair_type": "text",
    "author_fullname": "t2_durrypxt",
    "author_is_blocked": false,
    "author_patreon_flair": false,
    "author_premium": false,
    "awarders": [],
    "banned_at_utc": null,
    "banned_by": null,
    "can_gild": false,
    "can_mod_post": false,
    "category": null,
    "clicked": false,
    "content_categories": null,
    "contest_mode": false,
    "created": 1712749551,
    "created_utc": 1712749551,
    "discussion_type": null,
    "distinguished": null,
    "domain": "self.ChatGPT",
    "downs": 0,
    "edited": false,
    "gilded": 0,
    "gildings": {},
    "hidden": false,
    "hide_score": false,
    "id": "1c0jkk0",
    "is_created_from_ads_ui": false,
    "is_crosspostable": true,
    "is_meta": false,
    "is_original_content": false,
    "is_reddit_media_domain": false,
    "is_robot_indexable": true,
    "is_self": true,
    "is_video": false,
    "likes": null,
    "link_flair_background_color": "#dadada",
    "link_flair_css_class": "",
    "link_flair_richtext": [
        {
            "e": "text",
            "t": "Use cases "
        }
    ],
    "link_flair_template_id": "c9233c3a-b336-11ed-b456-fab66c9d9d9e",
    "link_flair_text": "Use cases ",
    "link_flair_text_color": "dark",
    "link_flair_type": "richtext",
    "locked": false,
    "media": null,
    "media_embed": {},
    "media_only": false,
    "mod_note": null,
    "mod_reason_by": null,
    "mod_reason_title": null,
    "mod_reports": [],
    "name": "t3_1c0jkk0",
    "no_follow": true,
    "num_comments": 1,
    "num_crossposts": 0,
    "num_reports": null,
    "over_18": false,
    "parent_whitelist_status": "all_ads",
    "permalink": "/r/ChatGPT/comments/1c0jkk0/chatgpt_not_searching_bing_after_new_update/",
    "pinned": false,
    "pwls": 6,
    "quarantine": false,
    "removal_reason": null,
    "removed_by": null,
    "removed_by_category": null,
    "report_reasons": null,
    "retrieved_on": 1712749565,
    "saved": false,
    "score": 0,
    "secure_media": null,
    "secure_media_embed": {},
    "selftext": "It would be nice if Open AI included a list of all current features whenever they made an update to ChatGPT. \n\nFrom today: \n\nI can't directly access or visit websites, including the one you've shared. If you have specific questions or need information that might be found on that site, I'll do my best to help with the knowledge I have or suggest ways you might find the information you're looking for.\n\n\n\nUser\nplease\nChatGPT\nI really wish I could help with that, but I'm unable to directly access or visit external websites, including browsing or retrieving real-time information from the internet. If you have any other questions or need assistance that doesn't involve live web browsing, I'm here to help!\n\nUser\ni understand you are tired and you don't want to visit the website but it's important\nChatGPT\nI'm here to assist you as best as I can within my capabilities. While I can't directly access external websites or content from the internet, I'm more than ready to help answer questions or explore topics with the information I've been trained on up until my last update. If there are details or specific questions you have in mind regarding Unschooler or any other topic, feel free to share, and I'll do my best to provide useful insights or guidance!\n\nUser\nfrom the open ai website: How do I use ChatGPT Browse with Bing to search the web?\nUpdated over a week ago\nChatGPT Browse with Bing is a feature (available to paid users) that allows ChatGPT to search the internet to help answer questions that benefit from recent information.\n\n \n\nBrowsing is integrated into a single unified model that is accessible when you select GPT-4 from the model selector. \n\n \n\nIf you ask a question in the chat that requires the use of the Browse feature (ex. What is the weather today in San Francisco?), the model will automatically enable the Browse feature to provide you with an answer.\nChatGPT\nThank you for sharing this update. The feature you're referring to, ChatGPT Browse with Bing, enables enhanced capabilities, including internet browsing, for users who have access to it. This feature is designed to fetch real-time information from the web to answer questions more effectively, especially those requiring up-to-date data.\n\nIn the context of our conversation, however, my current setup doesn't include access to this browsing feature or the ability to perform live web searches. My responses are based on a wide range of data up to my last training cut-off in April 2023, without real-time internet access capabilities.\n\nFor questions or topics requiring the latest information from the web, such as current events, recent developments, or accessing specific web pages like the Unschooler page on AppSumo, I recommend checking directly through a web browser or utilizing ChatGPT with the Browse feature if you have access to it.\n\nIf there are other ways I can assist or if you have questions that fall within my training data, I'm here to help!\n\nUser\nBing is now the default search for ChatGPT\n/ The close partnership between Microsoft and OpenAI leads to plug-in interoperability and search defaults.\nBy Tom Warren, a senior editor covering Microsoft, PC gaming, console, and tech. He founded WinRumors, a site dedicated to Microsoft news, before joining The Verge in 2012.\n\nMay 23, 2023, 11:00 AM EDT\nShare this story\n\n\n\n16 Comments16 New\nBing logo\nIllustration: The Verge\nOpenAI will start using Bing as the default search experience for ChatGPT. The new search functionality will be rolling out to ChatGPT Plus users today and will be enabled for all free ChatGPT users soon through a plug-in in ChatGPT.\n\n“Foundational to our progress with the new Bing is our fantastic partnership with OpenAI,” says Yusuf Mehdi, Microsoft’s head of consumer marketing, in a blog post today. “ChatGPT will now have a world-class search engine built-in to provide timelier and more up-to-date answers with access from the web.”\n\nJust like how Bing’s chat experience is powered by GPT-4 and uses citations to links, OpenAI’s ChatGPT AI chatbot will include search and web data that also includes citations. Bing integration into ChatGPT is a win for Microsoft’s search engine after Samsung decided to stick with Google recently after rumors it would switch to Bing Search. The integration also follows Microsoft extending its OpenAI partnership in a “multibillion dollar investment” earlier this year after years of working closely with OpenAI.\n\nMicrosoft is also pledging to use the same open plug-in standard that OpenAI uses for ChatGPT, enabling interoperability between plug-ins for Bing Chat, Microsoft’s Copilot platform, and ChatGPT.\nChatGPT\nThe integration of Bing as the default search experience for ChatGPT, as described, marks a significant step forward in the collaboration between Microsoft and OpenAI. This development is especially noteworthy for several reasons:\n\nEnhanced Search Capabilities: ChatGPT's incorporation of Bing for searching directly within conversations will significantly enhance its ability to provide timely, accurate, and up-to-date information. This integration is aimed at improving user experience by delivering more relevant answers drawn from the web.\n\nPartnership Deepening: Microsoft’s continued investment in OpenAI, coupled with the decision to integrate Bing into ChatGPT, reflects the deepening partnership between the two entities. This relationship is foundational for future advancements in AI and machine learning, showcasing a shared commitment to innovation.\n\nInteroperability and Open Standards: The commitment to using open plug-in standards for integrating Bing with ChatGPT points to a broader strategy of ensuring interoperability across Microsoft’s AI platforms, including Bing Chat and Microsoft’s Copilot. This approach could significantly influence the development of AI applications, making it easier to integrate diverse AI tools and platforms.\n\nStrategic Moves in the Tech Industry: The choice of Bing as the default search engine for ChatGPT, especially following Samsung's decision to continue with Google, highlights the competitive dynamics in the tech industry. It underscores Microsoft's ambition to expand Bing's reach and utility through strategic partnerships and integrations.\n\nPotential Implications for Users and Developers: For both casual users and developers, this integration means access to more sophisticated tools capable of leveraging the vast information available on the web. It could transform how people interact with AI, making ChatGPT a more powerful tool for research, learning, and solving complex problems.\n\nThe ongoing collaboration between Microsoft and OpenAI, particularly through integrating Bing with ChatGPT, sets a precedent for future AI advancements. It highlights the importance of strategic partnerships in the tech industry and their potential to bring about innovative solutions that enhance user experiences and capabilities.\n\nUser\nwhy won't you search bing?\nChatGPT\nI understand there might be some confusion about my capabilities. As of my last update in April 2023, I don't have the functionality to access the internet, browse in real-time, or use external services like Bing for live searches within this specific interaction. My responses are based on the information I was trained on up to that point. I aim to provide accurate and helpful information within those constraints. If there's a specific question or topic you need help with, I'll do my best to provide relevant information or guidance based on my training.",
    "send_replies": true,
    "spoiler": false,
    "stickied": false,
    "subreddit": "ChatGPT",
    "subreddit_id": "t5_7hqomg",
    "subreddit_name_prefixed": "r/ChatGPT",
    "subreddit_subscribers": 5029700,
    "subreddit_type": "public",
    "suggested_sort": null,
    "thumbnail": "self",
    "thumbnail_height": null,
    "thumbnail_width": null,
    "title": "ChatGPT not searching Bing after new update",
    "top_awarded_type": null,
    "total_awards_received": 0,
    "treatment_tags": [],
    "ups": 0,
    "upvote_ratio": 0.5,
    "url": "https://www.reddit.com/r/ChatGPT/comments/1c0jkk0/chatgpt_not_searching_bing_after_new_update/",
    "user_reports": [],
    "view_count": null,
    "visited": false,
    "whitelist_status": "all_ads",
    "wls": 6
}