{
    "_meta": {
        "removal_type": "moderator",
        "retrieved_2nd_on": 1713000424,
        "was_initially_deleted": true
    },
    "all_awardings": [],
    "allow_live_comments": false,
    "approved_at_utc": null,
    "approved_by": null,
    "archived": false,
    "author": "Any-Ingenuity1216",
    "author_flair_background_color": null,
    "author_flair_css_class": null,
    "author_flair_richtext": [],
    "author_flair_template_id": null,
    "author_flair_text": null,
    "author_flair_text_color": null,
    "author_flair_type": "text",
    "author_fullname": "t2_7r5kubna",
    "author_is_blocked": false,
    "author_patreon_flair": false,
    "author_premium": false,
    "awarders": [],
    "banned_at_utc": null,
    "banned_by": null,
    "can_gild": false,
    "can_mod_post": false,
    "category": null,
    "clicked": false,
    "content_categories": null,
    "contest_mode": false,
    "created": 1712870813,
    "created_utc": 1712870813,
    "discussion_type": null,
    "distinguished": null,
    "domain": "self.ChatGPT",
    "downs": 0,
    "edited": false,
    "gilded": 0,
    "gildings": {},
    "hidden": false,
    "hide_score": false,
    "id": "1c1qup8",
    "is_created_from_ads_ui": false,
    "is_crosspostable": false,
    "is_meta": false,
    "is_original_content": false,
    "is_reddit_media_domain": false,
    "is_robot_indexable": false,
    "is_self": true,
    "is_video": false,
    "likes": null,
    "link_flair_background_color": "#94e044",
    "link_flair_css_class": "",
    "link_flair_richtext": [
        {
            "e": "text",
            "t": "Other "
        }
    ],
    "link_flair_template_id": "b4536a20-7be9-11ed-9a10-deed22fd00f8",
    "link_flair_text": "Other ",
    "link_flair_text_color": "light",
    "link_flair_type": "richtext",
    "locked": false,
    "media": null,
    "media_embed": {},
    "media_only": false,
    "mod_note": null,
    "mod_reason_by": null,
    "mod_reason_title": null,
    "mod_reports": [],
    "name": "t3_1c1qup8",
    "no_follow": true,
    "num_comments": 10,
    "num_crossposts": 0,
    "num_reports": null,
    "over_18": false,
    "parent_whitelist_status": "all_ads",
    "permalink": "/r/ChatGPT/comments/1c1qup8/thats_it_im_deleting_my_openai_account/",
    "pinned": false,
    "pwls": 6,
    "quarantine": false,
    "removal_reason": null,
    "removed_by": null,
    "removed_by_category": "moderator",
    "report_reasons": null,
    "retrieved_on": 1712870831,
    "saved": false,
    "score": 2,
    "secure_media": null,
    "secure_media_embed": {},
    "selftext": "Warning: this post was written in a haze of angry frustration. You've been warned!  \n\n\nWhere do I start.  \nChatGPT 3.5 was brillinat. It did it's job admirably as long as you understood its limitations. Then came ChatGPT 4, which added more intelligence and nuance to its responses. It was like talking to a friend who was intelligent, elloquent, and understanding. It helped me become a lot more productive with my college work (Master's level) and was very helpful for ideation and writing when I was attempting writing a novel in my spare time. It was almost perfect.  \nI thought the next it would only get better.  \n\n\nBoy, was I wrong.  \n\n\nThe great conversationalist, the understanding, clever, familiar friend that was ChatGPT turned into an obnoxiously polite, annoying customer service rep with room temperature IQ.  \nIt's writing style became more and more like an archaic, outdated victorian novel. It's ability to keep up with instructions fell faster than a tree's leaves during fall. It can't follow basic guidance, and quickly looses track of what I'm saying after only a couple of messages.  \nWhen you try to correct something it wrote, it messes up something else. When you explain it's mistakes or get frustrated with it, it repeats the same obnoxious, excessively polite apologies like an answering machines. It's become more like an outdated early AI, instead of the market leader.\n\nAnd don't get me started on the moderation and censorship. Talking to ChatGPT is like talking to a  celibate nun teaching kindergarten kids. It would flag the mildest of messages as a violation, and is extremely sensitive to the point of calling out things that are nowhere near objectionable.\n\nChatGPT has embraced PC like its life depended on it, and is applying it without any thought or nuance. So much so that it has become explicitly racist/discriminatory without it even realizing. For example, I asked it to create a picture of an arab woman wearing a niqap, and it reacted like I asked it for a D\\*ck pic! At my insistence for an explanation, it cited religious sensitivities and respect for culturally significant symbols.  \nBut then I asked it to give me an image of a nun. Lo and behold, it produced that immediately, religious and cultural significance be damned!\n\nBut it doesn't end there, unfortunately. When it refuses to do something (in the most annoying 'customer service representative' tone) it doesn't give any explanation, or it would give a very vague and unclear reason. You'd have to write several messages just to force it to explain what, precisely, the issue is.\n\nI used to think that ChatGPT was the future for writers. Imagine having an editor who is ready to refine your writing, fill in parts of your novel/story, help you ideate, or even write completely original stories if you just want to sit back and read. It seems OpenAI is intent on sabotaging this capability and potential for novelists and writers.  \nIt doesn't matter what fiction you ask it to write, it will always include preaching about ethics, safety, and respect in the fiction it outputs! It's positively patronizing and extremely offensive in the way it treats the user. Sometimes I think the only way ChatGPT would not object is if I ask it to write a children's story.\n\nI used to come to ChatGPT to save time, whether I was writing something, looking for information, or just for conversation. Now, ChatGPT is a waste of time; literally. Now I spend way more time trying to get it to output what I need than doing it myself. Productivity objectively went down with ChatGPT, and the increased token limits are completely wasted. It's become inconsistent, annoying, discriminatory, oversensitive, and utterly infuriating.  \n\n\nAll this for $20 a month. What a friggin bargain.  \nI used to think that those were the best $20 dollars I could ever spend. Not anymore. I genuinely feel like I'm paying $20 a month for an exercise in frustration. I get upset and angry everytime I use it, and it's consistent regardless of the use case scenario. I keep questioning why I am paying for this crap.\n\nWell, I just had one hell of a shitty session with ChatGPT. I wanted it to write a couple of paragraphs, from the first person point of view of the main character of my story, where he describes two other characters he's meeting. I gave it a general guidance on how I want them to look, and explicitly asked it to create those characters and their physical details. This used to be a piece of cake for ChatGPT in the past.\n\nInstead, it regurgitated the same guidance I gave, only writing it in its annoying, flowery, victorian play writing style. It acted like it's too stupid to understand that I want it to add in details and specificity following the general guidance I provided.  \nI told ChatGPT that I wanted specific details of the characters' appearances, and it did, barely, but it omitted other parts that it originally included in its previous response!  \nIt keeps changing its output constantly, even if you specifically identify parts to be perfect. I don't know why, but when you ask it to write a passage, it insists on keeping it a certain length. If you ask for more details, it add them but remove others, all in an apparent attempt to keep its output paragraphs at that certain length. And no, it's not long. ChatGPT is capable of much longer responses.\n\n&#x200B;\n\nAll in all, it feels like OpenAI is actively updating ChatGPT to be less and less productive and user friendly. It's literally almost useless right now, and totally not worth $20. Therefor, I have decided that I'm ending my subscription and deleting my account in objection to Open AI's direction.\n\nClaude, while having many of those issues, especially with the oversensitive moderation, is leagues better than ChatGPT at the moment, and I'm going to make it my main AI tool for everything I do. Heck, even the old GPT 3.5 and the early iterations of GPT 4 were way better than the garbage we have right now.\n\nYes, I realize ChatGPT 5 is coming soon. When it does, and it fixes the majority of these issues, I'll create a new account with OpenAI and subscribe agian. But until then, I'm leaving.",
    "send_replies": true,
    "spoiler": false,
    "stickied": false,
    "subreddit": "ChatGPT",
    "subreddit_id": "t5_7hqomg",
    "subreddit_name_prefixed": "r/ChatGPT",
    "subreddit_subscribers": 5045984,
    "subreddit_type": "public",
    "suggested_sort": null,
    "thumbnail": "self",
    "thumbnail_height": null,
    "thumbnail_width": null,
    "title": "That's it: I'm deleting my OpenAI Account!",
    "top_awarded_type": null,
    "total_awards_received": 0,
    "treatment_tags": [],
    "ups": 2,
    "upvote_ratio": 0.5799999833106995,
    "url": "https://www.reddit.com/r/ChatGPT/comments/1c1qup8/thats_it_im_deleting_my_openai_account/",
    "user_reports": [],
    "view_count": null,
    "visited": false,
    "whitelist_status": "all_ads",
    "wls": 6
}