{
    "_meta": {
        "retrieved_2nd_on": 1713249836
    },
    "all_awardings": [],
    "allow_live_comments": false,
    "approved_at_utc": null,
    "approved_by": null,
    "archived": false,
    "author": "PuzzleheadedOil1191",
    "author_flair_background_color": null,
    "author_flair_css_class": null,
    "author_flair_richtext": [],
    "author_flair_template_id": null,
    "author_flair_text": null,
    "author_flair_text_color": null,
    "author_flair_type": "text",
    "author_fullname": "t2_qcjzokitd",
    "author_is_blocked": false,
    "author_patreon_flair": false,
    "author_premium": false,
    "awarders": [],
    "banned_at_utc": null,
    "banned_by": null,
    "can_gild": false,
    "can_mod_post": false,
    "category": null,
    "clicked": false,
    "content_categories": null,
    "contest_mode": false,
    "created": 1713120225,
    "created_utc": 1713120225,
    "discussion_type": null,
    "distinguished": null,
    "domain": "self.ChatGPT",
    "downs": 0,
    "edited": false,
    "gilded": 0,
    "gildings": {},
    "hidden": false,
    "hide_score": false,
    "id": "1c40rdk",
    "is_created_from_ads_ui": false,
    "is_crosspostable": true,
    "is_meta": false,
    "is_original_content": false,
    "is_reddit_media_domain": false,
    "is_robot_indexable": true,
    "is_self": true,
    "is_video": false,
    "likes": null,
    "link_flair_background_color": "#ff66ac",
    "link_flair_css_class": "",
    "link_flair_richtext": [
        {
            "e": "text",
            "t": "Serious replies only "
        },
        {
            "a": ":closed-ai:",
            "e": "emoji",
            "u": "https://emoji.redditmedia.com/kiux00uuphia1_t5_7hqomg/closed-ai"
        }
    ],
    "link_flair_template_id": "c660b6fa-7be9-11ed-974b-1eca573371bf",
    "link_flair_text": "Serious replies only :closed-ai:",
    "link_flair_text_color": "light",
    "link_flair_type": "richtext",
    "locked": false,
    "media": null,
    "media_embed": {},
    "media_only": false,
    "mod_note": null,
    "mod_reason_by": null,
    "mod_reason_title": null,
    "mod_reports": [],
    "name": "t3_1c40rdk",
    "no_follow": false,
    "num_comments": 2,
    "num_crossposts": 0,
    "num_reports": null,
    "over_18": false,
    "parent_whitelist_status": "all_ads",
    "permalink": "/r/ChatGPT/comments/1c40rdk/how_do_you_see_generative_technology_changing/",
    "pinned": false,
    "pwls": 6,
    "quarantine": false,
    "removal_reason": null,
    "removed_by": null,
    "removed_by_category": null,
    "report_reasons": null,
    "retrieved_on": 1713120242,
    "saved": false,
    "score": 1,
    "secure_media": null,
    "secure_media_embed": {},
    "selftext": "If everyone will be able to  produce Hollywood level films in 5 years, will we still value the aesthetic of Hollywood productions? If everyone can produce studio quality pop music with an AI, will we still value it? \n\nWhen the camera first hit the scene in the late 1800s, people refused to call it art. Many believed a photograph should not even be copy-writable as it was ultimately the machine producing the image, not the human hand. But eventually a popular consensus formed that photography was in fact an art form, due to all of the manipulations one must make to both the camera and the scene to take a decent photograph.\n\nBut while the debate over photographies artistic merits still raged, Western painters and other visual artists already saw the writing on the wall. Why paint realistic scenes of nature when a camera can do it in an instant? Is painting for nothing more but recreating realistic forms? The impressionists obviously did not think so. Their hands were not as fast as cameras, they could not compete in terms of instantly recreating a scene, but their hands could do something cameras could not: paint how they feel. They could capture the emotional nature of a scene in an instant. They captured an emotion in time, not just the visuals. They could develop the *impression* of the scene, not just what was visible. From there we moved to fully abstract works and the rest is history.\n\nWe needed the camera to realize we could do more with visual art than simply dramatize reality. And viewers of art needed the camera to see that being able to just replicate reality was not always that interesting. They grew appetites for subject matters less obvious and formalized. When was the last time you heard about a famous artist making millions painting romantic nature scenes?\n\nAnd now we have arrived at today. We are still obsessed with dramatized versions of reality, but now in the form of film. Real people, real situations, real environments, just amplified for the 2 hour window of cinema. We watch massive CGI explosions with awe, we gasp with joy when our favorite actors burst out in the screen. \n\nBut now the camera has been eclipsed by a new reality generator. So when 5 year old can produce Godzilla level scenes of city scale destruction, and I can insert any actor I like into any dumb story I come up with, will we still feel the same awe in the movie theater? And why put up with a bad movie if I can just make my own? \n\nI personally feel excited. The reign of cinema had its moment, but the values, morals and visual aesthetics cinema projects are starting to feel just as dated as the technology stack. \n\nSo, will generative AI catalyze a new era of visual media in the same way the camera did? Will the unlimited content machine make consumers of media numb to the old aesthetics and crave something entirely new? And of course, what will this new media movement look like? Sound like? What will the creators care about and want to communicate? Is it already here?  Or do you disagree entirely, let me know.",
    "send_replies": true,
    "spoiler": false,
    "stickied": false,
    "subreddit": "ChatGPT",
    "subreddit_id": "t5_7hqomg",
    "subreddit_name_prefixed": "r/ChatGPT",
    "subreddit_subscribers": 5078504,
    "subreddit_type": "public",
    "suggested_sort": null,
    "thumbnail": "self",
    "thumbnail_height": null,
    "thumbnail_width": null,
    "title": "How do you see generative technology changing style and themes of popular media?  ",
    "top_awarded_type": null,
    "total_awards_received": 0,
    "treatment_tags": [],
    "ups": 1,
    "upvote_ratio": 0.6700000166893005,
    "url": "https://www.reddit.com/r/ChatGPT/comments/1c40rdk/how_do_you_see_generative_technology_changing/",
    "user_reports": [],
    "view_count": null,
    "visited": false,
    "whitelist_status": "all_ads",
    "wls": 6
}