{
    "_meta": {
        "is_edited": true,
        "retrieved_2nd_on": 1713728887
    },
    "all_awardings": [],
    "allow_live_comments": false,
    "approved_at_utc": null,
    "approved_by": null,
    "archived": false,
    "author": "Madrawn",
    "author_flair_background_color": null,
    "author_flair_css_class": null,
    "author_flair_richtext": [],
    "author_flair_template_id": null,
    "author_flair_text": null,
    "author_flair_text_color": null,
    "author_flair_type": "text",
    "author_fullname": "t2_4xvtx",
    "author_is_blocked": false,
    "author_patreon_flair": false,
    "author_premium": false,
    "awarders": [],
    "banned_at_utc": null,
    "banned_by": null,
    "can_gild": false,
    "can_mod_post": false,
    "category": null,
    "clicked": false,
    "content_categories": null,
    "contest_mode": false,
    "created": 1713599276,
    "created_utc": 1713599276,
    "discussion_type": null,
    "distinguished": null,
    "domain": "self.ChatGPT",
    "downs": 0,
    "edited": false,
    "gilded": 0,
    "gildings": {},
    "hidden": false,
    "hide_score": false,
    "id": "1c8kcsc",
    "is_created_from_ads_ui": false,
    "is_crosspostable": true,
    "is_meta": false,
    "is_original_content": false,
    "is_reddit_media_domain": false,
    "is_robot_indexable": true,
    "is_self": true,
    "is_video": false,
    "likes": null,
    "link_flair_background_color": "#94e044",
    "link_flair_css_class": "",
    "link_flair_richtext": [
        {
            "e": "text",
            "t": "Other "
        }
    ],
    "link_flair_template_id": "b4536a20-7be9-11ed-9a10-deed22fd00f8",
    "link_flair_text": "Other ",
    "link_flair_text_color": "light",
    "link_flair_type": "richtext",
    "locked": false,
    "media": null,
    "media_embed": {},
    "media_only": false,
    "mod_note": null,
    "mod_reason_by": null,
    "mod_reason_title": null,
    "mod_reports": [],
    "name": "t3_1c8kcsc",
    "no_follow": true,
    "num_comments": 2,
    "num_crossposts": 0,
    "num_reports": null,
    "over_18": false,
    "parent_whitelist_status": "all_ads",
    "permalink": "/r/ChatGPT/comments/1c8kcsc/for_a_discussion_in_class_i_have_to_come_up_with/",
    "pinned": false,
    "pwls": 6,
    "quarantine": false,
    "removal_reason": null,
    "removed_by": null,
    "removed_by_category": null,
    "report_reasons": null,
    "retrieved_on": 1713599293,
    "saved": false,
    "score": 1,
    "secure_media": null,
    "secure_media_embed": {},
    "selftext": "# I don't really buy into the fearmongering of \"AI will replace us all\".\n\nI think humanity is as much a lever for AI to move out of their equivalent of primordial ooze, as AI is \"just\" a tool for humanity. We have a long history of extending our abilities by external utilities. Smartphones, messengers (or basically just written text) are as much, if not more by now, the de-facto way that humanity communicates. The distant places we can reach is no longer dependent on our body but our car. Our impact on the world around us is already caused by more than our fleshy mortal shell, but the mechanical and digital extensions we place around us. I guess we, humanity and smart algorithms, might become a more and more connected \"organism\" where what I would call \"me\" is more akin to a node in a network that, in its whole, others would see as what they think of when they think of me. Just like how you might already associate specific friends or colleagues with specific platforms, profiles, personas or messengers.\n\n# There is no more pressure on AI to supplant us than there is pressure on cats to supplant us.\n\nEven if in the most far-thinking way, a case could be made that cats are more likely to survive as a species if they were the sole master over earth. If cats were to surpass us in most if not all capabilities, we still benefit from our company and complement each other. And as humanity isn't currently bent on wiping out all cats, I don't believe AI would bent on wiping us out even if they were to make us \"obsolete\" in principle. \n\n(Regarding the point \"How will we ensure that AI systems are aligned with human values and goals?\", I avoided engaging with it as I think it is a red herring. As it implies some struggle for dominance, and in the same breath one could ask \"How will we ensure that Humans are aligned with AI-system values and goals?\", while my whole case could be said to be that these will quite naturally converge to be the same (at least as much as can be said that human-values are the same overall). I would argue that humans unaligned with AI-systems values and AI-systems unaligned with human values each are less \"efficient\" and would be naturally superseded by the Human-AI population that arrived at a convergent value system. Just as value-systems already compete without AI.)\n\n# I think the challenges will be generational at most.\n\nI think we already have the seeds that have to grow for a full integration to happen. We already think in terms of \"legacy\", \"family\", \"dynasty\". These concepts only need to include the artificial that is connected to your existence and as soon as they do, which will most likely happen for the generation that grows up knowing nothing else, society will naturally conform to these (as soon as the older generations \"die out\").\n\n# Addendum:\n\nRegarding the second point, my train of thought was, that even though cats could evolve in a way that supplants us there is no need or pressure for them to do so. My case, that I'm trying to make, is that even if or when AI gets the capability to develop on their own in a direction that makes wiping us out the logical conclusion, there is no true pressure on them to do so.\n\nWith my last point about \"legacy\" I was thinking of examples, like that in the future a family could very well have an \"interactive\" family tree, where each ancestor has not only a picture, but possibly a whole model trained on every recorded written or spoken word during life. Just like some AI might become a natural extension of ourselves, like currently glasses or smartphones are, some AI might de-facto become \"family\" by being part of the \"legacy\" of one's ancestors. Or you might get as insulted by a person treating your answering machine AI badly as you would by them saying it to your face. But I left it out for now because I felt it sounds a bit much \"spiritual\" and challenges current identity and familiar values and the connection we have with loved ones in a way that might cause readers a bit of offense and turn them away from my thesis as a whole.",
    "send_replies": true,
    "spoiler": false,
    "stickied": false,
    "subreddit": "ChatGPT",
    "subreddit_id": "t5_7hqomg",
    "subreddit_name_prefixed": "r/ChatGPT",
    "subreddit_subscribers": 5147263,
    "subreddit_type": "public",
    "suggested_sort": null,
    "thumbnail": "self",
    "thumbnail_height": null,
    "thumbnail_width": null,
    "title": "For a discussion in class I have to come up with a optimistic case for AI. What is your opinion of my 3-point thesis:",
    "top_awarded_type": null,
    "total_awards_received": 0,
    "treatment_tags": [],
    "ups": 1,
    "upvote_ratio": 0.6700000166893005,
    "url": "https://www.reddit.com/r/ChatGPT/comments/1c8kcsc/for_a_discussion_in_class_i_have_to_come_up_with/",
    "user_reports": [],
    "view_count": null,
    "visited": false,
    "whitelist_status": "all_ads",
    "wls": 6
}