{
    "_meta": {
        "retrieved_2nd_on": 1713840708
    },
    "all_awardings": [],
    "allow_live_comments": false,
    "approved_at_utc": null,
    "approved_by": null,
    "archived": false,
    "author": "TrippleBeats",
    "author_flair_background_color": null,
    "author_flair_css_class": null,
    "author_flair_richtext": [],
    "author_flair_template_id": null,
    "author_flair_text": null,
    "author_flair_text_color": null,
    "author_flair_type": "text",
    "author_fullname": "t2_gl0j6qqsh",
    "author_is_blocked": false,
    "author_patreon_flair": false,
    "author_premium": false,
    "awarders": [],
    "banned_at_utc": null,
    "banned_by": null,
    "can_gild": false,
    "can_mod_post": false,
    "category": null,
    "clicked": false,
    "content_categories": null,
    "contest_mode": false,
    "created": 1713711099,
    "created_utc": 1713711099,
    "discussion_type": null,
    "distinguished": null,
    "domain": "self.ChatGPT",
    "downs": 0,
    "edited": false,
    "gilded": 0,
    "gildings": {},
    "hidden": false,
    "hide_score": false,
    "id": "1c9jr04",
    "is_created_from_ads_ui": false,
    "is_crosspostable": true,
    "is_meta": false,
    "is_original_content": false,
    "is_reddit_media_domain": false,
    "is_robot_indexable": true,
    "is_self": true,
    "is_video": false,
    "likes": null,
    "link_flair_background_color": "#ffb000",
    "link_flair_css_class": "",
    "link_flair_richtext": [
        {
            "e": "text",
            "t": "Gone Wild "
        }
    ],
    "link_flair_template_id": "bd4e6832-7bbc-11ed-97cb-0e48625ac41d",
    "link_flair_text": "Gone Wild ",
    "link_flair_text_color": "dark",
    "link_flair_type": "richtext",
    "locked": false,
    "media": null,
    "media_embed": {},
    "media_only": false,
    "mod_note": null,
    "mod_reason_by": null,
    "mod_reason_title": null,
    "mod_reports": [],
    "name": "t3_1c9jr04",
    "no_follow": false,
    "num_comments": 61,
    "num_crossposts": 0,
    "num_reports": null,
    "over_18": false,
    "parent_whitelist_status": "all_ads",
    "permalink": "/r/ChatGPT/comments/1c9jr04/im_ready_for_ai_to_destroy_careers/",
    "pinned": false,
    "pwls": 6,
    "quarantine": false,
    "removal_reason": null,
    "removed_by": null,
    "removed_by_category": null,
    "report_reasons": null,
    "retrieved_on": 1713711115,
    "saved": false,
    "score": 0,
    "secure_media": null,
    "secure_media_embed": {},
    "selftext": "I absolutely do not glorify the destruction of jobs that help people make a living. However, we are entering into an age where it will be impossible to capitalize on entertainment, when anyone can just instantaneously generate anything at their fingertips, with the entering of a prompt.\n\nI started listening to audiobooks recently, and was was shocked to learn that the only main stream audio streaming service, isn’t designed to be a streaming service but an online bookstore to buy books. Like many people, I work long shifts where I can listen to audiobooks all day, and can easily burn through books so quickly that audible becomes very expensive.\n\nI complained about this and people told me that my complaint was wrong because it takes a lot of hard work in time for people to put these audiobooks together. And while I agree with them, that the authors of those books should absolutely be supported, along with the audiobook narrators, I am absolutely ready for AI to annihilate some of their jobs from existence.\n\nAnd I don’t see this as a bad thing. What I see is a problem where people can’t consume the content they want to consume, without paying someone to do it. But now AI is learning to do it better and more affordably- and people are afraid. People are afraid that they will no longer be necessary, that they can no longer capitalize on the desires of others in respect to entertainment. It is almost pathetic, to think that people would rather limit, and restrict AI’s potential, for the sake of maintaining recreational jobs in entertainment industries. I believe AI will destroy the entertainment industry, because anyone not using AI will ultimately be out paced by it’s practically infinite potential.\n\nTL,DR: In the not too distant future, a great number of people in the entertainment industries will lose their jobs because anyone using AI will quickly outpace anyone in quality and quantity. Rendering the value of human work, as inefficient and comparably ineffective. so I’m ready for AI to destroy jobs, not for the sake of reducing the value of people, but for the sake of diminishing the capitalization of entertainment, because anyone in the future will be able to create great content without having to be a great writer or artist. This doesn’t mean we’ll lose great writers, or artists, or that people will lose interest in man-made works, but just that we are moving from using horses as the standard for transportation, to vehicular transportation. Paid services for carriages, or whatever they used to use for transportation, will become irrelevant. Likewise, much entertainment of today will be considered of an old age. And its almost as laughable, as it is sad, that people think we should continue supporting capitalistic practices in the entertainment industry, when instead we can reach for the stars",
    "send_replies": true,
    "spoiler": false,
    "stickied": false,
    "subreddit": "ChatGPT",
    "subreddit_id": "t5_7hqomg",
    "subreddit_name_prefixed": "r/ChatGPT",
    "subreddit_subscribers": 5163147,
    "subreddit_type": "public",
    "suggested_sort": null,
    "thumbnail": "self",
    "thumbnail_height": null,
    "thumbnail_width": null,
    "title": "I’m ready for AI to destroy careers",
    "top_awarded_type": null,
    "total_awards_received": 0,
    "treatment_tags": [],
    "ups": 0,
    "upvote_ratio": 0.41999998688697815,
    "url": "https://www.reddit.com/r/ChatGPT/comments/1c9jr04/im_ready_for_ai_to_destroy_careers/",
    "user_reports": [],
    "view_count": null,
    "visited": false,
    "whitelist_status": "all_ads",
    "wls": 6
}