{
    "_meta": {
        "removal_type": "deleted",
        "retrieved_2nd_on": 1714412257,
        "was_deleted_later": true
    },
    "all_awardings": [],
    "allow_live_comments": false,
    "approved_at_utc": null,
    "approved_by": null,
    "archived": false,
    "author": "VillageCapital2415",
    "author_flair_background_color": null,
    "author_flair_css_class": null,
    "author_flair_richtext": [],
    "author_flair_template_id": null,
    "author_flair_text": null,
    "author_flair_text_color": null,
    "author_flair_type": "text",
    "author_fullname": "t2_h2pcnnwoc",
    "author_is_blocked": false,
    "author_patreon_flair": false,
    "author_premium": false,
    "awarders": [],
    "banned_at_utc": null,
    "banned_by": null,
    "can_gild": false,
    "can_mod_post": false,
    "category": null,
    "clicked": false,
    "content_categories": null,
    "contest_mode": false,
    "created": 1714282651,
    "created_utc": 1714282651,
    "discussion_type": null,
    "distinguished": null,
    "domain": "self.ChatGPT",
    "downs": 0,
    "edited": false,
    "gilded": 0,
    "gildings": {},
    "hidden": false,
    "hide_score": false,
    "id": "1ceywt6",
    "is_created_from_ads_ui": false,
    "is_crosspostable": true,
    "is_meta": false,
    "is_original_content": false,
    "is_reddit_media_domain": false,
    "is_robot_indexable": true,
    "is_self": true,
    "is_video": false,
    "likes": null,
    "link_flair_background_color": "#94e044",
    "link_flair_css_class": "",
    "link_flair_richtext": [
        {
            "e": "text",
            "t": "Other "
        }
    ],
    "link_flair_template_id": "b4536a20-7be9-11ed-9a10-deed22fd00f8",
    "link_flair_text": "Other ",
    "link_flair_text_color": "light",
    "link_flair_type": "richtext",
    "locked": false,
    "media": null,
    "media_embed": {},
    "media_only": false,
    "mod_note": null,
    "mod_reason_by": null,
    "mod_reason_title": null,
    "mod_reports": [],
    "name": "t3_1ceywt6",
    "no_follow": false,
    "num_comments": 48,
    "num_crossposts": 0,
    "num_reports": null,
    "over_18": false,
    "parent_whitelist_status": "all_ads",
    "permalink": "/r/ChatGPT/comments/1ceywt6/should_teachers_be_punished_for_using_chatgpt/",
    "pinned": false,
    "pwls": 6,
    "quarantine": false,
    "removal_reason": null,
    "removed_by": null,
    "removed_by_category": null,
    "report_reasons": null,
    "retrieved_on": 1714282664,
    "saved": false,
    "score": 0,
    "secure_media": null,
    "secure_media_embed": {},
    "selftext": "I am a senior in high-school (an academically competitive middle college high-school) and recently I have noticed my Economic teacher’s flagrant use of ChatGPT in nearly all of her assignments. We’ll call her Ms. Slater. Miss Slater is a young teacher, relatively new staff member at this school. As far as I know she is still completing her own education while working as a teacher and frequently mentions how she is expecting a pay raise after she is finished. Teachers at this school are paid more than the comprehensive high schools in the area and I believe most of them are outstanding teachers who deserve every penny. Normally I would not care very much about a teacher using AI but this particular teacher is a different story. A few weeks back, Ms Slater sent emails out to all students stating that she had found out that a number of students had been using AI to complete assignments, which she discovered after using a free online AI detector. The following day she went on a stern rant about how she was much too qualified to be dealing with such laziness, and announced that anyone found to have been using AI would be punished over the coming weeks. I thought this was fair since technically they weren’t doing the work themselves and shrugged it off. A few weeks pass and all of the students caught have been punished. I am unsure what exactly the punishment was but Im assuming they either received 0 on the assignment or perhaps had to complete extra work. Anyway as I am doing work I start to notice how wordy and systematic the instructions on her assignments are. There are needless sections with bullet points that just explain key points and learning objectives of the assignment. Words like “delve” or “additionally” used throughout. It was these patterns that reminded me of how ChatGPT usually responds, so I copied some of her words into the very same free online AI detector she claims to use and every time they were flagged as 90-100 percent AI generated. I’ve heard these detectors aren’t always accurate but they  were every flagged every time without fail. I was shocked that this teacher, who had so  passionately ranted against use of AI, uses it herself in nearly every one of her assignments! I can’t help but wonder if she should be held to the same standard that she holds her students to. You would think someone so outspoken would practice what they preach especially at such a respected academy. If she is using AI to do all the assignments, who’s to say she’s not using it for all her duties? Grading? Lesson planning? Why should the district be paying somebody to do so much when really ChatGPT has been behind it all? Personally I don’t think it’s a crime for teachers to use it now and then, but for everything? It just feels wrong that this teacher has “rules for thee but not for me” in her class and I wonder if anything should be done. ",
    "send_replies": true,
    "spoiler": false,
    "stickied": false,
    "subreddit": "ChatGPT",
    "subreddit_id": "t5_7hqomg",
    "subreddit_name_prefixed": "r/ChatGPT",
    "subreddit_subscribers": 5241800,
    "subreddit_type": "public",
    "suggested_sort": null,
    "thumbnail": "self",
    "thumbnail_height": null,
    "thumbnail_width": null,
    "title": "Should teachers be punished for using ChatGPT?",
    "top_awarded_type": null,
    "total_awards_received": 0,
    "treatment_tags": [],
    "ups": 0,
    "upvote_ratio": 0.4300000071525574,
    "url": "https://www.reddit.com/r/ChatGPT/comments/1ceywt6/should_teachers_be_punished_for_using_chatgpt/",
    "user_reports": [],
    "view_count": null,
    "visited": false,
    "whitelist_status": "all_ads",
    "wls": 6
}