{
    "_meta": {
        "retrieved_2nd_on": 1714519393
    },
    "all_awardings": [],
    "allow_live_comments": false,
    "approved_at_utc": null,
    "approved_by": null,
    "archived": false,
    "author": "Apprehensive_Form396",
    "author_flair_background_color": null,
    "author_flair_css_class": null,
    "author_flair_richtext": [],
    "author_flair_template_id": null,
    "author_flair_text": null,
    "author_flair_text_color": null,
    "author_flair_type": "text",
    "author_fullname": "t2_cbfs8rj1",
    "author_is_blocked": false,
    "author_patreon_flair": false,
    "author_premium": false,
    "awarders": [],
    "banned_at_utc": null,
    "banned_by": null,
    "can_gild": false,
    "can_mod_post": false,
    "category": null,
    "clicked": false,
    "content_categories": null,
    "contest_mode": false,
    "created": 1714389782,
    "created_utc": 1714389782,
    "discussion_type": null,
    "distinguished": null,
    "domain": "self.ChatGPT",
    "downs": 0,
    "edited": false,
    "gilded": 0,
    "gildings": {},
    "hidden": false,
    "hide_score": false,
    "id": "1cfwn5g",
    "is_created_from_ads_ui": false,
    "is_crosspostable": true,
    "is_meta": false,
    "is_original_content": false,
    "is_reddit_media_domain": false,
    "is_robot_indexable": true,
    "is_self": true,
    "is_video": false,
    "likes": null,
    "link_flair_background_color": "#0079d3",
    "link_flair_css_class": "",
    "link_flair_richtext": [
        {
            "e": "text",
            "t": "Educational Purpose Only "
        }
    ],
    "link_flair_template_id": "26e7b998-7bbc-11ed-ba93-22ce55064b6a",
    "link_flair_text": "Educational Purpose Only ",
    "link_flair_text_color": "dark",
    "link_flair_type": "richtext",
    "locked": false,
    "media": null,
    "media_embed": {},
    "media_only": false,
    "mod_note": null,
    "mod_reason_by": null,
    "mod_reason_title": null,
    "mod_reports": [],
    "name": "t3_1cfwn5g",
    "no_follow": true,
    "num_comments": 8,
    "num_crossposts": 0,
    "num_reports": null,
    "over_18": false,
    "parent_whitelist_status": "all_ads",
    "permalink": "/r/ChatGPT/comments/1cfwn5g/i_put_900_hours_into_learning_everything_about_ai/",
    "pinned": false,
    "post_hint": "self",
    "preview": {
        "enabled": false,
        "images": [
            {
                "id": "KHybHaC5xAaMnzDVxVUrNy-Tx6P6hzJZpzmLkExvFIg",
                "resolutions": [
                    {
                        "height": 50,
                        "url": "https://external-preview.redd.it/0L4Yi-BpCkGrw4DxvFrBqKI-_fL8757AA0-NVBtOE5s.jpg?width=108&crop=smart&auto=webp&s=2c4760b7499cb4870526fc119991891ab6409822",
                        "width": 108
                    },
                    {
                        "height": 100,
                        "url": "https://external-preview.redd.it/0L4Yi-BpCkGrw4DxvFrBqKI-_fL8757AA0-NVBtOE5s.jpg?width=216&crop=smart&auto=webp&s=52f109697c15e1cf69f7c624c0f490d7b953ed5c",
                        "width": 216
                    },
                    {
                        "height": 149,
                        "url": "https://external-preview.redd.it/0L4Yi-BpCkGrw4DxvFrBqKI-_fL8757AA0-NVBtOE5s.jpg?width=320&crop=smart&auto=webp&s=38c3772b2d7c9194ddfb70e96153d33678063b1c",
                        "width": 320
                    },
                    {
                        "height": 299,
                        "url": "https://external-preview.redd.it/0L4Yi-BpCkGrw4DxvFrBqKI-_fL8757AA0-NVBtOE5s.jpg?width=640&crop=smart&auto=webp&s=3ccc90b6d61182da0ace3fda1543a38e22c04d44",
                        "width": 640
                    },
                    {
                        "height": 448,
                        "url": "https://external-preview.redd.it/0L4Yi-BpCkGrw4DxvFrBqKI-_fL8757AA0-NVBtOE5s.jpg?width=960&crop=smart&auto=webp&s=de725ee6e46644ea66f98c2703bbb5f3f7d83ae0",
                        "width": 960
                    },
                    {
                        "height": 504,
                        "url": "https://external-preview.redd.it/0L4Yi-BpCkGrw4DxvFrBqKI-_fL8757AA0-NVBtOE5s.jpg?width=1080&crop=smart&auto=webp&s=a4d357aed5ea8707ab34d480d10ca4e007f83beb",
                        "width": 1080
                    }
                ],
                "source": {
                    "height": 748,
                    "url": "https://external-preview.redd.it/0L4Yi-BpCkGrw4DxvFrBqKI-_fL8757AA0-NVBtOE5s.jpg?auto=webp&s=e7d434049ce325d5171017bb72af6326da6cace0",
                    "width": 1600
                },
                "variants": {}
            }
        ]
    },
    "pwls": 6,
    "quarantine": false,
    "removal_reason": null,
    "removed_by": null,
    "removed_by_category": null,
    "report_reasons": null,
    "retrieved_on": 1714389797,
    "saved": false,
    "score": 0,
    "secure_media": null,
    "secure_media_embed": {},
    "selftext": "\n\n\"I'm not sure what's more impressive, the things AI can actually do, or the things people think AI can do\"\n\nAI tools are like teenagers: they have all the answers, but no or little real-world experience\n\nI recently launched[ Seekme.ai](http://www.seekme.ai), a massive directory of AI tools (over 12,000 and counting!). It's your one-stop shop for finding the perfect AI to boost your work or projects.\n\nBut building this directory wasn't all fun and games. Here are 7 crucial lessons I learned along the way:\n\n**The AI Wild West:** The AI tools landscape is like the Wild West – chaotic and full of surprises. You've got everything from big tech giants to solo developers, each with their own quality, features, and price tags.\n\n\n\nBig Tech Giants  bring a wealth of resources, expertise, and established brand recognition. Their AI tools often have robust features, extensive documentation, and strong support. However, they can also be pricey and may have complex licensing models for instance we all know our beloved ChatGPT, Anthropic AI\n\nOn the other end of the spectrum, there are solo developers who are creating innovative AI tools on their own. These developers bring fresh perspectives, unique features, and often prioritize simplicity and affordability. They may not have the same level of resources or support as the big tech giants, but their tools can be highly specialized and tailored to specific needs.\n\nI would say whenever rating an AI tool based on its functionality do see who is the founder so it gives more perspective to you\n\n**AI or AI-washing?**: Not everything that glitters is gold. Many tools claim to be AI-powered but are just old software with a fancy new label. Don't fall for the hype – be a savvy consumer!\n\nA lot of tools have added the WORD AI in their ranks to cash in on the hype even though there is nothing AI or breakthrough about their product . I would recommend crosscheck this before buying the tool also understand how are they leveraging AI for the use or they are just AI washing\n\n**User-Friendly AI is King:** The best AI tools are like MrBeast's videos – easy to use and understand, even if you're not a tech expert. No-code and low-code tools are making AI accessible to everyone!\n\nFrom our research we found out its not the tool that does the best job wins in people's eyes but the the tools that helps do the job in the best and easy manner wins.\n\npeople like things to be easy and simple like Iphones so they wont mind paying a premium.\n\n\n\n**The Mystery Box of AI: Unveiling the Black Box**\n\nMany AI companies are secretive about their algorithms, making it difficult to understand how their tools work and make informed decisions about their use. This lack of transparency can raise concerns about bias, fairness, and accountability.\n\nFor example: An AI-powered hiring tool might inadvertently discriminate against certain groups of candidates based on biased training data. Or, an AI-powered loan approval system might unfairly deny loans to certain individuals without clear explanations we might feel oh this is good but if the underlying data it is trained on bias in the longer run it is for worse but not good . We need to push for greater transparency and explainability in AI so that we can trust the technology and use it responsibly.\n\n**The Future is Generative:** Get ready for an explosion of AI tools that can create text, images, and even videos. Think ChatGPT and Midjourney, but on steroids!\n\n\n\nImagine AI tools that can write different kinds of creative content, from poems and scripts to musical pieces and email newsletters. Or, picture AI tools that can generate realistic images and videos from text descriptions, opening up new possibilities for artists, designers, and filmmakers\n\nBut that is what is happening Open AI will eventually want itself to be a one stop shop for all this needs and I do not see any tools remotely competing in this so this is good for us as consumers in the longer run but it does kill competition and creates market monopoly.\n\n**Niche AI Tools Might Go Extinct:** With so many AI tools popping up, the specialized ones might struggle to survive.\n\nFor example: A specialized AI tool for generating social media captions might face stiff competition from a more general-purpose AI writing assistant that can handle a wider range of tasks\n\nAnalogy: It's like a survival challenge – only the strongest and most adaptable AI tools will thrive in the long run. Tools that can integrate seamlessly into existing workflows and offer a wide range of functionalities will have a competitive edge.\n\nSo, what does this all mean for you?\n\nBe a critical thinker! Don't just believe the hype. Do your research and choose AI tools that truly add value.\n\n\n\nI would highly recommend learning prompts and how you can master prompts to get most our of your jobs.\n\n\n\nNow I will start  doing reviews of the most top voted AI tools in terms of pricing, ease of use, trust, quality which can help us choosing the best AI tools. I share these insights on my [newsletter](https://seekme.ai/subscribe/newsletter) so you can join here .\n\n\n\nBut I would like to know what do you all think about the same ? Any other learning ? feedback ? experiences ?\n\n",
    "send_replies": true,
    "spoiler": false,
    "stickied": false,
    "subreddit": "ChatGPT",
    "subreddit_id": "t5_7hqomg",
    "subreddit_name_prefixed": "r/ChatGPT",
    "subreddit_subscribers": 5255457,
    "subreddit_type": "public",
    "suggested_sort": null,
    "thumbnail": "self",
    "thumbnail_height": null,
    "thumbnail_width": null,
    "title": "I put 900 + hours into learning everything about AI Tools. Here are 7 tips that can help you the choose the next best one tool for you or your business",
    "top_awarded_type": null,
    "total_awards_received": 0,
    "treatment_tags": [],
    "ups": 0,
    "upvote_ratio": 0.25,
    "url": "https://www.reddit.com/r/ChatGPT/comments/1cfwn5g/i_put_900_hours_into_learning_everything_about_ai/",
    "user_reports": [],
    "view_count": null,
    "visited": false,
    "whitelist_status": "all_ads",
    "wls": 6
}