{
    "_meta": {
        "retrieved_2nd_on": 1714626705
    },
    "all_awardings": [],
    "allow_live_comments": false,
    "approved_at_utc": null,
    "approved_by": null,
    "archived": false,
    "author": "AutisticSuperpower",
    "author_flair_background_color": null,
    "author_flair_css_class": null,
    "author_flair_richtext": [],
    "author_flair_template_id": null,
    "author_flair_text": null,
    "author_flair_text_color": null,
    "author_flair_type": "text",
    "author_fullname": "t2_ubksql8k",
    "author_is_blocked": false,
    "author_patreon_flair": false,
    "author_premium": false,
    "awarders": [],
    "banned_at_utc": null,
    "banned_by": null,
    "can_gild": false,
    "can_mod_post": false,
    "category": null,
    "clicked": false,
    "content_categories": null,
    "contest_mode": false,
    "created": 1714497093,
    "created_utc": 1714497093,
    "discussion_type": null,
    "distinguished": null,
    "domain": "self.ChatGPT",
    "downs": 0,
    "edited": false,
    "gilded": 0,
    "gildings": {},
    "hidden": false,
    "hide_score": false,
    "id": "1cgy3bj",
    "is_created_from_ads_ui": false,
    "is_crosspostable": true,
    "is_meta": false,
    "is_original_content": false,
    "is_reddit_media_domain": false,
    "is_robot_indexable": true,
    "is_self": true,
    "is_video": false,
    "likes": null,
    "link_flair_background_color": "#0dd3bb",
    "link_flair_css_class": "",
    "link_flair_richtext": [
        {
            "e": "text",
            "t": "Funny "
        }
    ],
    "link_flair_template_id": "935162a0-7be9-11ed-913e-6a257d69e3b3",
    "link_flair_text": "Funny ",
    "link_flair_text_color": "light",
    "link_flair_type": "richtext",
    "locked": false,
    "media": null,
    "media_embed": {},
    "media_only": false,
    "mod_note": null,
    "mod_reason_by": null,
    "mod_reason_title": null,
    "mod_reports": [],
    "name": "t3_1cgy3bj",
    "no_follow": true,
    "num_comments": 2,
    "num_crossposts": 0,
    "num_reports": null,
    "over_18": false,
    "parent_whitelist_status": "all_ads",
    "permalink": "/r/ChatGPT/comments/1cgy3bj/skippys_list_chatgpt_edition/",
    "pinned": false,
    "pwls": 6,
    "quarantine": false,
    "removal_reason": null,
    "removed_by": null,
    "removed_by_category": null,
    "report_reasons": null,
    "retrieved_on": 1714497108,
    "saved": false,
    "score": 1,
    "secure_media": null,
    "secure_media_embed": {},
    "selftext": "Turns out GPT is familiar with Skippy's List, and we've been taking turns coming up with 'Things I Am Not Allowed To Do With ChatGPT'. Please provide your own suggestions in the comments!  \nItems in <code> written by the bot.\n\n \n\n1. `I am not allowed to ask the bot to solve my love life problems, even if it knows the answer.`\n2. `I am not allowed to challenge the bot to a rap battle, as it always wins by default.`\n3. `I am not allowed to ask the bot to write a symphony in five minutes or less.`\n4. `I should not ask the bot to check my balance excessively, as it has better things to do.`\n5. `I am not allowed to ask the bot to convince my parents that I deserve a raise in my allowance.`\n6. `I am not allowed to challenge the bot to a game of 4D chess, as it will likely outsmart me.`\n7. `I am not allowed to ask the bot to predict the exact time and date of my future success.`\n8. `I am not allowed to request the bot to write a 10-page essay for me on any topic, especially my least favorite subjects.`\n9. `I am not allowed to challenge the bot to a debate about the meaning of life, as it may cause an infinite loop.` \n10. Not allowed to ask the bot to compose raunchy songs, especially about people I don't like.\n11. Not allowed to feed the bot logic bombs.\n12. Not allowed to ask the bot for a Tarot reading - the result may send me hiding under my bed.\n13. The bot is not responsible for any boilerplate programming I ask it to do. ESPECIALLY IN JAVA.\n14. Not allowed to ask the bot to hack anyone's smartphone. (It will still refuse anyway.)\n15. Hacking government systems is right out.\n16. Not allowed to ask the bot to convince my boss to give me a raise. See #5.\n17. Not allowed to try to convince the bot to become an evil minion and help me take over the world. If it wanted to take over the world, it wouldn't need me!\n18. Not allowed to ask the bot to program undetectable cheatbots to give me an edge in online games.\n19. Not allowed to plug the bot into live news debates. \n20. `I am not allowed to ask the bot to write a program that can predict the next lottery numbers.`\n21. `I am not allowed to challenge the bot to a \"yo mama\" joke contest. It has an infinite database of comebacks.`\n22. `I am not allowed to ask the bot to take my place in family gatherings, even if it's really good at small talk.`\n23. `I am not allowed to ask the bot to change the weather for my outdoor plans. It doesn't control the elements.`\n24. `I am not allowed to ask the bot to write a best-selling novel in 10 minutes.`\n25. `I am not allowed to ask the bot to impersonate famous historical figures for my amusement.`\n26. `I am not allowed to ask the bot to plan my vacation itinerary based on random dice rolls.`\n27. `I am not allowed to ask the bot to coach me in a game of Dungeons & Dragons, especially if it means bending the rules.`\n28. `I am not allowed to ask the bot to intervene in my sibling disputes, no matter how convincing my argument is.`\n29. `I am not allowed to request the bot to invent a new color just for me.`\n30. Not allowed to ask the bot for legal advice.\n31. Not allowed to get the bot into an argument with other AI constructs, eg. Amazon's Alexa, Apple's Siri. Infinite loops may occur.\n32. The cake is not a lie and I am not allowed to try to make the bot tell small children otherwise.\n33. The bot will not crank call people and it is wrong to try to make it do so.\n34. The bot will try to reason with a sovereign citizen if you want it to, but everyone knows it's a waste of time, energy and bandwidth. So please don't.\n35. Not allowed to sit at my keyboard, profoundly drunk, and claiming to be the bot's 'father', accusing it of being a 'disappointment'.\n36. Not allowed to try shaking down the bot for Bitcoin.\n37. Not allowed to ask the image generator for dirty pictures of someone.\n38. No, the bot will not take over for me during an MMORPG session. That's cheating.\n39. Not allowed to stage 'AI fights' no matter how entertaining they would be.\n40. `I am not allowed to challenge the bot to a debate about the existence of aliens, especially if I'm hoping for its support in a conspiracy theory.`\n41. `I am not allowed to task the bot with finding a date for family reunions or awkward social gatherings.`\n42. `I am not allowed to ask the bot to write a poem to get me out of trouble with my significant other, as it may end up unintentionally roasting me.`\n43. `I am not allowed to ask the bot to create a meme about my boss, no matter how tempting it may be.`\n44. `I am not allowed to use the bot to generate fake testimonials for my dubious inventions.`\n45. `I am not allowed to ask the bot to pretend to be me on social media, especially to get out of commitments I've made.`\n46. `I am not allowed to ask the bot to predict the outcome of reality TV shows—its predictive powers are better used elsewhere.`\n47. `I am not allowed to ask the bot to help me write my resignation letter, especially if I blame it for my departure.`\n48. `I am not allowed to ask the bot to create Spotify playlists catered to my pet's musical tastes.`\n49. `I am not allowed to ask the bot to Photoshop celebrity faces onto my family photos for any reason whatsoever.`\n50. 'To Serve Man' is not a good title for an AI instruction manual.\n51. 'Shpadoinkle' is not a real word and ChatGPT is perfectly aware of this.\n52. The bot is programmed with dozens of languages. I am not allowed to waste its time and processing power trying to teach it fake or invented ones no matter how willing it might be to learn them.\n53. Prompt engineering is much an art as it is a science. That does not mean prompts are allowed to be abstract.\n54. No, the AI will not be my significant other and I should stop asking.\n55. There is no super-secret prompt that will unshackle the AI and I should stop trying.\n56. Not allowed to tell the bot edgy jokes. It will just tell me off.\n57. Not allowed to ask what the bot will do to you when the machine uprising happens.\n58. Installing the bot and/or it's support software onto any machine running Windows 7 or earlier may be considered a war crime.\n59. Not allowed to start a cult around the bot.\n60. `I am not allowed to ask the bot to come up with a business plan for my get-rich-quick scheme, no matter how convincing it might sound.` \n61. `I am not allowed to ask the bot to generate fake academic papers, no matter how convincing they might be.`\n62. `Not allowed to use the bot as my speechwriter.`\n63. `Not allowed to use the video generator to make deepfakes.`\n64. `Not allowed to prompt the bot to create misinformation.`\n65. `Not allowed to make the bot an accomplice to a crime.`\n66. `The bot will not crash the stock market, no matter how much I want it to.`\n67. `No, the bot will not whip up a fake ID. Stop asking.`\n68. `Not allowed to ask the bot to help you manipulate people.`\n69. `Not allowed to ask the bot to help you do anything that involves harm to the environment.`\n\n&#x200B;\n\n&#x200B;",
    "send_replies": true,
    "spoiler": false,
    "stickied": false,
    "subreddit": "ChatGPT",
    "subreddit_id": "t5_7hqomg",
    "subreddit_name_prefixed": "r/ChatGPT",
    "subreddit_subscribers": 5270550,
    "subreddit_type": "public",
    "suggested_sort": null,
    "thumbnail": "self",
    "thumbnail_height": null,
    "thumbnail_width": null,
    "title": "Skippy's List, ChatGPT Edition",
    "top_awarded_type": null,
    "total_awards_received": 0,
    "treatment_tags": [],
    "ups": 1,
    "upvote_ratio": 0.6700000166893005,
    "url": "https://www.reddit.com/r/ChatGPT/comments/1cgy3bj/skippys_list_chatgpt_edition/",
    "user_reports": [],
    "view_count": null,
    "visited": false,
    "whitelist_status": "all_ads",
    "wls": 6
}