{
    "_meta": {
        "is_edited": true,
        "retrieved_2nd_on": 1715318636
    },
    "all_awardings": [],
    "allow_live_comments": false,
    "approved_at_utc": null,
    "approved_by": null,
    "archived": false,
    "author": "Realistic_Repair5195",
    "author_flair_background_color": null,
    "author_flair_css_class": null,
    "author_flair_richtext": [],
    "author_flair_template_id": null,
    "author_flair_text": null,
    "author_flair_text_color": null,
    "author_flair_type": "text",
    "author_fullname": "t2_h8t4hqmn",
    "author_is_blocked": false,
    "author_patreon_flair": false,
    "author_premium": false,
    "awarders": [],
    "banned_at_utc": null,
    "banned_by": null,
    "can_gild": false,
    "can_mod_post": false,
    "category": null,
    "clicked": false,
    "content_categories": null,
    "contest_mode": false,
    "created": 1715189026,
    "created_utc": 1715189026,
    "discussion_type": null,
    "distinguished": null,
    "domain": "self.ChatGPT",
    "downs": 0,
    "edited": false,
    "gilded": 0,
    "gildings": {},
    "hidden": false,
    "hide_score": false,
    "id": "1cna5bh",
    "is_created_from_ads_ui": false,
    "is_crosspostable": true,
    "is_meta": false,
    "is_original_content": false,
    "is_reddit_media_domain": false,
    "is_robot_indexable": true,
    "is_self": true,
    "is_video": false,
    "likes": null,
    "link_flair_background_color": "#ff66ac",
    "link_flair_css_class": "",
    "link_flair_richtext": [
        {
            "e": "text",
            "t": "Serious replies only "
        },
        {
            "a": ":closed-ai:",
            "e": "emoji",
            "u": "https://emoji.redditmedia.com/kiux00uuphia1_t5_7hqomg/closed-ai"
        }
    ],
    "link_flair_template_id": "c660b6fa-7be9-11ed-974b-1eca573371bf",
    "link_flair_text": "Serious replies only :closed-ai:",
    "link_flair_text_color": "light",
    "link_flair_type": "richtext",
    "locked": false,
    "media": null,
    "media_embed": {},
    "media_only": false,
    "mod_note": null,
    "mod_reason_by": null,
    "mod_reason_title": null,
    "mod_reports": [],
    "name": "t3_1cna5bh",
    "no_follow": true,
    "num_comments": 12,
    "num_crossposts": 0,
    "num_reports": null,
    "over_18": false,
    "parent_whitelist_status": "all_ads",
    "permalink": "/r/ChatGPT/comments/1cna5bh/errorriddled_feedback_on_a_university_assignment/",
    "pinned": false,
    "poll_data": {
        "is_prediction": false,
        "options": [
            {
                "id": "28002282",
                "text": "REASONABLE to suspect AI-generated feedback"
            },
            {
                "id": "28002283",
                "text": "MAY BE REASONABLE to suspect AI-generated feedback"
            },
            {
                "id": "28002284",
                "text": "UNREASONABLE to suspect AI-generated feedback"
            },
            {
                "id": "28002285",
                "text": "See Results"
            }
        ],
        "prediction_status": null,
        "resolved_option_id": null,
        "total_stake_amount": null,
        "total_vote_count": 19,
        "tournament_id": null,
        "user_selection": null,
        "user_won_amount": null,
        "vote_updates_remained": null,
        "voting_end_timestamp": 1715793826309
    },
    "pwls": 6,
    "quarantine": false,
    "removal_reason": null,
    "removed_by": null,
    "removed_by_category": null,
    "report_reasons": null,
    "retrieved_on": 1715189107,
    "saved": false,
    "score": 5,
    "secure_media": null,
    "secure_media_embed": {},
    "selftext": " Hi all,\n\nI recently got feedback on an assignment I submitted and received several erroneous criticisms. These are errors that I highly doubt a person would have made, and combined with a robotic style of writing at times, I'm wondering if faculty is using AI to provide feedback. Faculty has never alerted students to the possible use of AI in marking. When I messaged the course convenor about the errors in the feedback (not my AI suspicions) their response also seemed a bit suspect for AI use.\n\n*Direct quotes at the end of the post*, for now these examples:\n\n* They quote parts of my work, and claimed content was not included, such as \"*consider 'x'*\" or \"*follow-up on 'y'*\". Meanwhile, such content was evidently provided in the preceding sentences/paragraphs.\n* They read so closely that it appears they have flagged the inconsistent spacing between words as a formatting error. Meanwhile, such text was set to 'justified', a routine formatting setting to enhance the appearance of a body text.\n* Spelling and grammar issues were supposedly throughout the text, but upon review by myself and the faculty, none could be identified.\n* Blatant errors concerning visual elements. For example, criticising the placement of a figure title as being above a figure when it was clearly below the figure. Alternatively, discussing the placement of titles for figures (plural) when there was only one. How could a human who read the assignment ever make such mistakes with visual elements?\n* Providing a high-level summary but missing essential details of the assignment and using vague and robotic language/word choices (e.g., multifaceted/outcome). At times, they also end up regurgitating the marking criteria to illustrate the differences between scoring bands and then claiming something objective is subjective and thus not contestable.\n\nWhen I raised the errors with the course convenor, she seemed to double down on most issues, and based on our emails, she seemed to use AI herself. The course convenor may be the original marker. Moreover, because of the implicit issues of academic integrity, I'm afraid to raise my concerns with faculty given the risk of reprisal - the course convenor is influential, and they can likely mark down my future work and cause professional difficulties for me after I graduate. Given our lengthy email exchange, even if I were to report it anonymously, the course convenor may still be able to figure out it was me. I briefly considered requesting a formal remark, but it would likely go directly back to the course convenor, and I could be punished (uni policy does not stipulate a different marker).\n\n**Now, this is where I need your help:**\n\n1. Do you think I have some valid reasons to suspect the use of AI? Please see the poll. Why / why not?\n2. What are some red flags for AI use? Do you have any good resources you could link? I've tried some AI detectors, but this appears too advanced.\n3. Are you aware of academic staff/faculties that covertly use AI for marking? What sort of program/software do they use?  GPT3.5/4? What are the mechanics - could they upload rubrics with assignments and prompts?\n4. How would you suggest I approach the issue? I fear reprisal if identified by faculty. However, I'd like the issues to be addressed, especially as continued AI use with inadequate oversight has the potential to continue to harm my marks. I'm thinking of approaching my co-supervisor unofficially for advice. We have a good working relationship, and I trust them. I'm on a student rep body, but I don't know of other students in a similar situation yet, and if I raised it officially as a rep I'd be too identifiable.\n\n**Please share your thoughts,**\n\nThank you!\n\n&#x200B;\n\n**PS: Verbatim quotes**\n\n*Original Feedback*\n\n\"I really enjoyed reading your review of the multifaceted issues facing standardization of detecting SSLs. You have provided an excellent introduction of SSL and provided a comprehensive, integrated overview of the multiple factors which can affect outcome.\" NB: To me this feel vague, and neglects essential parts of the assignment that I covered.\n\n\"However, as you've covered so much content, it's really important that you provide relevant justification for your critical appraisal of the cited literature. For example, at the start of page 9, you write that the it is possible the excluded study provided superior examination quality relative to the rest of the region. When making a claim like this, it is advisable to follow up on the article. Consider highlighting the significance of the variable DR across different continents. Whilst that section contains a lot of information, the importance of standardization gets lost in the text - include a concluding section to make it clearer for your reader/re-emphasize the importance of your point.  \nAlthough you defined some of your abbreviations in tables, consider writing it out again in-text.\" NB: The requested follow up on the article, and the significance of variable detection rates (DR) was clearly provided in the preceding text.\n\n\"Note that figure legends should always be under the figure\" NB: while this clearly wasn't an issue in the one and only figure of my assignment, see what came later in email...\n\n*From subsequent email exchange...*\n\n\"With regards to spelling and grammar the reviewer may have believed “trialled” was spelt incorrectly but I noted you consistently applied English spelling throughout, therefore I would consider it free from spelling and grammar issues. I agree the comment “Figure legends should always be under the figure” is misplaced, I didn’t identify any issues with the figure legends.\" NB: this is a complete 180 from the original feedback which stated 'spelling and grammar errors throughout'; moreover, they appear to think there are multiple (plural) figures but there is only one (perhaps an error from rephrasing the original feedback that had \"legends\").\n\n\"Justification of distinction for critical analysis. You were awarded a distinction which the rubric describes as “Critical analysis of strengths and limitations of the literature” and High Distinction as “Comprehensive Critical analysis of strengths and limitations of the literature”. The reviewer comments on critical analysis on page 9 “However, such selection bias may underestimate the true prevalence of SSLs as it is possible that the excluded study provided superior examination quality relative to the rest of the region.” They indicate this as one example where further critical analysis could be provided by follow-up of the article. This is tough to argue as they have indicated specifically what they consider comprehensive critical analysis and hence what is required for a HD.\" NB: this feels like AI regurgitation of input data, and the content they claim was missing was very clearly in the prior sentence - other academics I have discussed this with agree on this point. I half suspect the email was a Copilot (or equivalent) response, as if they had actually read my email, I doubt they would have taken that position.\n\n[View Poll](https://www.reddit.com/poll/1cna5bh)",
    "send_replies": true,
    "spoiler": false,
    "stickied": false,
    "subreddit": "ChatGPT",
    "subreddit_id": "t5_7hqomg",
    "subreddit_name_prefixed": "r/ChatGPT",
    "subreddit_subscribers": 5366183,
    "subreddit_type": "public",
    "suggested_sort": null,
    "thumbnail": "self",
    "thumbnail_height": null,
    "thumbnail_width": null,
    "title": "Error-riddled feedback on a university assignment; could it be AI-generated??? Please help!",
    "top_awarded_type": null,
    "total_awards_received": 0,
    "treatment_tags": [],
    "ups": 5,
    "upvote_ratio": 0.7699999809265137,
    "url": "https://www.reddit.com/r/ChatGPT/comments/1cna5bh/errorriddled_feedback_on_a_university_assignment/",
    "user_reports": [],
    "view_count": null,
    "visited": false,
    "whitelist_status": "all_ads",
    "wls": 6
}