{
    "_meta": {
        "retrieved_2nd_on": 1715931487
    },
    "all_awardings": [],
    "allow_live_comments": false,
    "approved_at_utc": null,
    "approved_by": null,
    "archived": false,
    "author": "Weary-Bell-4541",
    "author_flair_background_color": null,
    "author_flair_css_class": null,
    "author_flair_richtext": [],
    "author_flair_template_id": null,
    "author_flair_text": null,
    "author_flair_text_color": null,
    "author_flair_type": "text",
    "author_fullname": "t2_aqptd3f3j",
    "author_is_blocked": false,
    "author_patreon_flair": false,
    "author_premium": false,
    "awarders": [],
    "banned_at_utc": null,
    "banned_by": null,
    "can_gild": false,
    "can_mod_post": false,
    "category": null,
    "clicked": false,
    "content_categories": null,
    "contest_mode": false,
    "created": 1715801871,
    "created_utc": 1715801871,
    "discussion_type": null,
    "distinguished": null,
    "domain": "self.ChatGPT",
    "downs": 0,
    "edited": false,
    "gilded": 0,
    "gildings": {},
    "hidden": false,
    "hide_score": false,
    "id": "1cstovo",
    "is_created_from_ads_ui": false,
    "is_crosspostable": true,
    "is_meta": false,
    "is_original_content": false,
    "is_reddit_media_domain": false,
    "is_robot_indexable": true,
    "is_self": true,
    "is_video": false,
    "likes": null,
    "link_flair_background_color": "#ff66ac",
    "link_flair_css_class": "",
    "link_flair_richtext": [
        {
            "e": "text",
            "t": "Serious replies only :closed-ai:"
        }
    ],
    "link_flair_template_id": "c660b6fa-7be9-11ed-974b-1eca573371bf",
    "link_flair_text": "Serious replies only :closed-ai:",
    "link_flair_text_color": "light",
    "link_flair_type": "richtext",
    "locked": false,
    "media": null,
    "media_embed": {},
    "media_only": false,
    "mod_note": null,
    "mod_reason_by": null,
    "mod_reason_title": null,
    "mod_reports": [],
    "name": "t3_1cstovo",
    "no_follow": true,
    "num_comments": 10,
    "num_crossposts": 0,
    "num_reports": null,
    "over_18": false,
    "parent_whitelist_status": "all_ads",
    "permalink": "/r/ChatGPT/comments/1cstovo/why_is_chatgpt_not_using_other_strategies_to/",
    "pinned": false,
    "pwls": 6,
    "quarantine": false,
    "removal_reason": null,
    "removed_by": null,
    "removed_by_category": null,
    "report_reasons": null,
    "retrieved_on": 1715801886,
    "saved": false,
    "score": 1,
    "secure_media": null,
    "secure_media_embed": {},
    "selftext": "I can't seem to figure out why ChatGPT is only (as I believe) using an transformer architecture?\n\nI mean like I am building an AI with the goal of being very, very accurate and efficient in generalization and just be very intelligent. \n\n  \nI am using several methods most of them already existing and few of them which I came up with. \n\nMy AI is divididen in parts:\n\n1. Read, 2. Creative thinking, 3. Logical/Critical thinking, 4. Write, 5. Memory.\n\nFor read and write I am using existing architectures. And for the memory I am using something way different from AI but definitely makes the AI smart.\n\nThanks to my memory it can learn in real time based on prompts. Eg: 7+9 = 16. It still needs a ton of data to actually succefully perform addition relative to humans who don't need a ton of examples.\n\nAnd when a user asks something, it will go through the read part so the AI \"knows\" what to do with it. Now all the magic happens at the creative thinking part. Because with my theory (haven't coded it yet, but in theory it should work.) it can actually generalize very, very well. The creative thinking part will use the info provided by the read part to acces the memory part and select the required information. \n\nThe memory stores only numbers. Numbers that setup neural networks. These numbers are important for retrieving the information stored in the memory. Thanks to my memory setup, the creative thinking part can link different NN with each other. For instance:\n\nI = 7+8\\*2\n\nThe read part understands that it is an mathematical problem and thus passes the info to the creative thinking part. (The creative thinking part isn't always creative! I gave it this name because it has the ability to be creative but it also just gets the correct answer for for instance mathematical problems.) The creative thinking part will link order of operations with addition and multiplication and fires them in order. So thanks to order of operations it will know that it needs to do 8\\*2 first and then 7+16 = 23.  This is an simple example of generalization. The concept is the same for other things. Like if we wanted to create an time machine, then it might link Physics, quantum physics, astrophysics with eachother (have no idea but that's what I think lol) Like blackholes cause time to slow down for you so yea it might link that with it and actually use that.\n\nI have already created the memory part and the real-time learning system. It automatically overrides NN's in the memory with new information. Just like humans. And learns in real-time. I am saying NN's in the memory because all the memory stores is the values given by the learning phase when it succesfully learned to do something and never makes mistakes anymore. So weights, biases are stored and when it needs to be used, it will create an NN with the values to retrieve the answer. - The creative part sets up the NN with the values. \n\nWhat I currently have works. The only thing that still needs to be coded is the creative part.\n\n  \nNow what I don't really get is, my approach (did not tell you everything) should in theory make the AI better but it is an fairly simple concept. If I told you, you would get an \"ahhh\" moment. Now ofcourse, the thing that actually makes my AI better than other current models is the creative part. The memory is very simple just like the learning phase. And without the creative part it is nothing. The memory I have and the learning phase just makes it to actually understand stuff. So this prevents it from delivering inaccurate information when it learned something. \n\nThe big difference right now between mine and others is that it doesn't respond based on patterns. Instead it bases it's responses on things it learned. \n\nNow I understand that pattern recognition can indeed also make an AI very smart, but it will never actually really think and know what something is. Whereas in the creative part it does generate relevant or irrelevant thoughts but still accurate thoughts. And the memory is just basically stored knowledge which makes it know stuff. And right now that is probably the closest I will get to representing it to know stuff compared to humans.  \n\n\n  \nLet me know your thoughts on this! I apologize for repeating some things if I did. ",
    "send_replies": true,
    "spoiler": false,
    "stickied": false,
    "subreddit": "ChatGPT",
    "subreddit_id": "t5_7hqomg",
    "subreddit_name_prefixed": "r/ChatGPT",
    "subreddit_subscribers": 5469159,
    "subreddit_type": "public",
    "suggested_sort": null,
    "thumbnail": "self",
    "thumbnail_height": null,
    "thumbnail_width": null,
    "title": "Why is ChatGPT not using other strategies to create an super intelligent AI?",
    "top_awarded_type": null,
    "total_awards_received": 0,
    "treatment_tags": [],
    "ups": 1,
    "upvote_ratio": 0.6000000238418579,
    "url": "https://www.reddit.com/r/ChatGPT/comments/1cstovo/why_is_chatgpt_not_using_other_strategies_to/",
    "user_reports": [],
    "view_count": null,
    "visited": false,
    "whitelist_status": "all_ads",
    "wls": 6
}