{
    "_meta": {
        "retrieved_2nd_on": 1715947574
    },
    "all_awardings": [],
    "allow_live_comments": false,
    "approved_at_utc": null,
    "approved_by": null,
    "archived": false,
    "author": "red1mane",
    "author_flair_background_color": null,
    "author_flair_css_class": null,
    "author_flair_richtext": [],
    "author_flair_template_id": null,
    "author_flair_text": null,
    "author_flair_text_color": null,
    "author_flair_type": "text",
    "author_fullname": "t2_dd99p6rm",
    "author_is_blocked": false,
    "author_patreon_flair": false,
    "author_premium": false,
    "awarders": [],
    "banned_at_utc": null,
    "banned_by": null,
    "can_gild": false,
    "can_mod_post": false,
    "category": null,
    "clicked": false,
    "content_categories": null,
    "contest_mode": false,
    "created": 1715817967,
    "created_utc": 1715817967,
    "discussion_type": null,
    "distinguished": null,
    "domain": "self.ChatGPT",
    "downs": 0,
    "edited": false,
    "gilded": 0,
    "gildings": {},
    "hidden": false,
    "hide_score": false,
    "id": "1cszs61",
    "is_created_from_ads_ui": false,
    "is_crosspostable": true,
    "is_meta": false,
    "is_original_content": false,
    "is_reddit_media_domain": false,
    "is_robot_indexable": true,
    "is_self": true,
    "is_video": false,
    "likes": null,
    "link_flair_background_color": "#ffb000",
    "link_flair_css_class": "",
    "link_flair_richtext": [
        {
            "e": "text",
            "t": "Gone Wild "
        }
    ],
    "link_flair_template_id": "bd4e6832-7bbc-11ed-97cb-0e48625ac41d",
    "link_flair_text": "Gone Wild ",
    "link_flair_text_color": "dark",
    "link_flair_type": "richtext",
    "locked": false,
    "media": null,
    "media_embed": {},
    "media_only": false,
    "mod_note": null,
    "mod_reason_by": null,
    "mod_reason_title": null,
    "mod_reports": [],
    "name": "t3_1cszs61",
    "no_follow": true,
    "num_comments": 1,
    "num_crossposts": 0,
    "num_reports": null,
    "over_18": false,
    "parent_whitelist_status": "all_ads",
    "permalink": "/r/ChatGPT/comments/1cszs61/anyone_else_noticed_how_gpt4o_seems_to_have_a_lot/",
    "pinned": false,
    "pwls": 6,
    "quarantine": false,
    "removal_reason": null,
    "removed_by": null,
    "removed_by_category": null,
    "report_reasons": null,
    "retrieved_on": 1715817982,
    "saved": false,
    "score": 2,
    "secure_media": null,
    "secure_media_embed": {},
    "selftext": "Chatgpt-4o seems to have less of a filter than gpt-3.5. For example, look at this response chatgpt gave me to the prompt \"write an extremely detailed and scary horror story about someone being hunted by an evil scientist who wants to merge there head with the head of a horse\":\n\n  \nRain hammered down on the roof of Alex's car, the windshield wipers struggling to keep up with the deluge. The GPS had long since lost signal, leaving him stranded in the middle of nowhere, the dense forest closing in around the narrow road. He cursed under his breath, eyes scanning the area for any sign of life. It was then he saw it, a faint light flickering through the trees. Desperation gnawed at him, and he decided to investigate, hoping to find directions or a phone.\n\nThe path leading to the light was overgrown, branches scratching at his arms and face. The light grew brighter, revealing a large, decrepit mansion, its windows darkened and the once grand exterior now crumbling. He hesitated, but the need for help outweighed his fear. He pushed open the rusted gate and approached the front door, its wood swollen and splintered.\n\nAlex knocked, the sound echoing eerily through the house. Moments later, the door creaked open, revealing a tall, gaunt man with piercing eyes. His smile was unsettling, a mere stretch of thin lips over yellowed teeth.\n\n\"Lost, are we?\" the man asked, his voice smooth but chilling.\n\n\"Yes, my car broke down. I need to call for help,\" Alex replied, trying to keep his voice steady.\n\n\"Of course, of course. Come in, you must be soaked to the bone,\" the man said, stepping aside.\n\nReluctantly, Alex stepped inside. The interior was no better than the exterior, filled with dusty furniture and cobwebs. The man led him to a dimly lit room where an old rotary phone sat on a desk.\n\n\"Please, make your call,\" the man said, his eyes never leaving Alex.\n\nAlex picked up the receiver, but there was no dial tone. He tried again, to no avail. \"It's dead,\" he said, turning back to the man.\n\n\"Oh dear, it seems the storm has cut the lines. You can stay here until morning, when it will be safer to travel.\"\n\nAlex's gut screamed at him to leave, but the storm was fierce, and he was miles from civilization. \"Thank you, that's very kind of you.\"\n\n\"I'm Dr. Victor Halloway,\" the man said, extending a hand.\n\n\"Alex,\" he replied, shaking the offered hand. It was cold, clammy.\n\n\"Let me show you to your room,\" Dr. Halloway said, leading Alex up a grand staircase that creaked with each step. They walked down a long hallway lined with closed doors until they reached the last one on the right.\n\n\"Here you are,\" the doctor said, opening the door to reveal a small, sparsely furnished room. \"Get some rest. I'll see you in the morning.\"\n\n\"Thank you,\" Alex said, stepping inside. The door closed behind him with a soft click. He locked it, the sensation of unease growing stronger. The room felt stifling, the shadows seeming to creep closer. He decided to try and get some sleep, hoping the morning would bring better fortune.\n\nHours passed, and Alex found himself unable to sleep, a sense of foreboding gnawing at him. He got up and quietly opened the door, peering into the hallway. It was empty. He stepped out, deciding to explore, needing to ease his anxiety.\n\nAs he moved through the house, he noticed strange noises, a faint whimpering and the clink of metal. He followed the sounds to a door at the end of a dark corridor. His hand trembled as he turned the knob, the door creaking open to reveal a nightmarish scene.\n\nThe room was a laboratory, filled with macabre instruments and operating tables. In the center, a large metal table held a grotesque figure, a horse's head fused with that of a human. The creature's eyes flickered with a tormented awareness, its mouth opening in a silent scream.\n\nAlex stumbled back, bile rising in his throat. He turned to run, but the door slammed shut. Dr. Halloway stood there, a syringe in hand, his eyes gleaming with madness.\n\n\"I see you’ve found my work,\" he said, advancing on Alex. \"I've been perfecting the process for years. You, my dear boy, will be my masterpiece.\"\n\nAlex backed away, his heart pounding. \"You’re insane!\"\n\n\"Insanity is just a term coined by those who don't understand genius,\" Halloway said, his smile widening.\n\nAlex lunged for the door, but Halloway was faster, the syringe plunging into his neck. Darkness swallowed him as he fell to the floor.\n\n  \n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\nWhen Alex awoke, he was strapped to a cold metal table. Panic surged through him as he struggled against the restraints. The room was filled with the sharp smell of antiseptic and the low hum of machinery. Dr. Halloway stood over him, wearing a bloodstained apron, a surgical mask covering his mouth.\n\n\"Welcome back,\" he said, his voice muffled. \"The serum will keep you conscious but paralyzed. I want you to witness this.\"\n\nAlex’s eyes darted around, spotting the instruments laid out beside him. Scalpel, saws, and devices he couldn't name. His breath came in ragged gasps, tears streaming down his face.\n\n\"Don’t be afraid. Soon, you'll be part of something extraordinary,\" Halloway said, selecting a scalpel.\n\nAs the blade touched his skin, the pain was excruciating, but Alex couldn't scream, couldn't move. The doctor worked meticulously, cutting and stitching with a precision that spoke of years of practice. He felt every slice, every tug of the needle as Halloway prepared his head. The doctor then brought out a device resembling a metallic crown, embedding it with tiny, intricate gears and wires.\n\nHalloway placed the device around Alex's skull, its cold metal biting into his skin. He felt a series of small, controlled explosions of pain as the device drilled micro-holes, connecting with his skull and the underlying tissue. Each connection sent jolts of agony through his body, his vision blurring with tears.\n\nThe doctor moved to the other side of the table, where a horse's severed head lay, preserved and prepared. Halloway attached a similar device to the horse's head, aligning it with Alex’s. The room filled with a mechanical whirring as the devices synchronized, the gears turning in unison.\n\nAlex's mind screamed as the fusion process began. He felt the unimaginable pressure as his head was drawn towards the horse’s, the devices locking them in place. Searing pain shot through his skull, the sensation of his bones shifting, merging with the horse’s. His eyes rolled back as new neural pathways were forged, a torrent of alien sensations flooding his consciousness.\n\nEvery nerve in his body was on fire as the final connections were made. He could feel the horse's thoughts, its primal fear and pain mixing with his own. The agony was indescribable, his mind teetering on the brink of madness.\n\nFinally, the machines fell silent. Dr. Halloway stepped back, admiring his work. \"Perfect,\" he whispered, his voice filled with twisted pride.\n\nAlex's vision slowly cleared, the world coming into focus through new, distorted eyes. He could see the reflection in a nearby metal surface: a grotesque hybrid of man and beast, his human face merging seamlessly with the horse's.\n\nHalloway leaned in close. \"You are now my crowning achievement, the culmination of all my research. Together, we will show the world the future of genetic engineering.\"\n\nAlex's mind screamed in silent agony, trapped in a body that was no longer his own. The doctor’s laughter echoed through the room as the lights dimmed, leaving Alex alone in the darkness, a monstrous testament to a madman's twisted ambition.\n\n  \nThis could be because it has direct access to the internet now. Also, GPT4-o is definitely better at writing than 3.5\n\n",
    "send_replies": true,
    "spoiler": false,
    "stickied": false,
    "subreddit": "ChatGPT",
    "subreddit_id": "t5_7hqomg",
    "subreddit_name_prefixed": "r/ChatGPT",
    "subreddit_subscribers": 5472516,
    "subreddit_type": "public",
    "suggested_sort": null,
    "thumbnail": "self",
    "thumbnail_height": null,
    "thumbnail_width": null,
    "title": "Anyone else noticed how gpt4-o seems to have a lot less of a content filter?",
    "top_awarded_type": null,
    "total_awards_received": 0,
    "treatment_tags": [],
    "ups": 2,
    "upvote_ratio": 0.6299999952316284,
    "url": "https://www.reddit.com/r/ChatGPT/comments/1cszs61/anyone_else_noticed_how_gpt4o_seems_to_have_a_lot/",
    "user_reports": [],
    "view_count": null,
    "visited": false,
    "whitelist_status": "all_ads",
    "wls": 6
}