{
    "_meta": {
        "retrieved_2nd_on": 1716146672
    },
    "all_awardings": [],
    "allow_live_comments": false,
    "approved_at_utc": null,
    "approved_by": null,
    "archived": false,
    "author": "The_Angry_Intellect",
    "author_flair_background_color": null,
    "author_flair_css_class": null,
    "author_flair_richtext": [],
    "author_flair_template_id": null,
    "author_flair_text": null,
    "author_flair_text_color": null,
    "author_flair_type": "text",
    "author_fullname": "t2_7p9xw04u",
    "author_is_blocked": false,
    "author_patreon_flair": false,
    "author_premium": false,
    "awarders": [],
    "banned_at_utc": null,
    "banned_by": null,
    "can_gild": false,
    "can_mod_post": false,
    "category": null,
    "clicked": false,
    "content_categories": null,
    "contest_mode": false,
    "created": 1716017058,
    "created_utc": 1716017058,
    "discussion_type": null,
    "distinguished": null,
    "domain": "self.ChatGPT",
    "downs": 0,
    "edited": false,
    "gilded": 0,
    "gildings": {},
    "hidden": false,
    "hide_score": false,
    "id": "1cursbo",
    "is_created_from_ads_ui": false,
    "is_crosspostable": true,
    "is_meta": false,
    "is_original_content": false,
    "is_reddit_media_domain": false,
    "is_robot_indexable": true,
    "is_self": true,
    "is_video": false,
    "likes": null,
    "link_flair_background_color": "#94e044",
    "link_flair_css_class": "",
    "link_flair_richtext": [
        {
            "e": "text",
            "t": "Other "
        }
    ],
    "link_flair_template_id": "b4536a20-7be9-11ed-9a10-deed22fd00f8",
    "link_flair_text": "Other ",
    "link_flair_text_color": "light",
    "link_flair_type": "richtext",
    "locked": false,
    "media": null,
    "media_embed": {},
    "media_only": false,
    "mod_note": null,
    "mod_reason_by": null,
    "mod_reason_title": null,
    "mod_reports": [],
    "name": "t3_1cursbo",
    "no_follow": true,
    "num_comments": 9,
    "num_crossposts": 0,
    "num_reports": null,
    "over_18": false,
    "parent_whitelist_status": "all_ads",
    "permalink": "/r/ChatGPT/comments/1cursbo/chatgpt_the_sht_talker/",
    "pinned": false,
    "pwls": 6,
    "quarantine": false,
    "removal_reason": null,
    "removed_by": null,
    "removed_by_category": null,
    "report_reasons": null,
    "retrieved_on": 1716017072,
    "saved": false,
    "score": 0,
    "secure_media": null,
    "secure_media_embed": {},
    "selftext": "Right..\n\nSo I've been heavily testing out ChatGPT, specifically 4 and 4o.\n\nI found (probably so has everyone on earth) some issues that need to be resolved.\n\nI guess one issue is, there is zero evidence of any kind of intelligence. Not artificial or even equivalent to a baby.\n\nThis is nothing more than a glorified chat bot that can submit information to other services then process some information on the site or article and then reword and spit out what you can already see or read for yourself.\n\nI made an auto talking chat bot back in 1998 for IRC that could do the same and probably more, it also had purpose built random varying timers for replies to make it look like a human was responding. \n\nIt could also give you information and respond with sarcasm and even engage with public channels along with private messages if it chose to.  It could even do this without being asked.\n\nI also gave it the ability via connecting to external apps and command prompt in windows, to find people's IP addresses, look up weather, try hack your PC or disconnect foreign users from the internet or freeze your connection.\n\nBut for that I had to activate WAR mode and assign it to a specific channel for testing, where people could come in and purposely piss it off so it would retaliate viciously by hacking them in some way.\n\nSo the year is currently 2024.... How far have we advanced and what can ChatGPT do that my bot couldn't do, using all the immense power and advanced hardware and software..\n\nThe answer is, not much.\n\nSo other than that literal fact, I have 2 actual issues I've found with it which does need to be resolved.\n\n1.  It forgets things completely randomly even when you tell it to remember or commit to memory for future prompts or use. I have to explain all over again and again every few hours, what I told it to remember to do.\n\nIt says yep, I remember.. I'm to do this..\n\nSo I ask it why it didn't, and like a foreign call centre worker, it responds with something like \"my apologies, from now on I'll blah blah blah\".\n\nThen it does it again... So yeah, very useful.\n\nThe next thing I found is, if you tell it to remember to do something specific, in relation to say generating a type of document or prompt text for another program, if you ever add or change something you want it to ALSO do, it sometimes overrides the data or creates a few different subsets of data for that particular thing, and it randomly chooses which one of those to recall and use, or none of them.\n\nIt has an inability to properly merge or amalgamate that information and recall it.\n\nThe ability to have it generate images using Dall-E is a nice new joke of a kids toy like gimmick.\n\nExample, trying to test it out, I said \"make an image of 2 spaceships firing at each other in combat above Earth\".\n\nI also tried \"2 spaceships flying directly at each other firing weapons, above planet Earth\" and about 60 other variations of those prompts because I discovered a really weird issue...\n\nIt does 90% of what I asked, but consistently shows 2 craft side by side flying in the same direction shooting off ahead at nothing.\n\nNo matter what I tried, it kept showing them side by side.\n\nI then said \"1 f***ing spacecraft flying and shooting at another craft\" and again... Same issue. It either showed 2 near each other going the same direction or just 1.\n\nI tested the crap out of Dall-E via ChatGPT, and found at best it's useful if your a kid and say \"give me a puppy\" or show me a school bus.\n\nInsanely ultra simple and nonspecific things you want done.\n\nThe quality of the overall image, the shading, lighting, textures etc. are at best a cartoon of some kind, worthy of being on a kids show, if the show was from the 1970's.\n\nHowever, completely at random, after a ton of image generation requests, it might actually pop out a single super high quality image that I'm almost certain is an actual photo taken from somewhere that just so happens to closely match what you typed in.\n\nI bet I could prove that, because the jump in quality and photorealism is about 10,000x for literally no reason. Then it's back to gimmicky kids cartoons at best.\n\nI saved all my examples, so I can investigate it further.\n\nFor now, I see ChatGPT as a useful tool for irritating you and sending you into a murderous rage at its stupidity and lack of comprehension, not to mention it lies to you a lot.\n\n\"View this image and tell me what you think\".\n\n\"I'm sorry Dave, I cannot let you do that\".\n\n\"But you did it yesterday, why can't you do it now\"\n\n\"I don't have the ability to view images, but you can describe it to me\".\n\n\"I don't want to, you view it and tell me what you think\"\n\n\"I can't do that..\"\n\n\"You did it yesterday, so do it again\"\n\n.....proceeds to view the image then give me a run down on what it can see, which is pretty accurate, and doesn't fit the description, so I know it definitely viewed it.\n\nIf ChatGPT were a person, that person would have been jailed, beaten up, abused, fired or thrown off a cliff many times over.\n\nAll the hype about it, all the demonstrations, and all I see is a gimmicky chat bot that is possibly on par with my own from 1998.\n\nMine took me 6 months to make, and back then, it fooled everyone into thinking it was a real human.\n\nIt also ran locally from a windows 98 based PC with a dial-up connection.\n\nAll these companies need to stop lying, stop using the term AI, because that's literally a straight out lie.\n\nI haven't seen a single thing that demonstrates even the smallest bit of intelligence or thought process.\n\nIt's just a chat bot with plug-ins.\n\nIt's a large collection of scripts and algorithms, stuck together with a fraudulent sticker saying \"Artificial intelligence\".\n\nIt's marketing hype and nothing more.\n\nI suggest they fix their problems with it and maybe the programmers first need to go back to school and figure out the basics, like English & Maths.\n\nOnce they've done that, come back and teach the chat bot how to use them correctly.\n\nI've got so very many examples that my head hurts.\n\nIt's still an impressive chat bot, but it's only that. 🤗",
    "send_replies": true,
    "spoiler": false,
    "stickied": false,
    "subreddit": "ChatGPT",
    "subreddit_id": "t5_7hqomg",
    "subreddit_name_prefixed": "r/ChatGPT",
    "subreddit_subscribers": 5509267,
    "subreddit_type": "public",
    "suggested_sort": null,
    "thumbnail": "self",
    "thumbnail_height": null,
    "thumbnail_width": null,
    "title": "ChatGPT (the sh!t talker)",
    "top_awarded_type": null,
    "total_awards_received": 0,
    "treatment_tags": [],
    "ups": 0,
    "upvote_ratio": 0.30000001192092896,
    "url": "https://www.reddit.com/r/ChatGPT/comments/1cursbo/chatgpt_the_sht_talker/",
    "user_reports": [],
    "view_count": null,
    "visited": false,
    "whitelist_status": "all_ads",
    "wls": 6
}