{
    "_meta": {
        "is_edited": true,
        "retrieved_2nd_on": 1716679751
    },
    "all_awardings": [],
    "allow_live_comments": false,
    "approved_at_utc": null,
    "approved_by": null,
    "archived": false,
    "author": "Threeeboysssub",
    "author_flair_background_color": null,
    "author_flair_css_class": null,
    "author_flair_richtext": [],
    "author_flair_template_id": null,
    "author_flair_text": null,
    "author_flair_text_color": null,
    "author_flair_type": "text",
    "author_fullname": "t2_grdknwtd",
    "author_is_blocked": false,
    "author_patreon_flair": false,
    "author_premium": false,
    "awarders": [],
    "banned_at_utc": null,
    "banned_by": null,
    "can_gild": false,
    "can_mod_post": false,
    "category": null,
    "clicked": false,
    "content_categories": null,
    "contest_mode": false,
    "created": 1716550141,
    "created_utc": 1716550141,
    "discussion_type": null,
    "distinguished": null,
    "domain": "self.ChatGPT",
    "downs": 0,
    "edited": false,
    "gilded": 0,
    "gildings": {},
    "hidden": false,
    "hide_score": false,
    "id": "1czii7l",
    "is_created_from_ads_ui": false,
    "is_crosspostable": true,
    "is_meta": false,
    "is_original_content": false,
    "is_reddit_media_domain": false,
    "is_robot_indexable": true,
    "is_self": true,
    "is_video": false,
    "likes": null,
    "link_flair_background_color": "#0dd3bb",
    "link_flair_css_class": "",
    "link_flair_richtext": [
        {
            "e": "text",
            "t": "AI takeover predictions "
        }
    ],
    "link_flair_template_id": "935162a0-7be9-11ed-913e-6a257d69e3b3",
    "link_flair_text": "AI takeover predictions ",
    "link_flair_text_color": "light",
    "link_flair_type": "richtext",
    "locked": false,
    "media": null,
    "media_embed": {},
    "media_only": false,
    "mod_note": null,
    "mod_reason_by": null,
    "mod_reason_title": null,
    "mod_reports": [],
    "name": "t3_1czii7l",
    "no_follow": true,
    "num_comments": 12,
    "num_crossposts": 0,
    "num_reports": null,
    "over_18": false,
    "parent_whitelist_status": "all_ads",
    "permalink": "/r/ChatGPT/comments/1czii7l/will_ai_destroy_our_political_and_economic_systems/",
    "pinned": false,
    "pwls": 6,
    "quarantine": false,
    "removal_reason": null,
    "removed_by": null,
    "removed_by_category": null,
    "report_reasons": null,
    "retrieved_on": 1716550157,
    "saved": false,
    "score": 2,
    "secure_media": null,
    "secure_media_embed": {},
    "selftext": "If you dont feel like reading all of this analysis since ive laid my raw thoughts out about the logical process of things which can make it tiring to read if you dont follow closely. \n\nSo here are the main points of this \"maybe fictional\" prediction of the future, in a world indirectly dominated by AI.\n\n  \n- Decrease in job availability and human value which causes salaries to decrease while demand grows due to an increased educated populus.\n\n- Concentration of wealth within companies that control media, AI tech and big data\n\n- Slow implementation of AI into everyday life\n\n- Possible strict regulations about AI use implemented by government to safeguard the economy \n\n- Regression of global education in the long term\n\n- Long term slowed economic growth \n\n- Gravitation towards a more socialist economic system \n\n- High likelihood of universal basic income (UBI)\n\n- Increased government control of industries \n\n\n\n\n\n\n\nThere is a lot of talk around AI and its potential of either drastically improving our world or utterly collapsing and morphing it into something new. \n\nI have a theory on what the world will look like as AI begins to grow and develop but I need some critical debate to sharpen this prediction that sadly seems more than likely to happen except in the case where strict systems are put in place to control the advancement of AI and limit its hostile takeover potential to jobs we as a society can afford to loose. \n\nFor now, we are just in the beginning of widely available use of AI for individuals and corporations, the government of course has much more tailored AI software that is made for specific intelligence, defense and attack purposes which doesnt cause an issue for us, on the contrary, it will limit casualties and potential conflicts thanks to an increase in intelligence about certain situations that we realize we can solve peacefully. It could also be argued that with an increase insight, more conflicts will arise due to disagreements that were thought to be solvable without war but arent. \n\nNow for regular everyday use of AI in businesses and the professional world as a whole, if you think about it logically, there is only one outcome to massive AI advancements, collapse of our capitalist system.\n\nFor now ChatGPT is the most advanced open source AI, although its capabilities are quite limited, I can already see a few dozen jobs that could be irradicated if organizations learn how to use it properly which is the reason why this collapse will take time.\n\nIf you think about it, the backbone of capitalism is innovation fueled by the need of survival of employees and overseen by creative minds that that orchestrate the whole thing. When you go to college, you learn a skill that you chose from a wide range of options that are all needed in an economy that is constantly growing and needs innovation due to an increase of global demand fueled by surge of a newly educated population and the whole thing is supported by consumption and need of survival. Different social classes all working to support each other, lower class for manual jobs that grease the company wheels, more educated managers that oversee their operations and above that another director that reports to another so on and so on and as the chain goes higher and higher the salaries increase and therefore the social classes change, each social class supports a different segment of the economy but we all need each other for this system to survive. \n\nThe entire point of a company in a world full of companies is increasing profit, so in theory the reduction of jobs will drastically reduce company costs, why pay tens of thousands for someones analytical mind when you can just connect to a server and do the same for a fraction of the price. This might not happen in the smaller high profitable organizations but with the current system where most people work.\n\nSo basically, most of our corporate jobs will be replaced with AIs that can absolutely do anything, large companies will grow larger while smaller ones wont stand a chance unless they pick a very specific niche, even though the workforce will be ran by AIs. In a world where most people dont make enough money because their skills are invaluable, how will the economy run when no money is being spent. AI companies will dominate all industries while some worker will be useful in AI industries, at some point AIs will totally run themselves and present a bottom line to extremely wealthy investors that will spend their money on some industries they like but not others which totally destroys the ecosystem and leaves many people without added value. \n\nFollowing the law of supply and demand, education wont be as necessary as it used to so the general population wont need it which means they will gravitate towards the only value they can provide to a capitalist world which is manual labor or some new industries that will be created but not well maintained due to lack of investment and interest from high net worth individuals which means the middle class will disappear and be replaced by lower and extremely high class, the lower class which will work manual labor jobs that will be one of the only industries that are too expensive the replace with AI. This point is also confirmed with the law of supply and demand. \n\nAt some point, most people will have no added value in most industries, general consumption will decrease while specific industry consumption increases which richens the rich and poorens the poor. \n\nThe only way there could be a system that is AT LEAST as balanced as ours today is through heavy regulation of AI, heavy taxation of AI usage, increase in social benefits like UBI and a reduction in population, not the least educated but EVERYONE. AI is all putting us at the same level here, financially USELESS. \n\nI could keep on going about these predications but its all this is, a prediction... hopefully im totally wrong or a better system I cannot see will surface but for now its looking grim...\n\nwhat are your thoughts on this people ?",
    "send_replies": true,
    "spoiler": false,
    "stickied": false,
    "subreddit": "ChatGPT",
    "subreddit_id": "t5_7hqomg",
    "subreddit_name_prefixed": "r/ChatGPT",
    "subreddit_subscribers": 5606090,
    "subreddit_type": "public",
    "suggested_sort": null,
    "thumbnail": "self",
    "thumbnail_height": null,
    "thumbnail_width": null,
    "title": "Will AI destroy our political and economic systems?",
    "top_awarded_type": null,
    "total_awards_received": 0,
    "treatment_tags": [],
    "ups": 2,
    "upvote_ratio": 0.5600000023841858,
    "url": "https://www.reddit.com/r/ChatGPT/comments/1czii7l/will_ai_destroy_our_political_and_economic_systems/",
    "user_reports": [],
    "view_count": null,
    "visited": false,
    "whitelist_status": "all_ads",
    "wls": 6
}