{
    "_meta": {
        "is_edited": true,
        "retrieved_2nd_on": 1716823649
    },
    "all_awardings": [],
    "allow_live_comments": false,
    "approved_at_utc": null,
    "approved_by": null,
    "archived": false,
    "author": "godtrek",
    "author_flair_background_color": null,
    "author_flair_css_class": null,
    "author_flair_richtext": [],
    "author_flair_template_id": null,
    "author_flair_text": null,
    "author_flair_text_color": null,
    "author_flair_type": "text",
    "author_fullname": "t2_a860s",
    "author_is_blocked": false,
    "author_patreon_flair": false,
    "author_premium": false,
    "awarders": [],
    "banned_at_utc": null,
    "banned_by": null,
    "can_gild": false,
    "can_mod_post": false,
    "category": null,
    "clicked": false,
    "content_categories": null,
    "contest_mode": false,
    "created": 1716694036,
    "created_utc": 1716694036,
    "discussion_type": null,
    "distinguished": null,
    "domain": "self.ChatGPT",
    "downs": 0,
    "edited": false,
    "gilded": 0,
    "gildings": {},
    "hidden": false,
    "hide_score": false,
    "id": "1d0sjc0",
    "is_created_from_ads_ui": false,
    "is_crosspostable": true,
    "is_meta": false,
    "is_original_content": false,
    "is_reddit_media_domain": false,
    "is_robot_indexable": true,
    "is_self": true,
    "is_video": false,
    "likes": null,
    "link_flair_background_color": "#94e044",
    "link_flair_css_class": "",
    "link_flair_richtext": [
        {
            "e": "text",
            "t": "AI-Art"
        }
    ],
    "link_flair_template_id": "657a4a52-614b-11ee-88b0-165b9450c7a6",
    "link_flair_text": "AI-Art",
    "link_flair_text_color": "dark",
    "link_flair_type": "richtext",
    "locked": false,
    "media": null,
    "media_embed": {},
    "media_only": false,
    "mod_note": null,
    "mod_reason_by": null,
    "mod_reason_title": null,
    "mod_reports": [],
    "name": "t3_1d0sjc0",
    "no_follow": false,
    "num_comments": 2,
    "num_crossposts": 0,
    "num_reports": null,
    "over_18": false,
    "parent_whitelist_status": "all_ads",
    "permalink": "/r/ChatGPT/comments/1d0sjc0/paying_for_copilot_is_a_significantly_worse/",
    "pinned": false,
    "pwls": 6,
    "quarantine": false,
    "removal_reason": null,
    "removed_by": null,
    "removed_by_category": null,
    "report_reasons": null,
    "retrieved_on": 1716694053,
    "saved": false,
    "score": 2,
    "secure_media": null,
    "secure_media_embed": {},
    "selftext": "I am a game developer that uses AI to help take what's inside of my head and visualize it in concepts that take a fraction of the time it would've taken to do it myself. I'm more than capable of producing art myself but it's a time thing. My time is more valuable to me than anything else, so being able to generate images based on deep descriptions of stories and characters is very valuable and Copilot is totally free and powerful. \n\nFor a long time, I was able to use Copilot to generate endless images on the free tier with a single prompt and nudge it through revisions. It used to say I can only send 5 prompts before that prompt thread would end but it was broken or disabled or something because even though we'd reach 5 prompts deep I was still able to keep going for as long as I wanted... \n\nThen one day Microsoft flicked a switch so at 5 prompts it ends the conversation and kicks you out and you have to start all over again. This isn't neccessarily the biggest deal because I can still generate as many images as I want. I never reached a cap or been told I've reached a limit for the day... \n\nThis was true until I decided to pay for Copilot. I wanted to have unlimted revisions in a single thread, it's a powerful thing to spend 20 minutes pushing changes like \"make his shirt green and change the background to a X and blah blah blah\". Slowly you inch closer to a final image where it's perfect as any commission can be because you've communicated with this thing long enough in the thread, you're at a place where you're getting precisly what you want... \n\nBut now, after about 20 generations (regardless if in the same thread or brand new ones) Copilot refuses to generate anything and gives you an error messaging saying you need to wait for other prompts to finish generating. Which according to my research is a lie — and it is a lie because nothing is being generated at all! \n\nI fucking paid money to have a better Copilot experience and because I pay money, Microsoft will ban me from using the service I'm paying for, for up to 48 hours without giving me any kind of indication that I may be reaching a limit...\n\nThe most foul thing about this is, if you DON'T PAY, there is NO limit and you can generate hundreds of images no problem. \n\nSo what the fuck Microsoft? Why are you screwing me? The free version of Copilot is fucking better!? It has the EXACT SAME options in image generations. I have access to the same tools, I can make it widescreen if I want and different styles. The only limitation is 5 revisitions before I have to start a new thread. But other than that it's unlimited, but if I pay to use the service than I'm only allowed to generate a hidden amount of images before it lies to me and tries and convince me that there's some background processing happening on images I need to wait to complete and it's fucking not true. I can see the image gallery and the collection of images I've generated and everything is complete...\n\nIn other words... I'm paying for a worse experience! I ended up having to make a brand new, free Microsoft account in order to get back a good experience. So even though I'm paying for this thing, I can't even fucking use it? The entire point of paying for Copilot for me is broken. It doesn't make sense.\n\nAm I going crazy? I'm sure Copilot can do more than generate artwork but I've seen nothing close to quality as Copilot and for free besides Midjourney which you have to pay for. Using Copilot is important to me because Microsoft gives you commercial rights to anything you generate for free. It's a no brainer of a product to use but holy shit imagine if paying for anything else in life gives you a worse version of the free version. It's just weird.",
    "send_replies": true,
    "spoiler": false,
    "stickied": false,
    "subreddit": "ChatGPT",
    "subreddit_id": "t5_7hqomg",
    "subreddit_name_prefixed": "r/ChatGPT",
    "subreddit_subscribers": 5629668,
    "subreddit_type": "public",
    "suggested_sort": null,
    "thumbnail": "self",
    "thumbnail_height": null,
    "thumbnail_width": null,
    "title": "Paying for Copilot is a significantly worse experience than using Copilot for free",
    "top_awarded_type": null,
    "total_awards_received": 0,
    "treatment_tags": [],
    "ups": 2,
    "upvote_ratio": 0.5799999833106995,
    "url": "https://www.reddit.com/r/ChatGPT/comments/1d0sjc0/paying_for_copilot_is_a_significantly_worse/",
    "user_reports": [],
    "view_count": null,
    "visited": false,
    "whitelist_status": "all_ads",
    "wls": 6
}