{
    "_meta": {
        "is_edited": true,
        "retrieved_2nd_on": 1717127969
    },
    "all_awardings": [],
    "allow_live_comments": false,
    "approved_at_utc": null,
    "approved_by": null,
    "archived": false,
    "author": "Ok-Tomorrow9184",
    "author_flair_background_color": null,
    "author_flair_css_class": null,
    "author_flair_richtext": [],
    "author_flair_template_id": null,
    "author_flair_text": null,
    "author_flair_text_color": null,
    "author_flair_type": "text",
    "author_fullname": "t2_e4ddsecsr",
    "author_is_blocked": false,
    "author_patreon_flair": false,
    "author_premium": false,
    "awarders": [],
    "banned_at_utc": null,
    "banned_by": null,
    "can_gild": false,
    "can_mod_post": false,
    "category": null,
    "clicked": false,
    "content_categories": null,
    "contest_mode": false,
    "created": 1716998364,
    "created_utc": 1716998364,
    "discussion_type": null,
    "distinguished": null,
    "domain": "self.ChatGPT",
    "downs": 0,
    "edited": false,
    "gilded": 0,
    "gildings": {},
    "hidden": false,
    "hide_score": false,
    "id": "1d3fnzz",
    "is_created_from_ads_ui": false,
    "is_crosspostable": true,
    "is_meta": false,
    "is_original_content": false,
    "is_reddit_media_domain": false,
    "is_robot_indexable": true,
    "is_self": true,
    "is_video": false,
    "likes": null,
    "link_flair_background_color": "#94e044",
    "link_flair_css_class": "",
    "link_flair_richtext": [
        {
            "e": "text",
            "t": "Other "
        }
    ],
    "link_flair_template_id": "b4536a20-7be9-11ed-9a10-deed22fd00f8",
    "link_flair_text": "Other ",
    "link_flair_text_color": "light",
    "link_flair_type": "richtext",
    "locked": false,
    "media": null,
    "media_embed": {},
    "media_only": false,
    "mod_note": null,
    "mod_reason_by": null,
    "mod_reason_title": null,
    "mod_reports": [],
    "name": "t3_1d3fnzz",
    "no_follow": false,
    "num_comments": 14,
    "num_crossposts": 0,
    "num_reports": null,
    "over_18": false,
    "parent_whitelist_status": "all_ads",
    "permalink": "/r/ChatGPT/comments/1d3fnzz/what_are_your_thoughts_on_ethical_cheating_is/",
    "pinned": false,
    "pwls": 6,
    "quarantine": false,
    "removal_reason": null,
    "removed_by": null,
    "removed_by_category": null,
    "report_reasons": null,
    "retrieved_on": 1716998379,
    "saved": false,
    "score": 3,
    "secure_media": null,
    "secure_media_embed": {},
    "selftext": "“**TL;DR**—Let’s “delve into” (lol) the case that *if you **cheat correctly** you could transcend current dogmas about education and become the smartest student in the class.*\n\n### Summary: The thesis\n\n**If you cheat the correct way using AI, you actually learn more and become a better writer then if you don’t—and there’s an ethical way of doing it without getting caught. The purpose of this post is to discuss the phenomenon of ethical cheating for writing as a learning process in school. Note that truly original content with great value to humanity cannot be created without significant effort, but even when writing such content is the goal, AI certainly has a place in the work.**\n\n### Before you read on\n\n***Before you read on, let me clarify that however we define *cheating*, the idea is the same: There are ways to use AI to write essays, stories, reports, reviews and theses that may or may not in theory constitute cheating based on ideological or philosophical beliefs.***\n\n***While there are certain ways to cheat in a bad way, I argue that cheating is such a complex concept that it is best understood as coming in two forms: Good, ethical and pragmatically justified cheating, and bad (“real”) cheating.***\n\n### Background\n\nMy goal of this text is to encourage other adults to leverage the inevitable fact that students want to use AI, and they will whether or not we want them to. As intelligent and caring adults, our mission should be to enhance the students’ learning and improve academic integrity. In my opinion, the best way to do this of to simply reframe the problem: The students should definitely cheat! The question is how to cheat properly in a way that leads to transcending beyond the goals of education, becoming objectively more adept at the things we’re supposed to simply know. \n\nCurrently, schools tests the students instead of teaching them. By cheating properly, you actually learn how to be an insanely good and intelligent author. If applied consistently and systematically in a structured way, correct cheating leads to developing extraordinarily advanced reasoning, writing and information processing skills that schools currently are not simply designed to teach anyone.\n\nThe reality is that some people understand how to use these tools to cheat, and some don’t. It’s not rocket science, but you have to take the perspective of the professor or teacher to figure out how to actually leverage the capabilities of these tools without undermining the goals of education.\n\n### My suggestions\n\n*These are my general ideas for cheating in a way that is both ethical and practical:*\n\n1. First, realize this: Even if you circumvent the “detection,” there’s a good chance that your teacher or professor might suspect you cheated if they get the subtle feeling that something is not right. This could lead them to question your knowledge on the subject and test you in person to see whether or not you understand what you wrote. If you want to cheat, you have to make them believe that you did the work yourself.\n\n1. Consider discussing the use of AI with your teacher or professor. There’s no reason why any teacher should prohibit the use of AI. There are many ways to use them that are not cheating. This includes spell checking, grammar checking, formatting help, etc. In the case of formatting, AI can use markdown language to quickly create the correct formatting of headings, lists, etc. Also, typographical errors can be fixed, such as the wrong use of different typographically similar quotes. AI can help you quickly understand complex concepts as you read about them. When you read material, you may use AI to input parts of the text and have it explain it for you in different ways. This way, AI actually teaches you something. You may then discuss the topics you’ve learned with your teacher to see if you got it right before actually writing about it. That way, your teacher can see that you’re a learner and not a cheater, and that you realize the importance of learning good AI practices that will boost learning.\n\n1. Don’t use just one AI tool. While ChatGPT is good for writing logically coherent paragraphs, Google Gemini is good for reasoning about complex issues. Have them cooperate to build your knowledge and texts really quickly.\n\n1. If you have a smartphone, I recommend writing parts of your texts on the bus, in your bed, or wherever. This makes your brain actually master the most important parts of your texts and creates a feeling in you that you are actually doing some of the work. Specifically, if you’re an iPhone user, I recommend using the native keyboard and turning on all the writing help features in settings. This way, you’re using exceptionally advanced handheld AI to boost your writing. The text predictions of the iPhone native keyboard are insane if you really analyze how it works. If you write grammatically correct, coherent paragraphs, the keyboard actually knows what the text is about, and some of the word predictions are eerily accurate and relevant when the text deals with a very specific topic.\n\n1. For this one I need to declare that I pay for both ChatGPT plus and Google Gemini Advanced. Each of them is 20 bucks a month or so. So I’m NOT biased in this sense. Anyway: You don’t have to start with ChatGPT. Google Gemini is actually better at creating meaningful and interesting outlines and suggesting improvements. ChatGPT is for, well… Actually, Gemini is better for cheating. That’s the truth. ChatGPT, however, might be used to explain things to you, format text, summarize and structure data, etc., but not for the actual cheating. This is not my opinion; it’s a fact.\n\n1. If you use Gemini from a computer, you can basically write high-quality texts by selecting parts of its output and typing in a box that appears. If you type e.g. “explain” and hit enter, Gemini will expand that specific part of the text, i.e., what you selected, and replace it with longer sentences or even whole paragraphs that make the text incorporate your request. This way, you can avoid writing stuff you don’t understand. Like, it’s impossible to not understand the text if you do this repeatedly. In my opinion, this specific feature is the most potent learning tool I have ever seen. It’s probably underestimated.\n\n1. Know that these tools are not currently able to create a list of references. They inevitably “cheat” themselves by making up references. You can’t trick them. I believe they are not built to actually cheat. Therefore, they are very good at mimicking correct referencing and citation, but they can’t provide the sources and cite them for you. They can’t provide sources for the information they provide because they didn’t use sources to find out what to write. They simply knew it, and they are not equipped with the ability to understand why they know something. This is a fundamental insight that you have to have in order to cheat successfully. There’s a good chance that cheating is detected by realizing that the student’s bibliography didn’t really match the contents of the text. THIS is what can be detected. As other people have pointed out, there’s no way to detect AI use to write a text. However, it’s easy to spot a cheater if the task was to read something and then write about it, and the student hasn’t even handled the files that held the information they refer to.\n\n1. Chat with the chats. This is what they are best at. If you actually chat with them about your work in an intelligent way, together you could come up with great content. They could suggest search queries or works to look into. This way, you can go find the sources that they suggest manually, and then simply upload the sources and have them write the text for you only using the content found in these sources. When doing this, make sure to explicitly instruct them not to search the web and only use the files you provided, and—importantly—always tell them to quote the material so you can manually check that the information actually exists in the material! Here’s a pro tip: if you create a “custom GPT,” you can upload lots of sources to it and uncheck the option “search the web.” This will ensure that the custom GPT only uses the uploaded material.\n\n1. When you build a text, especially if it has many parts, work with one part of the text at the time, BUT always let the models know the context. So if your work is 5 pages long, work with one page at a time, but first paste/upload the entire text so that the model knows what it’s all about. Context is always key when working which these language models. They are built to understand things.\n\n1. Continuously let the models summarize your texts. To do this, always create a new chat first, upload or paste your text and ask it to explain or summarize the text. Pro tip: Always do this two times, in two different chats. In one of the chats you state that the work is another’s, and in the other chat you state that the work is yours. The reply you get will will sometimes heavily depend on what context the model works with. If it’s your texts, it will be more likely to find ways to improve the work. If it thinks that someone else wrote it, it will obviously not suggest improvements. Rather, it will focus on a deeper analysis, finding different ways to interpret and understand the text.\n\n### Concluding remarks\n\nFinally, perhaps the most important insight that we have to internalize is that within a decade, we will experience a phase where a new phenomenon of social division emerges that creates a new layer of social structure, where we start to discern classes based upon what we may call AI proficiency. \n\nCertainly, in the future, AI will be so advanced and present that such classes will only be determined by large socioeconomic differences in the world. However, during a short period time, there will be a gap between those who did leverage AI in education beyond what schools taught, and those who did not. Let us not be oppressed by arbitrary moral theories about what constitutes ethical education. \n\nPlease feel free to share your thoughts below. A good conversation on this subject is critical to maximizing the potency of these subreddits.\n\n———\nThis text was entirely human-generated, i.e. in my brain. The text reflects the views of the human, i.e. me. Since I cite no sources, I don’t claim superiority in knowledge. I want to know what others think!”",
    "send_replies": true,
    "spoiler": false,
    "stickied": false,
    "subreddit": "ChatGPT",
    "subreddit_id": "t5_7hqomg",
    "subreddit_name_prefixed": "r/ChatGPT",
    "subreddit_subscribers": 5681206,
    "subreddit_type": "public",
    "suggested_sort": null,
    "thumbnail": "self",
    "thumbnail_height": null,
    "thumbnail_width": null,
    "title": "What are your thoughts on: Ethical “Cheating”? Is there such a thing?",
    "top_awarded_type": null,
    "total_awards_received": 0,
    "treatment_tags": [],
    "ups": 3,
    "upvote_ratio": 0.6399999856948853,
    "url": "https://www.reddit.com/r/ChatGPT/comments/1d3fnzz/what_are_your_thoughts_on_ethical_cheating_is/",
    "user_reports": [],
    "view_count": null,
    "visited": false,
    "whitelist_status": "all_ads",
    "wls": 6
}