{
    "_meta": {
        "retrieved_2nd_on": 1717184299
    },
    "all_awardings": [],
    "allow_live_comments": false,
    "approved_at_utc": null,
    "approved_by": null,
    "archived": false,
    "author": "ArtificialAnaleptic",
    "author_flair_background_color": null,
    "author_flair_css_class": null,
    "author_flair_richtext": [],
    "author_flair_template_id": null,
    "author_flair_text": null,
    "author_flair_text_color": null,
    "author_flair_type": "text",
    "author_fullname": "t2_wpmak5tfl",
    "author_is_blocked": false,
    "author_patreon_flair": false,
    "author_premium": false,
    "awarders": [],
    "banned_at_utc": null,
    "banned_by": null,
    "can_gild": false,
    "can_mod_post": false,
    "category": null,
    "clicked": false,
    "content_categories": null,
    "contest_mode": false,
    "created": 1717054687,
    "created_utc": 1717054687,
    "discussion_type": null,
    "distinguished": null,
    "domain": "self.ChatGPT",
    "downs": 0,
    "edited": false,
    "gilded": 0,
    "gildings": {},
    "hidden": false,
    "hide_score": false,
    "id": "1d3ygt1",
    "is_created_from_ads_ui": false,
    "is_crosspostable": true,
    "is_meta": false,
    "is_original_content": false,
    "is_reddit_media_domain": false,
    "is_robot_indexable": true,
    "is_self": true,
    "is_video": false,
    "likes": null,
    "link_flair_background_color": "#dadada",
    "link_flair_css_class": "",
    "link_flair_richtext": [
        {
            "e": "text",
            "t": "Use cases "
        }
    ],
    "link_flair_template_id": "c9233c3a-b336-11ed-b456-fab66c9d9d9e",
    "link_flair_text": "Use cases ",
    "link_flair_text_color": "dark",
    "link_flair_type": "richtext",
    "locked": false,
    "media": null,
    "media_embed": {},
    "media_only": false,
    "mod_note": null,
    "mod_reason_by": null,
    "mod_reason_title": null,
    "mod_reports": [],
    "name": "t3_1d3ygt1",
    "no_follow": false,
    "num_comments": 59,
    "num_crossposts": 1,
    "num_reports": null,
    "over_18": false,
    "parent_whitelist_status": "all_ads",
    "permalink": "/r/ChatGPT/comments/1d3ygt1/ive_seen_a_lot_of_posts_about_how_people_arent/",
    "pinned": false,
    "post_hint": "self",
    "preview": {
        "enabled": false,
        "images": [
            {
                "id": "x5Fn7Nl9-2_95h011Jxl0pyzkLSaQ9Tj7qE-tg5Mdnk",
                "resolutions": [
                    {
                        "height": 81,
                        "url": "https://external-preview.redd.it/-LPWl0xaiL-ArjFHrF8FdG3ux1YmAuC2cJU3Z30IYqI.jpg?width=108&crop=smart&auto=webp&s=4a1366041bbee710bacca226a4bb4bddcd705ffc",
                        "width": 108
                    },
                    {
                        "height": 162,
                        "url": "https://external-preview.redd.it/-LPWl0xaiL-ArjFHrF8FdG3ux1YmAuC2cJU3Z30IYqI.jpg?width=216&crop=smart&auto=webp&s=5f8ca7270123003408905fdd920c2ee28f4ccba9",
                        "width": 216
                    },
                    {
                        "height": 240,
                        "url": "https://external-preview.redd.it/-LPWl0xaiL-ArjFHrF8FdG3ux1YmAuC2cJU3Z30IYqI.jpg?width=320&crop=smart&auto=webp&s=1e98c39bcf0fa017bf0fc256b6c82292e4e87cad",
                        "width": 320
                    }
                ],
                "source": {
                    "height": 360,
                    "url": "https://external-preview.redd.it/-LPWl0xaiL-ArjFHrF8FdG3ux1YmAuC2cJU3Z30IYqI.jpg?auto=webp&s=9d4756b9f00989f343726475e549c8b9e352729d",
                    "width": 480
                },
                "variants": {}
            }
        ]
    },
    "pwls": 6,
    "quarantine": false,
    "removal_reason": null,
    "removed_by": null,
    "removed_by_category": null,
    "report_reasons": null,
    "retrieved_on": 1717054702,
    "saved": false,
    "score": 82,
    "secure_media": null,
    "secure_media_embed": {},
    "selftext": "I'm a not a programmer, but I've found ChatGPT and similar tools incredibly useful for a variety of tasks. I've seen lots of posts about how people aren't using AI tools like ChatGPT, Claude, Bard, etc etc etc.\n\nI think there seems to be 2 common \"success stories\":\n\n1. A programmer using it to program faster.\n\n2. Someone doing some highly specific/complex automation.\n\nand not a lot else. \n\nI wrote a comment about how I use it day to day for \"normal\" stuff so I've re-written the comment up as this post. \n\nHere are some of the key highlights of my experiences:\n\n-------------------\n\n**Job Applications:** My partner and I used AI to rewrite their cover letter for various job applications. We created a generic cover letter and then tailored it to each job by feeding the AI the job advert and company information along with the paragraph to be tailored. There were also several government applications that follow a particular \"strengths\" framework which it turned out were present in GPTs training. So this saved us a lot of time and effort when converting prior applications to this specific format. **see caveats in takeaways**\n\n**Presentation and Promotion:** I utilized AI to co-write a presentation for my promotion interview (and used the interactive CV as evidence), and I'm happy to say I got the promotion! I was open about my use of AI and talked through the process of using it as part of my presentation.\n\n**OS Transition:** I transitioned from Windows to Linux with the help of AI. I've always hated windows but got stuck constantly with Linux trying to get tiny little annoyances fixed. Every time this happened I just talked the issue/error through with ChatGPT whenever I encountered tiny annoyances or issues. I've been successfully running Linux ever since. I've finally been able to completely remove my Windows partition having always previously dual booted and I've been 100% Linux for probably a good portion of ChatGPTs existence.\n\n**Automation:** I created small automatons for tasks I wanted to undertake, such as writing terminal commands to make specific changes to files. \"Write me a terminal command that iterates through FOLDER and makes CHANGE to all files that match CRITERIA\".\n\n**Local AI Tools:** I started exploring locally run AI tools, and when I encountered tricky installation processes or errors, I used AI to troubleshoot and resolve these issues. Much of these are more streamlined installs now but when these started to emerge it was much more idiosyncratic and GPT helped a LOT. I still use it similarly for debugging in any program where I have a task I want to complete but don't know how. \n\n**Program Creation:** I was able to write two computer programs with no programming experience with the help of these AI tools. I created an interactive CV in javascript with D3 and an audiobook creator using python and TTS tooling, tailoring them to my exact needs. I also built a 3rd project, webpage/tool that helped me learn about proper separation of HTML, JavaScript, and CSS.\n\n**GitHub and Documentation:** I published my projects on GitHub with the help of AI (I won't link as these would doxx me lol), learning how to properly document and write tests for my code. This was a huge help in ensuring my projects were presentable and professional but also supported my professional development. \n\n**Angry Email Mediation:** I wrote an angry email to a company regarding an issue I was having. The AI acted as a mediator, helping me write a more considered and less aggressive email, which ultimately led to a positive outcome. Basically I wrote to the AI who wrote the email and then read me back the response and so on.\n\n\n----------------------\n\nTakeaways:\n---\n\nAlways approach these tools with the mindset of \"how can this help me do it better, sooner, or faster?\" Expect these tools to **assist** you, not do the task for you, and you'll be surprised at what you can accomplish. I also find that looking for \"assistance\" often ends up with you getting a complete answer, where looking for a complete answer directly will get you gibberish. **This is extremely important for tasks like the job application** where over-reliance on the tools has the potential to **damage**, rather than help you if you just use the AI to write your whole thing. \n\nFor now at least, use-cases will always skew-computer oriented. The most common \"other\" use I've seen is \"I have xyz in my fridge, what should I make.\" Which, while useful, feels sort of low-impact for me personally.\n\nI think the biggest barrier to using these tools well is often times the quality of the question. I've watched talented programmers using these tools, write a rushed question, not get the \"right\" answer, and give up. Where I was able to step in and write something that produced the correct output very quickly.\n\nBecause of the way that an LLM works, the question impacts the generation process of the response. So writing a poor quality input will result in a lower quality output. It's important to think about how you construct your question/statement and what \"someone\" would interpret from it. \n\n[I find the \"Exact Instructions\"-notion to be extremely important when using the tools and turns them from novelty to powerhouse.](https://www.youtube.com/watch?v=FN2RM-CHkuI)",
    "send_replies": true,
    "spoiler": false,
    "stickied": false,
    "subreddit": "ChatGPT",
    "subreddit_id": "t5_7hqomg",
    "subreddit_name_prefixed": "r/ChatGPT",
    "subreddit_subscribers": 5691016,
    "subreddit_type": "public",
    "suggested_sort": null,
    "thumbnail": "self",
    "thumbnail_height": null,
    "thumbnail_width": null,
    "title": "I've seen a lot of posts about how people aren't using AI. Here's how I, a non-programmer and average human, use these tools",
    "top_awarded_type": null,
    "total_awards_received": 0,
    "treatment_tags": [],
    "ups": 82,
    "upvote_ratio": 0.8100000023841858,
    "url": "https://www.reddit.com/r/ChatGPT/comments/1d3ygt1/ive_seen_a_lot_of_posts_about_how_people_arent/",
    "user_reports": [],
    "view_count": null,
    "visited": false,
    "whitelist_status": "all_ads",
    "wls": 6
}