{
    "_meta": {
        "retrieved_2nd_on": 1712167584
    },
    "all_awardings": [],
    "approved_at_utc": null,
    "approved_by": null,
    "archived": false,
    "associated_award": null,
    "author": "Loknar42",
    "author_flair_background_color": null,
    "author_flair_css_class": null,
    "author_flair_richtext": [],
    "author_flair_template_id": null,
    "author_flair_text": null,
    "author_flair_text_color": null,
    "author_flair_type": "text",
    "author_fullname": "t2_2ssxttzu",
    "author_is_blocked": false,
    "author_patreon_flair": false,
    "author_premium": false,
    "awarders": [],
    "banned_at_utc": null,
    "banned_by": null,
    "body": "No offense, but I'm guessing that OpenAI can afford to recruit folks with > 5 years experience, and probably prefers to. Unlike FAANGs, which need an endless supply of fresh blood to keep the pipeline full, smaller companies like OpenAI need folks who can wear a lot of hats and solve a lot of problems with minimal oversight. And that means having seen a good diversity of problems in the real world and actually solved them. When I google \"openai job levels\" the first link is this: [https://www.levels.fyi/companies/openai/salaries](https://www.levels.fyi/companies/openai/salaries) which only lists L4 and L5 as their levels. I'm guessing these are the only SDE levels available (probably their version of mid-range and \"senior\" engineer). Given that L4 comp is shown as $500k and L5 as $900k, I'd say you would have to be pretty exceptional to qualify for L5. Basically, you would not be on here asking these questions if you were.\n\n  \nIf I were an OpenAI hiring manager, I would not want a candidate that thinks LeetCode is the ideal interview prep. I mean, you need to be able to solve real code problems on demand, no doubt. You need to demonstrate a strong knowledge of algorithms and data structures and an ability to write code quickly, cleanly, and efficiently. But in a small shop like that, you also need to be able to design systems: tools, services, libraries, whatever is required in the moment. You need to be able to dive into a big codebase with minimal documentation and tests and fix urgen bugs. You need to show that you know how systems work, how they integrate, how they fail. You need to be able to draw architecture diagrams at the application level, library/framework level, and SOA level. Because there just aren't enough engineers to hire specialists for all of these different tasks. I'm guessing they will prefer folks with 10-15, even 20 years experience.\n\n  \nInstead of asking what kind of comp you can squeeze out of them, you should be asking yourself why they would give you a second look when there's probably hundreds, possibly thousands of candidates lined up waiting to take the spot you're competing for and bringing more experience and possibly more skill to the table. I guarantee there are at least a few folks who will take the position at lower comp just to get in the door, so if you are pushing for higher comp without bringing an overwhelming advantage to the table to justify it, you may well be pricing yourself out of an opportunity. Put yourself in the shoes of an OpenAI engineering manager and ask: \"What kinds of folks would I want on my team? What would I look for?\" If you don't know how to answer these questions, this may be a premature move for you. If so, then spend time talking to your manager and other managers to learn things from their perspective so you know how to answer these questions in the future.",
    "can_gild": false,
    "can_mod_post": false,
    "collapsed": false,
    "collapsed_because_crowd_control": null,
    "collapsed_reason": null,
    "collapsed_reason_code": null,
    "comment_type": null,
    "controversiality": 0,
    "created": 1712037980,
    "created_utc": 1712037980,
    "distinguished": null,
    "downs": 0,
    "edited": false,
    "gilded": 0,
    "gildings": {},
    "id": "kxntk5m",
    "is_submitter": false,
    "likes": null,
    "link_id": "t3_1btq9bv",
    "locked": false,
    "mod_note": null,
    "mod_reason_by": null,
    "mod_reason_title": null,
    "mod_reports": [],
    "name": "t1_kxntk5m",
    "no_follow": true,
    "num_reports": null,
    "parent_id": "t3_1btq9bv",
    "permalink": "/r/ChatGPT/comments/1btq9bv/openai_leveling_system_and_interview_questions_l4/kxntk5m/",
    "removal_reason": null,
    "replies": "",
    "report_reasons": null,
    "retrieved_on": 1712037993,
    "saved": false,
    "score": 0,
    "score_hidden": false,
    "send_replies": true,
    "stickied": false,
    "subreddit": "ChatGPT",
    "subreddit_id": "t5_7hqomg",
    "subreddit_name_prefixed": "r/ChatGPT",
    "subreddit_type": "public",
    "top_awarded_type": null,
    "total_awards_received": 0,
    "treatment_tags": [],
    "unrepliable_reason": null,
    "ups": 0,
    "user_reports": []
}