{
    "_meta": {
        "is_edited": true,
        "retrieved_2nd_on": 1712276515
    },
    "all_awardings": [],
    "approved_at_utc": null,
    "approved_by": null,
    "archived": false,
    "associated_award": null,
    "author": "TedDibiasi123",
    "author_flair_background_color": null,
    "author_flair_css_class": null,
    "author_flair_richtext": [],
    "author_flair_template_id": null,
    "author_flair_text": null,
    "author_flair_text_color": null,
    "author_flair_type": "text",
    "author_fullname": "t2_5h8vlzxy",
    "author_is_blocked": false,
    "author_patreon_flair": false,
    "author_premium": false,
    "awarders": [],
    "banned_at_utc": null,
    "banned_by": null,
    "body": "> They do indirectly, yes. The cost of labour is in the form of wages, and those wages have to cover basic necessities such as food. As for healthcare, if you don't want your workforce to drop dead, you're paying for that too - either explicitly as an employer, or in the form of taxes, or the employee pays for it, in which case it's again covered by wages. Same with pensions - someone's paying for the food people eat after they're no longer able to work, and if it's not the employer, it's the tax-payer, which means it ultimately comes out of the wages the employer has to pay. Same with education, or at least the cost of bringing up children to the age where they can work. If it's paid by the parents, it comes out of wages. If it's paid by the government, it comes out of taxes, which come out of wages.\n\nThe assumption of a direct correlation between wages and costs of living overlooks the reality of millions if not billions of people around the world. \nIn some cases this means they need a second or third job, in other cases this means their children also have to work. If they‘re lucky the government will support them, which leads us to another questionable, to say the least, assumption. Wages are just one of many channels to generate wealth and all of these channels are taxed normally. You can generate an income through capital by investing, you can inherit money, you can run your own business - none of this money and the taxes paid on it come out of wages. \n\nIf you have your own little house flipping business with two employees you pay 5k each every month and the three of you fix an old property you bought for 200k and now sell it for 500k, generating a gross profit of 300k. The profit generated comes from the human labor which is ultimately the driver of our economy, not wages. Wages are usually just a fraction of the value of human labor. So it‘s not the employer paying for things like welfare or education but the workforce with their labor. Without exploiting this workforce an employer couldn‘t generate any income. The idea is to pay someone less than what you can sell the result of their work for. \n\nWe could also explore the concept of fiat money, which further demonstrates that taxes on wages are by far not the sole method for government money generation.\n\n> Sure, and AI will only drive that number down further. But eventually it will be cheaper than a human can get by on. And don't worry, that doesn't mean AI companies won't make a profit - remember, you need to multiply that $1.40 by the number of hours worked and the number of workers.\n\nYou have to multiply $1.40 many, many times before you reach the price of an AI robot. And then there would still be countries with wages around $0.40/h in countries like Kyrgyzstan or Zimbabwe.\nCan machines compete with those wages?\nBig if true.",
    "can_gild": false,
    "can_mod_post": false,
    "collapsed": false,
    "collapsed_because_crowd_control": null,
    "collapsed_reason": null,
    "collapsed_reason_code": null,
    "comment_type": null,
    "controversiality": 0,
    "created": 1712146901,
    "created_utc": 1712146901,
    "distinguished": null,
    "downs": 0,
    "edited": false,
    "gilded": 0,
    "gildings": {},
    "id": "kxucq97",
    "is_submitter": false,
    "likes": null,
    "link_id": "t3_1bum23z",
    "locked": false,
    "mod_note": null,
    "mod_reason_by": null,
    "mod_reason_title": null,
    "mod_reports": [],
    "name": "t1_kxucq97",
    "no_follow": true,
    "num_reports": null,
    "parent_id": "t1_kxu50lv",
    "permalink": "/r/ChatGPT/comments/1bum23z/this_is_what_ai_is_supposed_to_do/kxucq97/",
    "removal_reason": null,
    "replies": "",
    "report_reasons": null,
    "retrieved_on": 1712146915,
    "saved": false,
    "score": 1,
    "score_hidden": false,
    "send_replies": true,
    "stickied": false,
    "subreddit": "ChatGPT",
    "subreddit_id": "t5_7hqomg",
    "subreddit_name_prefixed": "r/ChatGPT",
    "subreddit_type": "public",
    "top_awarded_type": null,
    "total_awards_received": 0,
    "treatment_tags": [],
    "unrepliable_reason": null,
    "ups": 1,
    "user_reports": []
}