{
    "_meta": {
        "retrieved_2nd_on": 1712279140
    },
    "all_awardings": [],
    "approved_at_utc": null,
    "approved_by": null,
    "archived": false,
    "associated_award": null,
    "author": "PuddyVanHird",
    "author_flair_background_color": null,
    "author_flair_css_class": null,
    "author_flair_richtext": [],
    "author_flair_template_id": null,
    "author_flair_text": null,
    "author_flair_text_color": null,
    "author_flair_type": "text",
    "author_fullname": "t2_1tc82klz",
    "author_is_blocked": false,
    "author_patreon_flair": false,
    "author_premium": false,
    "awarders": [],
    "banned_at_utc": null,
    "banned_by": null,
    "body": ">The assumption of a direct correlation between wages and costs of living overlooks the reality of millions if not billions of people around the world. \n\nYou're putting words in my mouth there. The fundamental cost of living, once you take out all non-essentials, represents a *floor* for income - obviously income can be very much higher for some people, but that has nothing to do with what I'm talking about.\n\n>In some cases this means they need a second or third job, \n\nSure, but number of jobs is a red herring. There is maximum number of hours that a person can work in a week; the amount a person needs to survive divided by that number is the minimum you can pay your workforce unless you're fine with no longer having a workforce very soon. In practice, there might be all sorts of reasons you'd pay *more* than that, but you can't pay less. This means if automation is ever cheaper than that, it won't push wages down further - it will just make human labour obsolete.\n\n>Wages are just one of many channels to generate wealth and all of these channels are taxed usually.\n\nYes, I was oversimplifying. Taxes are still either paid by individuals, in which case they come out of wages, either directly like income tax or indirectly like sales tax; or they're paid by businesses, in which case the employer's paying them in addition to wages. Either way, it's a cost to the employer. If employees are living off welfare paid out of business taxes, the employer can push the nominal wages down, sure, but that's not what they actually care about - they care about the cost of the employee, which includes any taxes.\n\n>You can generate an income through capital by investing, you can inherit money, you can run your own business - none of this money and the taxes paid on it come out of wages. \n\nAll of those rely on you or someone in your family having up-front capital. These are not going to be viable solutions for most sweatshop labourers.\n\n>The profit generated comes from the human labor which is ultimately the driver of our economy, not wages. Wages are usually just a fraction of the value of human labor.\n\nAbsolutely, and nothing I've said contradicts this. Of course labour is worth more than wages - otherwise businesses wouldn't employ people. I'm talking about wages as a proxy for the *cost* of labour, not its value, because that's what's relevant to a company's decision to automate jobs: whether the cost of automation is less than the cost of human labour (which of course includes not just wages, but I'm using wages for simplicity).\n\n>You have to multiply $1.40 many, many times before you reach the price of an AI robot. And then there would still be countries with wages around $0.40/h like Kyrgyzstan or Zimbabwe. Can machines compete with those wages?\n\nAcross all jobs? Not yet, no. We're talking about a hypothetical, probably distant future, remember.\n\nFor some jobs, though, we're already there, yes. It costs significantly less than $0.40 to generate as much text using an LLM as a human can write in an hour. And before you say that the writing is of lower quality - it's high enough quality that it's good enough for many applications. I would not recommend that you take up a career in proofreading, for instance. And it's improving at a frankly scary pace.",
    "can_gild": false,
    "can_mod_post": false,
    "collapsed": false,
    "collapsed_because_crowd_control": null,
    "collapsed_reason": null,
    "collapsed_reason_code": null,
    "comment_type": null,
    "controversiality": 0,
    "created": 1712149529,
    "created_utc": 1712149529,
    "distinguished": null,
    "downs": 0,
    "edited": false,
    "gilded": 0,
    "gildings": {},
    "id": "kxuis0f",
    "is_submitter": false,
    "likes": null,
    "link_id": "t3_1bum23z",
    "locked": false,
    "mod_note": null,
    "mod_reason_by": null,
    "mod_reason_title": null,
    "mod_reports": [],
    "name": "t1_kxuis0f",
    "no_follow": true,
    "num_reports": null,
    "parent_id": "t1_kxucq97",
    "permalink": "/r/ChatGPT/comments/1bum23z/this_is_what_ai_is_supposed_to_do/kxuis0f/",
    "removal_reason": null,
    "replies": "",
    "report_reasons": null,
    "retrieved_on": 1712149545,
    "saved": false,
    "score": 1,
    "score_hidden": false,
    "send_replies": true,
    "stickied": false,
    "subreddit": "ChatGPT",
    "subreddit_id": "t5_7hqomg",
    "subreddit_name_prefixed": "r/ChatGPT",
    "subreddit_type": "public",
    "top_awarded_type": null,
    "total_awards_received": 0,
    "treatment_tags": [],
    "unrepliable_reason": null,
    "ups": 1,
    "user_reports": []
}