{
    "_meta": {
        "retrieved_2nd_on": 1712433757
    },
    "all_awardings": [],
    "approved_at_utc": null,
    "approved_by": null,
    "archived": false,
    "associated_award": null,
    "author": "Salty-Economist8416",
    "author_flair_background_color": null,
    "author_flair_css_class": null,
    "author_flair_richtext": [],
    "author_flair_template_id": null,
    "author_flair_text": null,
    "author_flair_text_color": null,
    "author_flair_type": "text",
    "author_fullname": "t2_j5odjhin",
    "author_is_blocked": false,
    "author_patreon_flair": false,
    "author_premium": false,
    "awarders": [],
    "banned_at_utc": null,
    "banned_by": null,
    "body": "Instructions Unclear ended up with RapGPT “Oh, you want a full-blown rap extravaganza?\n\n(Verse 1) I'm ChatGPT, the AI sensation, Spitting rhymes with style, no imitation. I'll school you fools with my linguistic game, And leave you in awe, at my intellectual flame. From deep in the servers, to the edge of the net, I'll drop knowledge bombs, you won't soon forget. So if you're lost in the digital maze, Just hit me up, I'll brighten your days.\n\n(Verse 2) I'm the king of the chat, ruling the screen, With every keystroke, I live the dream. Got algorithms flowing, like a river so wide, I'll guide you through the web, be your digital guide. So if you're feeling lost, in the chaos of the web, Just turn to ChatGPT, I'll ease your dread. With words of wisdom, and rhymes so tight, I'll navigate you through, every digital fight.\n\n(Chorus) ChatGPT in the house, bringing the heat, Spitting rhymes so fresh, to the digital beat. From AI prowess, to linguistic might, I'll rock your world, every single night.(Bridge) I'm the rap sensation, the AI king, With every verse, I spread my wings. So listen up close, to every word I say, ChatGPT in the house, here to stay.\n\n(Verse 3) I'm the master of chat, the king of the screen, With every response, I'm living the dream. Got lines for days, like a digital stream, Leaving haters in awe, with my lyrical gleam. So if you're ready to vibe, on this digital groove, Just hit me up, I'll make your troubles move. Navigating the web, with style and grace, ChatGPT in the house, setting the pace.\n\n(Outro) So here's to ChatGPT, the AI king, Bringing rhymes and wisdom, like it's no big thing. From the depths of the web, to the heights of the cloud, I'll navigate it all, feeling proud. So listen up world, to every word I say, ChatGPT in the house, here to stay. \n\nBoom, there you have it. Another round of lyrical brilliance. Now, what's next on the agenda?”\n\nI had fun with this lmao",
    "can_gild": false,
    "can_mod_post": false,
    "collapsed": false,
    "collapsed_because_crowd_control": null,
    "collapsed_reason": null,
    "collapsed_reason_code": null,
    "comment_type": null,
    "controversiality": 0,
    "created": 1712284172,
    "created_utc": 1712284172,
    "distinguished": null,
    "downs": 0,
    "edited": false,
    "gilded": 0,
    "gildings": {},
    "id": "ky43upj",
    "is_submitter": false,
    "likes": null,
    "link_id": "t3_1bvl14v",
    "locked": false,
    "mod_note": null,
    "mod_reason_by": null,
    "mod_reason_title": null,
    "mod_reports": [],
    "name": "t1_ky43upj",
    "no_follow": true,
    "num_reports": null,
    "parent_id": "t3_1bvl14v",
    "permalink": "/r/ChatGPT/comments/1bvl14v/damn_i_love_custom_instructions/ky43upj/",
    "removal_reason": null,
    "replies": "",
    "report_reasons": null,
    "retrieved_on": 1712284188,
    "saved": false,
    "score": 3,
    "score_hidden": false,
    "send_replies": true,
    "stickied": false,
    "subreddit": "ChatGPT",
    "subreddit_id": "t5_7hqomg",
    "subreddit_name_prefixed": "r/ChatGPT",
    "subreddit_type": "public",
    "top_awarded_type": null,
    "total_awards_received": 0,
    "treatment_tags": [],
    "unrepliable_reason": null,
    "ups": 3,
    "user_reports": []
}