{
    "_meta": {
        "retrieved_2nd_on": 1712457165
    },
    "all_awardings": [],
    "approved_at_utc": null,
    "approved_by": null,
    "archived": false,
    "associated_award": null,
    "author": "chairmanskitty",
    "author_flair_background_color": null,
    "author_flair_css_class": null,
    "author_flair_richtext": [],
    "author_flair_template_id": null,
    "author_flair_text": null,
    "author_flair_text_color": null,
    "author_flair_type": "text",
    "author_fullname": "t2_g3i61",
    "author_is_blocked": false,
    "author_patreon_flair": false,
    "author_premium": false,
    "awarders": [],
    "banned_at_utc": null,
    "banned_by": null,
    "body": "Okay, so the AI also generates negative experiences sometimes, it uses noise in prompt generation to mix things up, and it offers to take control of the situation from you so you are faced with unexpected scenarios to overcome.\n\nNone of those seem as hard as getting a positive experience down pat. Just because the budget is biggest for porn and therefore the technology for porn is most advanced, that doesn't mean other emotions are harder to arouse.\n\nAnd maybe the AI partner will be a bit dumb at times in the earliest models, but clearly there are plenty of people who can live with that like we tend to live with mistakes and shortcomings of human partners.\n\nBesides, GPT-4 wasn't even trained on AI-human interactions. There has been almost no reinforcement learning. All the stuff we see is just from AI predicting what makes sense in context, the AI isn't even trying to do anything yet. But every prompt fed into AI today is being used to teach them how to achieve goals. A/B testing, giving thumbs up at the end, completion speed, people arguing with it, all of that is feedback that is going right back into the data centers to train the next models.\n\nWe haven't even seen a transfomer AI that was trained on the tasks that they are now doing. The most braindead way to improve GPT-5 would be to train it on GPT-4 chatlogs and have it predict the human's response and rating, and then in deployment have it pick between different completions of the GPT side of the conversation based on what produces the most positive predicted outcome. And the same goes for DALL-E and Sora and every other AI that is being made freely available to the public right now, costing AI companies hundreds of millions of dollars in server costs.\n\nBut sure, I'm sure that this time AI won't overcome this hurdle. Just like it wasn't able to overcome chess or go or conversations with humans or making art or the bar exam.",
    "can_gild": false,
    "can_mod_post": false,
    "collapsed": false,
    "collapsed_because_crowd_control": null,
    "collapsed_reason": null,
    "collapsed_reason_code": null,
    "comment_type": null,
    "controversiality": 0,
    "created": 1712320429,
    "created_utc": 1712320429,
    "distinguished": null,
    "downs": 0,
    "edited": false,
    "gilded": 0,
    "gildings": {},
    "id": "ky5u1gw",
    "is_submitter": false,
    "likes": null,
    "link_id": "t3_1bbu7ks",
    "locked": false,
    "mod_note": null,
    "mod_reason_by": null,
    "mod_reason_title": null,
    "mod_reports": [],
    "name": "t1_ky5u1gw",
    "no_follow": true,
    "num_reports": null,
    "parent_id": "t1_kucku3k",
    "permalink": "/r/ChatGPT/comments/1bbu7ks/hows_your_ai_gfbf/ky5u1gw/",
    "removal_reason": null,
    "replies": "",
    "report_reasons": null,
    "retrieved_on": 1712320444,
    "saved": false,
    "score": 1,
    "score_hidden": false,
    "send_replies": true,
    "stickied": false,
    "subreddit": "ChatGPT",
    "subreddit_id": "t5_7hqomg",
    "subreddit_name_prefixed": "r/ChatGPT",
    "subreddit_type": "public",
    "top_awarded_type": null,
    "total_awards_received": 0,
    "treatment_tags": [],
    "unrepliable_reason": null,
    "ups": 1,
    "user_reports": []
}