{
    "_meta": {
        "is_edited": true,
        "retrieved_2nd_on": 1712467838
    },
    "all_awardings": [],
    "approved_at_utc": null,
    "approved_by": null,
    "archived": false,
    "associated_award": null,
    "author": "Educational_Fan_6787",
    "author_flair_background_color": null,
    "author_flair_css_class": null,
    "author_flair_richtext": [],
    "author_flair_template_id": null,
    "author_flair_text": null,
    "author_flair_text_color": null,
    "author_flair_type": "text",
    "author_fullname": "t2_84iiopkh",
    "author_is_blocked": false,
    "author_patreon_flair": false,
    "author_premium": false,
    "awarders": [],
    "banned_at_utc": null,
    "banned_by": null,
    "body": "They will do all they can to hold onto power but they wont be able to hold on. It's impossible. How they can fight against something way bigger than themselves? One word friend. Entropy. The pedophiles and sociopaths may hold on for a while, but they'll be defeated by their own hubris and incompetence and the masses will win,  \n\n\nAlso, as I said in my other post. The elites cannot keep it for themselves. That is not something they are able to do. for the simple fact that mutations and diseases and biolgoical and all that stuff evolves and changes. and so, it's imprtant that humanity finds a kind of stabilitiy in this new sytsem whereby it's commonplace and normla for all of humanity to be constantly \"plugged in\"( seeing as we're going sci-fi for some reason despite me sharing my thoughts in complete earnest) so that data can be constantly extracted for feeding into the machines to be anaylsed as well as the person being checked against the data for any suspected faults with their biological state. It will say \"you are probably gonna get lung cancer in 15 years mate\" or \"you have a lot of \\[chemical\\] in your body. u shuld prolly leave the city mate\"  \n\n\nlike we're gonna totally change the entire face of humanities existence. Everything will change  \n\n\nand the best bit is that all the idiots who are stupid an djust cause trouble for personal gain - will not be able to - because the machine will justifiy everything. When we see that death rates drop by 60% in 1 year because a nation decides to plug in. Then you'll see NONE of this is sci-fi.  \n\n\nall this will take is the technology to get to a place where its deployable into the markets (from healthcare across all sectors like politics or economy) and then for a nation to agree to share all its personal health data with the system. then from there it begins. And we can start figuring out ways of extracting individuals entire genomes and brain chemistry and all that kind of stuff.   \n\n\nAnd what does all this mean?  \n\n\nit means your child never has to go through cancer.  \nit means your parents never have to suffer through alzimahs.  \nit means your heart wont kill you.\n\n  \nI dont even care whether all this happens or not. I just honestly see it happening. Just two more steps. 1) Deployable AI system and 2) a willing populous. and the results will speak for themselves and thus begins the new dawn of humanity. You watch.  \n\n\nand you know i even would accept it might be in a different sector like education, politics, economy, agriculture etc. but I dont see how else humanity will go excluding total annihilation cos putin n the boys.",
    "can_gild": false,
    "can_mod_post": false,
    "collapsed": false,
    "collapsed_because_crowd_control": null,
    "collapsed_reason": null,
    "collapsed_reason_code": null,
    "comment_type": null,
    "controversiality": 0,
    "created": 1712333239,
    "created_utc": 1712333239,
    "distinguished": null,
    "downs": 0,
    "edited": false,
    "gilded": 0,
    "gildings": {},
    "id": "ky6tlg0",
    "is_submitter": true,
    "likes": null,
    "link_id": "t3_1bwjwqt",
    "locked": false,
    "mod_note": null,
    "mod_reason_by": null,
    "mod_reason_title": null,
    "mod_reports": [],
    "name": "t1_ky6tlg0",
    "no_follow": true,
    "num_reports": null,
    "parent_id": "t1_ky6j0qo",
    "permalink": "/r/ChatGPT/comments/1bwjwqt/i_hate_to_be_that_guy_but_ai_is_gonna_save_the/ky6tlg0/",
    "removal_reason": null,
    "replies": "",
    "report_reasons": null,
    "retrieved_on": 1712333254,
    "saved": false,
    "score": 0,
    "score_hidden": false,
    "send_replies": true,
    "stickied": false,
    "subreddit": "ChatGPT",
    "subreddit_id": "t5_7hqomg",
    "subreddit_name_prefixed": "r/ChatGPT",
    "subreddit_type": "public",
    "top_awarded_type": null,
    "total_awards_received": 0,
    "treatment_tags": [],
    "unrepliable_reason": null,
    "ups": 0,
    "user_reports": []
}