{
    "_meta": {
        "retrieved_2nd_on": 1712488727
    },
    "all_awardings": [],
    "approved_at_utc": null,
    "approved_by": null,
    "archived": false,
    "associated_award": null,
    "author": "Educational_Fan_6787",
    "author_flair_background_color": null,
    "author_flair_css_class": null,
    "author_flair_richtext": [],
    "author_flair_template_id": null,
    "author_flair_text": null,
    "author_flair_text_color": null,
    "author_flair_type": "text",
    "author_fullname": "t2_84iiopkh",
    "author_is_blocked": false,
    "author_patreon_flair": false,
    "author_premium": false,
    "awarders": [],
    "banned_at_utc": null,
    "banned_by": null,
    "body": "I just don't think this level of change is something that can be prevented.  \n\n\nI mean we create international standards for things all the time. All I've really saying is that we're gonna do the same for AI and it's gonna become bigger than radio, TV, the internet, and motor cars all combined. Bigger than the industrial revolution and bigger than Rome. It's gonna be on the level of discovering fire kinda big.  \n\n\nthink of like this. We can already predict what decision you make before you even comprehend you've made the decision by monitoring ur brain and that. it's gonna be that on steroids. its gonna be you walk into a doctors office, get your scan done and your gonna know exactly what risks you have or sickness or ill health.  \n\n\nOnly catch is the system will require constant data being fed to keep it up to date with mutations and such... but maybe if we all get implanted chips, those chips will be able to feed the data.  \n\n\nitll be like Norton anti-virus software but for humanity. we update it with reports and in return we get free scans.   \n\n\nthat'll be the exchange\n\n  \nhealth care will be free for all humanity. why? becuase thats how you keep it cheap becuase the more data means the better predicting capables which means better research and development which means more cures and more preventative measures.   \n\n\nI think rather than ask how we prevent those with money and power preventing it,aask they would have to do to prevent it. Becuase I am damn sure for anyone to keep Humanties Norton from becoming a reality, they'd have to well, i wont say because the only way to prevent it would be total anihaliation of the people industrtialising AI. but that'd be stupid becuase it's not gonna be one centered super bot.  \n\n\nIt's gonna be every nation has their own version and then nations will start to come together andshare datasets and research andd teams and eventually things will get centralised that way. but like today with russia vs the west or china. there will never ever be one person on top who stays on top. They'll always be contested unless they turned the world into literal hell which is possible too i guess, its happened before many times.But given we have nukes these days, any extreme war would be futile. instead everyone will just build their own AIs and you know why there will continue to be wars? And why I'm not saying an end to war... it's because of this - competition is fun. And those in power would find it more thrilling to compete with other nations and superpowers than to just use their might to tyrannise their own people. Some leaders do this, but they dont stay as leaders for long if they are 100% tyrant. Even tyrants like Putin have to show constraint. your people have to like you and you have to be seen to like them.  \n\n\nBut nations/supernations and corproations and companies will all just compete on this. My basic point here is that. In that competiton between the \"free markets\", corporations and nations/superatnions. I'm saying that the nations will lead the charge and the collection of nations will rule the day. Becuase the nations parliaments are the only places you can get the go ahead to use everybodies bioological data and so it must come from there as consent must be given from the people (but i think people will cosent wen they see results from deserpate nations who utiltise AI early on and get insane medical results fast) but its not until massive groups of people share data - and across even more varied sets of humans - that'll we start to get a really crisp picture of not who we are, but **what** we are. and know what we are will make figuring out what is going on with us when we get sick and ill a lot easier.  \n\n\nThe markets wont be able to do this because they wont be able to legally get all that data at a level and consisteny required and if they get it underhandedly they put too many limitations on themselves. Limitations the national front (as in the frontline not far right racists) wont have because AI being developed by nations/with the seal of approval from nations will, at some point, get their peoples permission to gather their biological data.  \n\n\n/pay me 5$ for this novel",
    "can_gild": false,
    "can_mod_post": false,
    "collapsed": false,
    "collapsed_because_crowd_control": null,
    "collapsed_reason": null,
    "collapsed_reason_code": null,
    "comment_type": null,
    "controversiality": 0,
    "created": 1712359116,
    "created_utc": 1712359116,
    "distinguished": null,
    "downs": 0,
    "edited": false,
    "gilded": 0,
    "gildings": {},
    "id": "ky8w6o7",
    "is_submitter": true,
    "likes": null,
    "link_id": "t3_1bwjwqt",
    "locked": false,
    "mod_note": null,
    "mod_reason_by": null,
    "mod_reason_title": null,
    "mod_reports": [],
    "name": "t1_ky8w6o7",
    "no_follow": true,
    "num_reports": null,
    "parent_id": "t1_ky8hoj3",
    "permalink": "/r/ChatGPT/comments/1bwjwqt/i_hate_to_be_that_guy_but_ai_is_gonna_save_the/ky8w6o7/",
    "removal_reason": null,
    "replies": "",
    "report_reasons": null,
    "retrieved_on": 1712359131,
    "saved": false,
    "score": 1,
    "score_hidden": false,
    "send_replies": true,
    "stickied": false,
    "subreddit": "ChatGPT",
    "subreddit_id": "t5_7hqomg",
    "subreddit_name_prefixed": "r/ChatGPT",
    "subreddit_type": "public",
    "top_awarded_type": null,
    "total_awards_received": 0,
    "treatment_tags": [],
    "unrepliable_reason": null,
    "ups": 1,
    "user_reports": []
}