{
    "_meta": {
        "retrieved_2nd_on": 1712534109
    },
    "all_awardings": [],
    "approved_at_utc": null,
    "approved_by": null,
    "archived": false,
    "associated_award": null,
    "author": "XGenGamer007",
    "author_flair_background_color": null,
    "author_flair_css_class": null,
    "author_flair_richtext": [],
    "author_flair_template_id": null,
    "author_flair_text": null,
    "author_flair_text_color": null,
    "author_flair_type": "text",
    "author_fullname": "t2_82rhpvda",
    "author_is_blocked": false,
    "author_patreon_flair": false,
    "author_premium": false,
    "awarders": [],
    "banned_at_utc": null,
    "banned_by": null,
    "body": "I'm old enough to remember when teams of people were hired for 'data entry' jobs in the 70s and 80s.\n\nYep, their job was to type as fast as possible and copy data from paper form into an 'electronic database'.\n\nIt was called the 'digital revolution'.\n\nA data entry clerk replaced the 'typist' that created those paper reports and paper records of transactions.\n\nHow ironic that the keyboard, which was originally designed to slow the typist to prevent breakdown of mechanical typewriters, is the same tool used to replace the typist?\n\nThen came new technologies like OCR (Optical Character Recognition) and Speech-to-Text translation and electronic document processing and handling, and E2E (Enterprise-To-Enterprise) software integration, and so on and so on.\n\nYes programmers, using the keyboard were creating software to perform all the functions of the data entry clerk and them some!\n\nAnd the data entry clerk went the way of the typist and the 'typing pools' (not the water-kind but teams of typists) were no more.\n\nNext was the era of the Call Center - reminiscent of the typing pools of old.\n\nUndoubtedly, the humble call center worker or service representative is being replaced by AI.\n\nWe may all want another human to be at the other end of the line but a competent and friendly sounding AI will do.\n\nSo soon developers who are getting by with just enough skills to translate requirements from the 'unskilled' business user will also be replaced by AI.\n\nBut that will also apply to 'test analyst', 'business analyst' and 'system administrator' with low-skill repetitive work.\n\nAI can be trained to review pages and pages of documentation, code and test cases in minutes or seconds.\n\nAnd AI can produce pages and pages of new documentation, code and test cases in minutes or seconds.\n\nAnd soon, all the pages and pages of documentation, code and test cases will be redundant just like the keyboard was for data entry.\n\nYes, we will throw away the keyboard for good; though it outlives the demise of typists, and software developers alike.\n\nThe keyboard, a technology that was inherently inefficient, yet has driven the evolutions of office administrations and creation of businesses small and great.\n\nThe keyboard is the symbol of the 'old ways' that will disappear.\n\nLike the keyboard, all the managers and directors who are not aware of this wind of change will also find themselves tossed out like yesterday's rubbish.\n\nCustomers will just talk to a customer service avatar and provide information and consent and the AI can store that away in a hidden, black-box database.\n\nManagers can just talk to a data analyst avatar of the same AI, 'give me the sales and profit report for the last hour, is there anything we could do to improve profits? Just go ahead and make it better!'\n\nBut people are resilient, and will find a way to stay 'useful' and governments will have to invent jobs and salaries that will keep 'the people' feeling 'happy' and 'useful' or otherwise face violent revolution.\n\nThe more technology brings us forward, the more we revert to our natural state of being: we are talking, thinking, and exercising creatures of recreation.\n\nYes, through the long road, we discover the true purpose and meaning of human life; which is to rest and fill our time with leisure.\n\nAnd God walked with Adam and Eve in the shade of the Garden of Eden.",
    "can_gild": false,
    "can_mod_post": false,
    "collapsed": false,
    "collapsed_because_crowd_control": null,
    "collapsed_reason": null,
    "collapsed_reason_code": null,
    "comment_type": null,
    "controversiality": 0,
    "created": 1712404496,
    "created_utc": 1712404496,
    "distinguished": null,
    "downs": 0,
    "edited": false,
    "gilded": 0,
    "gildings": {},
    "id": "kyb74su",
    "is_submitter": false,
    "likes": null,
    "link_id": "t3_1at6856",
    "locked": false,
    "mod_note": null,
    "mod_reason_by": null,
    "mod_reason_title": null,
    "mod_reports": [],
    "name": "t1_kyb74su",
    "no_follow": false,
    "num_reports": null,
    "parent_id": "t3_1at6856",
    "permalink": "/r/ChatGPT/comments/1at6856/researchers_say_generative_ai_isnt_replacing_devs/kyb74su/",
    "removal_reason": null,
    "replies": "",
    "report_reasons": null,
    "retrieved_on": 1712404512,
    "saved": false,
    "score": 1,
    "score_hidden": false,
    "send_replies": true,
    "stickied": false,
    "subreddit": "ChatGPT",
    "subreddit_id": "t5_7hqomg",
    "subreddit_name_prefixed": "r/ChatGPT",
    "subreddit_type": "public",
    "top_awarded_type": null,
    "total_awards_received": 0,
    "treatment_tags": [],
    "unrepliable_reason": null,
    "ups": 1,
    "user_reports": []
}