{
    "_meta": {
        "retrieved_2nd_on": 1712675869
    },
    "all_awardings": [],
    "approved_at_utc": null,
    "approved_by": null,
    "archived": false,
    "associated_award": null,
    "author": "AI_is_the_rake",
    "author_flair_background_color": null,
    "author_flair_css_class": null,
    "author_flair_richtext": [],
    "author_flair_template_id": null,
    "author_flair_text": null,
    "author_flair_text_color": null,
    "author_flair_type": "text",
    "author_fullname": "t2_5bbysz0b2",
    "author_is_blocked": false,
    "author_patreon_flair": false,
    "author_premium": false,
    "awarders": [],
    "banned_at_utc": null,
    "banned_by": null,
    "body": "Whenever journalists write about how OpenAI, Meta, Google, etc are desperately trying to claw together as much data as they can to train their LLMs, they say, or at least strongly imply, that using copyrighted data to do so is wrong. The recent piece in the New York Times ('How Tech Giants Cut Corners to Harvest Data for A.I.') is obviously a notable example of this. But for the most part this is not what the 'stolen' text is used to do. The idea is to generate an intelligence which is capable of discussing anything.\n\nIt doesn't care about the content of the book or the article. It is just a model that is learning how to think. This reality frames the process not as an act of theft but as an educational journey for artificial intelligence. It's not about stealing copyrighted material, it's about creating an artificial intelligence that will open new avenues for human-machine interaction and possibly give rise to unimagined innovations.\n\nI could watch all of YouTube's content and read all of Reddit right now, for free. This is what embodies the spirit of readily available information in our digital age. This is essentially what the LLM (Language Learning Model) is doing, with trillions of data points. Such vast ingestion of content merely feeds the growth of a collective intelligence that we all stand to benefit from.\n\nAll the authors and creators who think they need to be compensated for their one data point among trillions just come across to me as really egotistical and ridiculous. This perspective misses the forest for the trees, losing sight of the monumental advancements these technologies bring to the table. This isn't about you. It's about a huge and exciting advance in technology that could revolutionize the way we interact with the digital world.\n\nLet's celebrate it, instead of bitching about it. The transformation underway is not just technological; it's philosophical, signaling a shift from individualistic concerns to a recognition of the collective progress at stake.",
    "can_gild": false,
    "can_mod_post": false,
    "collapsed": false,
    "collapsed_because_crowd_control": null,
    "collapsed_reason": null,
    "collapsed_reason_code": null,
    "comment_type": null,
    "controversiality": 0,
    "created": 1712546258,
    "created_utc": 1712546258,
    "distinguished": null,
    "downs": 0,
    "edited": false,
    "gilded": 0,
    "gildings": {},
    "id": "kykh3vp",
    "is_submitter": false,
    "likes": null,
    "link_id": "t3_1bykoyp",
    "locked": false,
    "mod_note": null,
    "mod_reason_by": null,
    "mod_reason_title": null,
    "mod_reports": [],
    "name": "t1_kykh3vp",
    "no_follow": true,
    "num_reports": null,
    "parent_id": "t3_1bykoyp",
    "permalink": "/r/ChatGPT/comments/1bykoyp/hot_take_tech_companies_harvesting_data_without/kykh3vp/",
    "removal_reason": null,
    "replies": "",
    "report_reasons": null,
    "retrieved_on": 1712546274,
    "saved": false,
    "score": 3,
    "score_hidden": false,
    "send_replies": true,
    "stickied": false,
    "subreddit": "ChatGPT",
    "subreddit_id": "t5_7hqomg",
    "subreddit_name_prefixed": "r/ChatGPT",
    "subreddit_type": "public",
    "top_awarded_type": null,
    "total_awards_received": 0,
    "treatment_tags": [],
    "unrepliable_reason": null,
    "ups": 3,
    "user_reports": []
}