{
    "_meta": {
        "retrieved_2nd_on": 1712682738
    },
    "all_awardings": [],
    "approved_at_utc": null,
    "approved_by": null,
    "archived": false,
    "associated_award": null,
    "author": "AI_is_the_rake",
    "author_flair_background_color": null,
    "author_flair_css_class": null,
    "author_flair_richtext": [],
    "author_flair_template_id": null,
    "author_flair_text": null,
    "author_flair_text_color": null,
    "author_flair_type": "text",
    "author_fullname": "t2_5bbysz0b2",
    "author_is_blocked": false,
    "author_patreon_flair": false,
    "author_premium": false,
    "awarders": [],
    "banned_at_utc": null,
    "banned_by": null,
    "body": "Whenever journalists write about how OpenAI, Meta, Google, and similar entities are racing to gather extensive data to develop their language learning models (LLMs), there's an unmistakable undertone of criticism regarding the use of copyrighted materials. Notably, the New York Times piece titled \"How Tech Giants Cut Corners to Harvest Data for A.I.\" casts a spotlight on this issue. However, the allegations suggesting that there's something inherently immoral in this pursuit seem unnecessarily inflated in my perspective.\n\n\n\nThe critique often revolves around If the LLM reads your book and then re-prints it, mimics it, quotes from it without citing you or crediting you—okay, fine, that's pretty questionable. Yet in reality, But for the most part this is not what the \"stolen\" text is used to do. We're not witnessing the pilfering of copyrighted works, but rather The idea is to generate an intelligence which is capable of discussing anything. This intelligence It doesn't care about the content of the book or the article. I could watch all of YouTube's content and read all of reddit right now, for free. I could go to Barnes & Noble and read every copyrighted book in there for free, right now, without paying a cent. Such is the nature of learning—it is about indiscriminate consumption of information for education, and so this is essentially what the LLM is doing, with trillions of data points.\n\n\n\nSome creators voice that they should be compensated, but such views can be myopic. All the authors and creators who think they need to be compensated for their one data point among trillions just come across to me as really egotistical and ridiculous. It's about recognizing that this isn't about you. We're part of a larger narrative—It's about a huge and exciting advance in technology. A shift towards celebrating advancements rather than critiquing methodologies is needed; Let's celebrate it, instead of bitching about it. This advances the discourse beyond individual concerns to a collective realization of the transformative power of AI.",
    "can_gild": false,
    "can_mod_post": false,
    "collapsed": false,
    "collapsed_because_crowd_control": null,
    "collapsed_reason": null,
    "collapsed_reason_code": null,
    "comment_type": null,
    "controversiality": 0,
    "created": 1712553129,
    "created_utc": 1712553129,
    "distinguished": null,
    "downs": 0,
    "edited": false,
    "gilded": 0,
    "gildings": {},
    "id": "kykubvy",
    "is_submitter": false,
    "likes": null,
    "link_id": "t3_1bykoyp",
    "locked": false,
    "mod_note": null,
    "mod_reason_by": null,
    "mod_reason_title": null,
    "mod_reports": [],
    "name": "t1_kykubvy",
    "no_follow": true,
    "num_reports": null,
    "parent_id": "t1_kykhesa",
    "permalink": "/r/ChatGPT/comments/1bykoyp/hot_take_tech_companies_harvesting_data_without/kykubvy/",
    "removal_reason": null,
    "replies": "",
    "report_reasons": null,
    "retrieved_on": 1712553145,
    "saved": false,
    "score": 1,
    "score_hidden": false,
    "send_replies": true,
    "stickied": false,
    "subreddit": "ChatGPT",
    "subreddit_id": "t5_7hqomg",
    "subreddit_name_prefixed": "r/ChatGPT",
    "subreddit_type": "public",
    "top_awarded_type": null,
    "total_awards_received": 0,
    "treatment_tags": [],
    "unrepliable_reason": null,
    "ups": 1,
    "user_reports": []
}