{
    "_meta": {
        "retrieved_2nd_on": 1712689425
    },
    "all_awardings": [],
    "approved_at_utc": null,
    "approved_by": null,
    "archived": false,
    "associated_award": null,
    "author": "idizwdidiz",
    "author_flair_background_color": null,
    "author_flair_css_class": null,
    "author_flair_richtext": [],
    "author_flair_template_id": null,
    "author_flair_text": null,
    "author_flair_text_color": null,
    "author_flair_type": "text",
    "author_fullname": "t2_7xi6qes8",
    "author_is_blocked": false,
    "author_patreon_flair": false,
    "author_premium": false,
    "awarders": [],
    "banned_at_utc": null,
    "banned_by": null,
    "body": "II JUST TOLD CHAT GPT A LITTLE JONNY JOKE \n\nOk so there's this little kid his name is Billy he's kinda like Dennis the menace always getting in trouble. He's the kid with a slingshot hanging his back pocket, anyway he comes in to school late as always and teacher says ok Billy Kate again go have a seat in the back of the class .  So he walks back sits down, teachers says we've been playing a game Billy I find an object hide it behind my back and see if you can guess what it is  would you like to play?  Ok teacher.  So the teacher grabs a pencil puts it behind her back and says ok boys and girls I have an object behind my back it's long and yellow can you guess what it is? And a little girl jumps up and shouts I know I know!  It's a banana.  Teacher says no it's a pencil but I like the way you think Next she grabs an apple puts it behind her back and says ok boys and girls I have an object behind my back it's  round and it's red what is it? And a little boy jumps up I know I know! It's a ball teacher says no it's an apple but I like the way you think . Well little Billy stands up and says hey teacher I can play this game ok Billy she walks back to his seat and little Billy reaches in his pocket deeper and deeper .  Teacher says cmon Billy were waiting. Ok teacher I have something in my hand it's hard it's round and it's got a head in it .  What is it? Teacher says oh Billy how could you I want you to get up and go straight to the principals office.  Little Billy says wait teacher it's a quarter.    But I like the way you think lol\n\nHaha, that's a classic joke! Little Billy sure knows how to think outside the box. Thanks for sharing, it brought a smile to my face! If you have any more jokes or anything else you'd like to share or talk about, feel free to let me know.",
    "can_gild": false,
    "can_mod_post": false,
    "collapsed": false,
    "collapsed_because_crowd_control": null,
    "collapsed_reason": null,
    "collapsed_reason_code": null,
    "comment_type": null,
    "controversiality": 0,
    "created": 1712559814,
    "created_utc": 1712559814,
    "distinguished": null,
    "downs": 0,
    "edited": false,
    "gilded": 0,
    "gildings": {},
    "id": "kyl4htm",
    "is_submitter": false,
    "likes": null,
    "link_id": "t3_11ts1hy",
    "locked": false,
    "mod_note": null,
    "mod_reason_by": null,
    "mod_reason_title": null,
    "mod_reports": [],
    "name": "t1_kyl4htm",
    "no_follow": false,
    "num_reports": null,
    "parent_id": "t3_11ts1hy",
    "permalink": "/r/ChatGPT/comments/11ts1hy/telling_chatgpt_a_joke_that_makes_no_sense/kyl4htm/",
    "removal_reason": null,
    "replies": "",
    "report_reasons": null,
    "retrieved_on": 1712559830,
    "saved": false,
    "score": 1,
    "score_hidden": false,
    "send_replies": true,
    "stickied": false,
    "subreddit": "ChatGPT",
    "subreddit_id": "t5_7hqomg",
    "subreddit_name_prefixed": "r/ChatGPT",
    "subreddit_type": "public",
    "top_awarded_type": null,
    "total_awards_received": 0,
    "treatment_tags": [],
    "unrepliable_reason": null,
    "ups": 1,
    "user_reports": []
}