{
    "_meta": {
        "retrieved_2nd_on": 1712829794
    },
    "all_awardings": [],
    "approved_at_utc": null,
    "approved_by": null,
    "archived": false,
    "associated_award": null,
    "author": "Any_Historian888",
    "author_flair_background_color": null,
    "author_flair_css_class": null,
    "author_flair_richtext": [],
    "author_flair_template_id": null,
    "author_flair_text": null,
    "author_flair_text_color": null,
    "author_flair_type": "text",
    "author_fullname": "t2_jmq1ewdn",
    "author_is_blocked": false,
    "author_patreon_flair": false,
    "author_premium": false,
    "awarders": [],
    "banned_at_utc": null,
    "banned_by": null,
    "body": "# My GPT List\n\nHey there! I'm Ulderico, a uni student who's poured my heart into creating friendly AI tools to make your life easier and more fun. From a smart study buddy to a creative partner, these personalized digital companions are designed to support you through work, school, and hobbies. I can't wait for you to meet them and see how they can help you.\n\nEnjoy! :)\n\n# [What Should I Eat?](https://chat.openai.com/g/g-sV2xLR8B0-what-should-i-eat)\n\n\"What Should I Eat?\" is your friendly AI guide for meal suggestions based on your personal goals and preferences. Whether you're looking for healthy options or need inspiration for your next meal, this tool simplifies meal decisions and adds fun to your dining experience.\n\n# [Brand Logo Creator](https://chat.openai.com/g/g-mFfx7SPMz-brand-logo-creator)\n\nDiscover the Brand Logo Maker, an expert in custom vector brand logo creation. This tool specializes in analyzing and crafting unique logos that perfectly represent your brand's identity. Elevate your branding with a custom logo that stands out.\n\n# [Fantasy RPG Namer](https://chat.openai.com/g/g-o1E9THraO-fantasy-rpg-namer)\n\nEnter the creative world of the Fantasy RPG Namer. This tool is designed to generate unique and fitting names for every aspect of your fantasy universe, infusing your realm with names that spark wonder and enhance your storytelling adventure.\n\n# [Story Weaver](https://chat.openai.com/g/g-rltV5iQHx-story-weaver)\n\nOvercome writer's block with Story Weaver, your personal guide in the art of storytelling. This tool assists you in creating vivid characters, enchanting worlds, and gripping plots, elevating your writing journey to new creative heights.\n\n# [Learn Everything in 3 Min](https://chat.openai.com/g/g-EGZxRdgos-kid-friendly-explainer)\n\nIntroducing Kid Friendly Explainer, a tool that simplifies complex topics in a way that's easy to understand, much like the famed Richard Feynman. Perfect for explaining intricate subjects to children, it helps make learning accessible and enjoyable for the younger audience.\n\n# [Nutritionist🍏](https://chat.openai.com/g/g-FJoOwRCEz-nutritionist)\n\nIntroducing your personal AI Nutritionist, a revolutionary tool blending the latest in nutrition science with personalized meal planning. Whether you're an athlete seeking peak performance, a health enthusiast aiming for balanced diets, or exploring plant-based eating, this AI nutritionist offers tailored advice based on cutting-edge research in sports, public health, and animal nutrition. Discover the power of food as medicine and take the first step towards a healthier, more vibrant you with your AI Nutritionist.\n\n# [Problem Solver (Math and More!)](https://chat.openai.com/g/g-2e3MVFm8N-problem-solver-math-and-more)\n\nMeet your new virtual math mentor, Problem Solver, designed to navigate the complexities of mathematics with you. From algebra to calculus, this AI-powered tutor provides personalized error analysis and step-by-step problem-solving guidance. With a focus on building your confidence and enhancing your mathematical skills, Problem Solver offers an array of practice problems tailored to your learning pace. Ideal for students and lifelong learners alike, it transforms challenging math concepts into manageable and understandable lessons.",
    "can_gild": false,
    "can_mod_post": false,
    "collapsed": false,
    "collapsed_because_crowd_control": null,
    "collapsed_reason": null,
    "collapsed_reason_code": null,
    "comment_type": null,
    "controversiality": 0,
    "created": 1712700186,
    "created_utc": 1712700186,
    "distinguished": null,
    "downs": 0,
    "edited": false,
    "gilded": 0,
    "gildings": {},
    "id": "kyu2b48",
    "is_submitter": false,
    "likes": null,
    "link_id": "t3_1bysjuu",
    "locked": false,
    "mod_note": null,
    "mod_reason_by": null,
    "mod_reason_title": null,
    "mod_reports": [],
    "name": "t1_kyu2b48",
    "no_follow": true,
    "num_reports": null,
    "parent_id": "t3_1bysjuu",
    "permalink": "/r/ChatGPT/comments/1bysjuu/weekly_selfpromotional_mega_thread_27_08042024/kyu2b48/",
    "removal_reason": null,
    "replies": "",
    "report_reasons": null,
    "retrieved_on": 1712700203,
    "saved": false,
    "score": 1,
    "score_hidden": false,
    "send_replies": true,
    "stickied": false,
    "subreddit": "ChatGPT",
    "subreddit_id": "t5_7hqomg",
    "subreddit_name_prefixed": "r/ChatGPT",
    "subreddit_type": "public",
    "top_awarded_type": null,
    "total_awards_received": 0,
    "treatment_tags": [],
    "unrepliable_reason": null,
    "ups": 1,
    "user_reports": []
}