{
    "_meta": {
        "is_edited": true,
        "retrieved_2nd_on": 1712972380
    },
    "all_awardings": [],
    "approved_at_utc": null,
    "approved_by": null,
    "archived": false,
    "associated_award": null,
    "author": "XSATCHELX",
    "author_flair_background_color": null,
    "author_flair_css_class": null,
    "author_flair_richtext": [],
    "author_flair_template_id": null,
    "author_flair_text": null,
    "author_flair_text_color": null,
    "author_flair_type": "text",
    "author_fullname": "t2_bpoy5",
    "author_is_blocked": false,
    "author_patreon_flair": false,
    "author_premium": false,
    "awarders": [],
    "banned_at_utc": null,
    "banned_by": null,
    "body": "I checked some other LLMs that do not have guardrails but they are mostly shit unfortunately. The only one that is maintained by a big company that is willing to say anything controversial is Musk's Grok which is worse than chatGPT in terms of quality of responses. It is just trained on data from twitter which is obviously shit. I will also probably get stoned in this website for even mentioning that guy's name.\n\nRegarding non-profit, they were a non-profit whose mission was the following:\n\n\"OpenAI is a non-profit artificial intelligence research company. Our goal is to advance digital intelligence in the way that is most likely to benefit humanity as a whole, unconstrained by a need to generate financial return. Since our research is free from financial obligations, we can better focus on a positive human impact.\" The revenue should be a tool to achieve this goal, instead of revenue itself being the goal as you mentioned (this is what defines a non-profit)\n\nBut sure I guess screwing that mission statement and practically becoming a for-profit and practically being owned for Microsoft is all \"free market economy\" and they (probably) did nothing illegal.\n\nNot sure what you were trying to achieve by going through my profile and my old posts to find the countries I live in lol. You're welcome to try to dox me :p\n\nI hate this worldview of \"you don't get to hate this product, just buy from another company if you don't like them. Oh there are no usaful alternatives? Then make your own company. Oh you can't make your own company because you don't have access to their knowledge and resources that took years for them to acquire and they take all kinds of measures to prevent you from catching up? Sucks to be you!\"\n\nFirst of all, I can dislike a product or company and complain about it, while still being their customer because there is no better alternative. Secondly, it is not useless that I am presenting my point of view like many others in comments under this post. Thirdly, you don't get to tell me what to do. Maybe I just like to complain on the internet. Why are you complaining about me complaining? If you don't like me complain, then read another comment.",
    "can_gild": false,
    "can_mod_post": false,
    "collapsed": false,
    "collapsed_because_crowd_control": null,
    "collapsed_reason": null,
    "collapsed_reason_code": null,
    "comment_type": null,
    "controversiality": 0,
    "created": 1712842774,
    "created_utc": 1712842774,
    "distinguished": null,
    "downs": 0,
    "edited": false,
    "gilded": 0,
    "gildings": {},
    "id": "kz2p7ch",
    "is_submitter": false,
    "likes": null,
    "link_id": "t3_1c15emv",
    "locked": false,
    "mod_note": null,
    "mod_reason_by": null,
    "mod_reason_title": null,
    "mod_reports": [],
    "name": "t1_kz2p7ch",
    "no_follow": true,
    "num_reports": null,
    "parent_id": "t1_kz2gt68",
    "permalink": "/r/ChatGPT/comments/1c15emv/chatgpt_is_biased/kz2p7ch/",
    "removal_reason": null,
    "replies": "",
    "report_reasons": null,
    "retrieved_on": 1712842789,
    "saved": false,
    "score": 1,
    "score_hidden": false,
    "send_replies": true,
    "stickied": false,
    "subreddit": "ChatGPT",
    "subreddit_id": "t5_7hqomg",
    "subreddit_name_prefixed": "r/ChatGPT",
    "subreddit_type": "public",
    "top_awarded_type": null,
    "total_awards_received": 0,
    "treatment_tags": [],
    "unrepliable_reason": null,
    "ups": 1,
    "user_reports": []
}