{
    "_meta": {
        "is_edited": true,
        "retrieved_2nd_on": 1712975802
    },
    "all_awardings": [],
    "approved_at_utc": null,
    "approved_by": null,
    "archived": false,
    "associated_award": null,
    "author": "degameforrel",
    "author_flair_background_color": null,
    "author_flair_css_class": null,
    "author_flair_richtext": [],
    "author_flair_template_id": null,
    "author_flair_text": null,
    "author_flair_text_color": null,
    "author_flair_type": "text",
    "author_fullname": "t2_n2txnyp",
    "author_is_blocked": false,
    "author_patreon_flair": false,
    "author_premium": false,
    "awarders": [],
    "banned_at_utc": null,
    "banned_by": null,
    "body": "Excuse my wall of text, but this is a complicated topic so I have to be precise in my response as well.\n\n>Synthetic data is already being used to train them. So we aren’t running out of data and the next gen smaller parameter models are becoming as capable as some of the larger last gen models.\n\nThis is true, but there's also plenty of concerns that this could be poisoning the data with compounding errors. Whether that will actually happen is up for debate. Though even if it doesn't, the other concern there is that if you add more synthetic data, you won't actually see any gains in practice, since the synthetic data is fully and entirely derivative of data already in the dataset. At that point you're just adding more data without actually improving the outcomes.\n\n>The energy demands aren’t a big deal for companies like Microsoft, Amazon, and Meta. You’re talking about a technology already on course to replace thousands of job roles. Microsoft is already partnering with fusion start up. The energy demands do not matter when you have a global AI arms race between tech corporations.\n\nIt does matter when you consider the fact that we're on course for global catastrophe if we don't completely reinvent our energy production within a societally small timeframe. These tech companies will almost literally burn the world in their arms race the way things are going. And Microsoft can partner with fusion startups all they want, but unless fusion actually starts producing energy en-masse very soon, they're going to hit a wall. The energy transition will come to a grinding halt if all the new green capacity (be it fusion, renewables, nuclear) is immediately annexed by tech companies for training their shiny new AI models, and they will at some point have to be banned from doing so for the sake of the planet itself.\n\n>I think you’ll be surprised. I don’t think we’ll have AGI this year but I think it’ll be much sooner than most expect.\n\nI disagree, I think language models are fundamentally incapable of actually becoming AGI. Thinking that it can is a very cognitivist view of intelligence, but I don't ascribe to cognitivism. I think it might get very close, but when I look at the kind of mistakes that even GPT4 still makes, I see mistakes humans simply wouldn't make. For example, try having it write some scenes with multiple characters performing actions on each other (for example, a four-man wrestling free for all). It might do pretty well for a bit, but soon it will start confusing who is doing what to who in ways that humans simply wouldn't. And language models have been making this exact type of mistake since their inception with no indication that they will stop doing so soon. We are somehow much more able to keep track of the subject, action and object. To me, this makes a lot of sense because I view intelligence from a more embodied and enactivist perspective, and from that a purely cognition based approach is bound to have these kinds of errors.",
    "can_gild": false,
    "can_mod_post": false,
    "collapsed": false,
    "collapsed_because_crowd_control": null,
    "collapsed_reason": null,
    "collapsed_reason_code": null,
    "comment_type": null,
    "controversiality": 0,
    "created": 1712846193,
    "created_utc": 1712846193,
    "distinguished": null,
    "downs": 0,
    "edited": false,
    "gilded": 0,
    "gildings": {},
    "id": "kz2yqgv",
    "is_submitter": false,
    "likes": null,
    "link_id": "t3_1c1bhyn",
    "locked": false,
    "mod_note": null,
    "mod_reason_by": null,
    "mod_reason_title": null,
    "mod_reports": [],
    "name": "t1_kz2yqgv",
    "no_follow": true,
    "num_reports": null,
    "parent_id": "t1_kz2lig6",
    "permalink": "/r/ChatGPT/comments/1c1bhyn/ceos_bet_up_to_10_million_to_prove_elon_musks_ai/kz2yqgv/",
    "removal_reason": null,
    "replies": "",
    "report_reasons": null,
    "retrieved_on": 1712846209,
    "saved": false,
    "score": 1,
    "score_hidden": false,
    "send_replies": true,
    "stickied": false,
    "subreddit": "ChatGPT",
    "subreddit_id": "t5_7hqomg",
    "subreddit_name_prefixed": "r/ChatGPT",
    "subreddit_type": "public",
    "top_awarded_type": null,
    "total_awards_received": 0,
    "treatment_tags": [],
    "unrepliable_reason": null,
    "ups": 1,
    "user_reports": []
}