{
    "_meta": {
        "retrieved_2nd_on": 1712981562
    },
    "all_awardings": [],
    "approved_at_utc": null,
    "approved_by": null,
    "archived": false,
    "associated_award": null,
    "author": "Cute_Kangaroo_8791",
    "author_flair_background_color": null,
    "author_flair_css_class": null,
    "author_flair_richtext": [],
    "author_flair_template_id": null,
    "author_flair_text": null,
    "author_flair_text_color": null,
    "author_flair_type": "text",
    "author_fullname": "t2_ltasx0l63",
    "author_is_blocked": false,
    "author_patreon_flair": false,
    "author_premium": false,
    "awarders": [],
    "banned_at_utc": null,
    "banned_by": null,
    "body": ">There's not just more misogynist, it's kind of the opposite logic. If they are already woman hating folk, THEN they join an MRA group,  that's how it's advertised to them.\n\nEvery MRA movement I’ve come across has been advertised as a group to support men, not to put down women. In fact most of them explicitly prohibit misogyny. That’s not to say the movement doesn’t attract misogynists, but the movement itself isn’t.\n\n>Joining a feminist movement isn't because of some terf minority, it’s despite a malign minority who claim trans rights will harm them.\n\nSo can you speak for every misandrist who identifies with feminism? Because I’ve met tons of them.\n\n>I'm of the position that it takes a real piece of shit to claim \"defending their rights harms our cause so they can go to hell while we solve my problems first\"\n\nThat’s exactly what you’re doing though. You’re claiming that feminism is good and men’s rights activism is bad without considering the goals of both movements. Of course there are people on both sides who think like that, but I wouldn’t consider them to be feminists or MRAs since they directly go against the point of the movement.\n\n>I'm happy chatgpt is able to identify feminism as a movement for defending women rights,  and addressing very real issues with how society treats women,  vs. Identifying mras as some privileged cry babies who are in denial about how much better they have it so they hallucinate non issues to claim women are horrible people.\n\nMen have tons of issues, they are just barely talked about due to thought processes like these.\n\nJust to name a few:\n\nHigher suicide rate\n\nHigher rate of mental illness\n\nVast majority of murder victims\n\nHarsher sentences ling for the same crimes\n\nVast majority of workplace deaths\n\nVast majority of military deaths\n\nMale only conscription in many countries\n\nLack of mental health care/awareness\n\nMajority of homeless people\n\nAll those problems could be solved by bringing awareness to them and establishing support programs, but people like you still deny their existence.\n\n>It's funny how most issues mras discuss are pretty much the result of sexist systems put in place by men. Why does a court give the children to the mother by default? Because women are sensitive and soft care givers. Well feminism breaks that stereotype,  claiming men can be that too.\n\nThat’s completely true, but I don’t see why we should ignore men’s issues today simply because they were the result of systems put into place by people of the same gender hundreds of years ago.\n\n>Men following mra movements are obviously not trying to resolve gender stereotype issues that haunt them by destroying sexism , but by pretending something equivalent of \"the earth is flat\"\n\nLike I said, those people go against the point of the movement, so in my opinion they aren’t MRAs. There are also tons of misandrist women who follow feminist movements, I wouldn’t consider those to be feminists either, for the same reason.\n\n>It's a reactive movement that doesn't like feminism or women and wants to maintain privilege by hallucinating problems\n\nLet’s repeat:\n\nHigher suicide rate\n\nHigher rate of mental illness\n\nVast majority of murder victims\n\nHarsher sentences ling for the same crimes\n\nVast majority of workplace deaths\n\nVast majority of military deaths\n\nMale only conscription in many countries\n\nLack of mental health care/awareness\n\nMajority of homeless people\n\nWould you consider these to be “hallucinated problems”?",
    "can_gild": false,
    "can_mod_post": false,
    "collapsed": false,
    "collapsed_because_crowd_control": null,
    "collapsed_reason": null,
    "collapsed_reason_code": null,
    "comment_type": null,
    "controversiality": 0,
    "created": 1712851949,
    "created_utc": 1712851949,
    "distinguished": null,
    "downs": 0,
    "edited": false,
    "gilded": 0,
    "gildings": {},
    "id": "kz3g3dn",
    "is_submitter": false,
    "likes": null,
    "link_id": "t3_1c15emv",
    "locked": false,
    "mod_note": null,
    "mod_reason_by": null,
    "mod_reason_title": null,
    "mod_reports": [],
    "name": "t1_kz3g3dn",
    "no_follow": true,
    "num_reports": null,
    "parent_id": "t1_kz33a4e",
    "permalink": "/r/ChatGPT/comments/1c15emv/chatgpt_is_biased/kz3g3dn/",
    "removal_reason": null,
    "replies": "",
    "report_reasons": null,
    "retrieved_on": 1712851966,
    "saved": false,
    "score": 0,
    "score_hidden": false,
    "send_replies": true,
    "stickied": false,
    "subreddit": "ChatGPT",
    "subreddit_id": "t5_7hqomg",
    "subreddit_name_prefixed": "r/ChatGPT",
    "subreddit_type": "public",
    "top_awarded_type": null,
    "total_awards_received": 0,
    "treatment_tags": [],
    "unrepliable_reason": null,
    "ups": 0,
    "user_reports": []
}