{
    "_meta": {
        "is_edited": true,
        "retrieved_2nd_on": 1713519856
    },
    "all_awardings": [],
    "approved_at_utc": null,
    "approved_by": null,
    "archived": false,
    "associated_award": null,
    "author": "__Taylor_Swift__",
    "author_flair_background_color": null,
    "author_flair_css_class": null,
    "author_flair_richtext": [],
    "author_flair_template_id": null,
    "author_flair_text": null,
    "author_flair_text_color": null,
    "author_flair_type": "text",
    "author_fullname": "t2_hqez3ivx",
    "author_is_blocked": false,
    "author_patreon_flair": false,
    "author_premium": false,
    "awarders": [],
    "banned_at_utc": null,
    "banned_by": null,
    "body": "Alright, here goes my attempt at paraphrasing:\n\n>You: \"[AI exhibiting bias] is still deeply concerning. Do you want an AI that's as flawed and biased as humans?\"\n\n>Me: \"It's not inherently concerning because both the data and the model contribute to bias. Both can be corrected for.\"\n\n>You: \"The majority of content in general is biased and inaccurate. II wonder how we could correct the training data at this point.\"\n\n>Me: \"You would have to actually study bias in data and develop based on insights learned. So, in theory, it would only take one project trying to make something other than money.\"\n\n>You: \"That's such a mega task, they've trained it on the entire internet how do you even start to filter that data?\"\n\nThere's a bit here where we go off the rails because you said it's trained on \"the entire internet\" and then nitpicked my use of \"unfiltered\" instead of interpreting your use of the word entire to mean \"most of the internet\" instead of \"all of it\". But then we get back around to the actual argument here:\n\n>You: \"What does [the fact that there are parameters] have to do with the training material?\"\n\n>Me: Training data is only half of the equation. The way the model is designed is a big part of how bias emerges in an LLM.\n\nYou then go on to use ChatGPT to assert that bias is mainly linked to data. I then counter that I can get ChatGPT to admit to the exact opposite, showing a response that emphasizes bias in the modeling process.\n\nFundamentally, ChatGPT and all LLMs are prediction algorithms that output text based on the data. Bias exists in the data, the model, and the output. Controlling for bias in the data doesn't do any good if the model itself is heavily biased, since the output from the unbiased data is generated by a biased model. Similarly, attempting to minimize bias in the model is useless if you're feeding it data exclusively from 4Chan.\n\nStudying bias is a complicated thing that is difficult to be objective about, as there is no way to tell objectively something is biased or even to what degree something is influenced by bias. Sure, it's a complicated problem, but my original point is that there's no reason to suspect that it's a difficult or impossible problem simply because it hasn't been solved yet.",
    "can_gild": false,
    "can_mod_post": false,
    "collapsed": false,
    "collapsed_because_crowd_control": null,
    "collapsed_reason": null,
    "collapsed_reason_code": null,
    "comment_type": null,
    "controversiality": 0,
    "created": 1713390244,
    "created_utc": 1713390244,
    "distinguished": null,
    "downs": 0,
    "edited": false,
    "gilded": 0,
    "gildings": {},
    "id": "l01wbj4",
    "is_submitter": false,
    "likes": null,
    "link_id": "t3_1bw9rvs",
    "locked": false,
    "mod_note": null,
    "mod_reason_by": null,
    "mod_reason_title": null,
    "mod_reports": [],
    "name": "t1_l01wbj4",
    "no_follow": true,
    "num_reports": null,
    "parent_id": "t1_l014zhv",
    "permalink": "/r/ChatGPT/comments/1bw9rvs/chatgpt_will_not_respond_to_questions_related_to/l01wbj4/",
    "removal_reason": null,
    "replies": "",
    "report_reasons": null,
    "retrieved_on": 1713390259,
    "saved": false,
    "score": 1,
    "score_hidden": false,
    "send_replies": true,
    "stickied": false,
    "subreddit": "ChatGPT",
    "subreddit_id": "t5_7hqomg",
    "subreddit_name_prefixed": "r/ChatGPT",
    "subreddit_type": "public",
    "top_awarded_type": null,
    "total_awards_received": 0,
    "treatment_tags": [],
    "unrepliable_reason": null,
    "ups": 1,
    "user_reports": []
}