{
    "_meta": {
        "retrieved_2nd_on": 1713691817
    },
    "all_awardings": [],
    "approved_at_utc": null,
    "approved_by": null,
    "archived": false,
    "associated_award": null,
    "author": "FuzzyTouch6143",
    "author_flair_background_color": null,
    "author_flair_css_class": null,
    "author_flair_richtext": [],
    "author_flair_template_id": null,
    "author_flair_text": null,
    "author_flair_text_color": null,
    "author_flair_type": "text",
    "author_fullname": "t2_pz39eq1r",
    "author_is_blocked": false,
    "author_patreon_flair": false,
    "author_premium": false,
    "awarders": [],
    "banned_at_utc": null,
    "banned_by": null,
    "body": "Many of these AI technologies differ.  But many do you operate on the premise of deep learning.  So they haven’t just looked at thousands of pictures of cats.  But I think what people often message that it is also look at thousands of pictures of various features of cats (like nails, hair, etc)\n\nAs for “blending”, those are higher order features that the algos can also accomplish over a few more iterations as people continue to point out flaws in AI images\n\nBecause a clever person will come along , and construct a training data set to identify all the flaws that AI is generated.  The base models and then be fine. Tuned to address these flaws.\n\nIronically, the more people work to identify what sort of work is fake, and which ones are generated by AI , the more training data that people giving publicly, giving smaller technology companies essentially free data to train their own find tune, a i on\n\nPut simply , it is posts like these on Reddit and other social media websites as well as just general websites that will service essentially free training data to make aI even better\n\nI fear that within the next few months, we won’t be able to distinguish anything between AI and genuine work \n\nAlthough curiously enough, I think what we will be able to prove, is that if given a data artifact, and a person, assuming we have all of that same person’s work to analyze; then this is a sort of question we should within a reasonable degree of certainty, be able to guesstimate\n\nAs for detecting, what is a deep fake?   I don’t think we’ll ever be able to have the technology to do that.  Engineers claim a I will always Mark certain characteristics in the photos., but to be honest, how these algorithms work, those marks and those characteristics will soon be corrected, just such a degree that I really honestly don’t think we’ll be able to tell the differences pretty soon",
    "can_gild": false,
    "can_mod_post": false,
    "collapsed": false,
    "collapsed_because_crowd_control": null,
    "collapsed_reason": null,
    "collapsed_reason_code": null,
    "comment_type": null,
    "controversiality": 0,
    "created": 1713562206,
    "created_utc": 1713562206,
    "distinguished": null,
    "downs": 0,
    "edited": false,
    "gilded": 0,
    "gildings": {},
    "id": "l0cx6zn",
    "is_submitter": false,
    "likes": null,
    "link_id": "t3_1c6eob8",
    "locked": false,
    "mod_note": null,
    "mod_reason_by": null,
    "mod_reason_title": null,
    "mod_reports": [],
    "name": "t1_l0cx6zn",
    "no_follow": true,
    "num_reports": null,
    "parent_id": "t1_l03o2tz",
    "permalink": "/r/ChatGPT/comments/1c6eob8/i_know_in_my_bones_this_is_ai_but_cant_prove_it/l0cx6zn/",
    "removal_reason": null,
    "replies": "",
    "report_reasons": null,
    "retrieved_on": 1713562222,
    "saved": false,
    "score": 1,
    "score_hidden": false,
    "send_replies": true,
    "stickied": false,
    "subreddit": "ChatGPT",
    "subreddit_id": "t5_7hqomg",
    "subreddit_name_prefixed": "r/ChatGPT",
    "subreddit_type": "public",
    "top_awarded_type": null,
    "total_awards_received": 0,
    "treatment_tags": [],
    "unrepliable_reason": null,
    "ups": 1,
    "user_reports": []
}