{
    "_meta": {
        "retrieved_2nd_on": 1713864946
    },
    "all_awardings": [],
    "approved_at_utc": null,
    "approved_by": null,
    "archived": false,
    "associated_award": null,
    "author": "BringBackBeefyCrunch",
    "author_flair_background_color": null,
    "author_flair_css_class": null,
    "author_flair_richtext": [],
    "author_flair_template_id": null,
    "author_flair_text": null,
    "author_flair_text_color": null,
    "author_flair_type": "text",
    "author_fullname": "t2_ovjh7tmwb",
    "author_is_blocked": false,
    "author_patreon_flair": false,
    "author_premium": false,
    "awarders": [],
    "banned_at_utc": null,
    "banned_by": null,
    "body": "What are you thinking of when you say STEM?\n\nThings involving code? Yes, absolutely. I'd be shitting my pants if I was a programmer. \n\nScientists working in a lab? I am having a hard time envisioning how they could be replaced any time soon. \n\nMy job is roughly 25% coding which I use to interface with hardware, run experiments, and analyze the data afterwards. I now use AI to speed up these tasks, which gives me more time for everything else.\n\nIn order for an AI to be flexible and make experimental changes/adaptations on the fly would require equally flexible machinery. It would require some kind of robot with the dexterity to operate multiple different kinds of equipment, delicately handle samples, push buttons... an endless list that is always changing as science progresses. There are some pretty advanced robotic arms that can manipulate multiple kinds of objects but... still seems a long way off.\n\nIn mass productions environments they already have highly specialized equipment that is automated and optimized to perform it's manufacturing task as efficiently as possible. Where would AI fit in here? Perhaps it will have the ability to monitor these systems, perform inspections, quality assurance etc. Those jobs are usually \"technicians\", (which certainly fall under the stem umbrella) and could be at risk.\n\nThese LLMs are also only able to reason and infer based on information they have already been taught. The whole point of science is to learn new things. So a major evolution in AI would be required before it starts finding solutions to unsolved scientific problems, discovering new physics, etc. The people actually pushing science forward are safe for now. Moreover, if AI actually gains reasoning ability at this level then almost every job will be at risk.\n\nAside from programmers, STEM workers are much more hands-on compared to your average white collar worker. There are many more people sitting in front of excel spreadsheets than doing hard science. It seems those jobs are much more likely to be replaced by AI sooner than most stem jobs. If your job only requires a computer, it's probably more at risk.",
    "can_gild": false,
    "can_mod_post": false,
    "collapsed": false,
    "collapsed_because_crowd_control": null,
    "collapsed_reason": null,
    "collapsed_reason_code": null,
    "comment_type": null,
    "controversiality": 0,
    "created": 1713735340,
    "created_utc": 1713735340,
    "distinguished": null,
    "downs": 0,
    "edited": false,
    "gilded": 0,
    "gildings": {},
    "id": "l0nkj1z",
    "is_submitter": false,
    "likes": null,
    "link_id": "t3_1c9iut9",
    "locked": false,
    "mod_note": null,
    "mod_reason_by": null,
    "mod_reason_title": null,
    "mod_reports": [],
    "name": "t1_l0nkj1z",
    "no_follow": true,
    "num_reports": null,
    "parent_id": "t3_1c9iut9",
    "permalink": "/r/ChatGPT/comments/1c9iut9/will_ai_kill_stem/l0nkj1z/",
    "removal_reason": null,
    "replies": "",
    "report_reasons": null,
    "retrieved_on": 1713735355,
    "saved": false,
    "score": 0,
    "score_hidden": false,
    "send_replies": true,
    "stickied": false,
    "subreddit": "ChatGPT",
    "subreddit_id": "t5_7hqomg",
    "subreddit_name_prefixed": "r/ChatGPT",
    "subreddit_type": "public",
    "top_awarded_type": null,
    "total_awards_received": 0,
    "treatment_tags": [],
    "unrepliable_reason": null,
    "ups": 0,
    "user_reports": []
}