{
    "_meta": {
        "retrieved_2nd_on": 1713897205
    },
    "all_awardings": [],
    "approved_at_utc": null,
    "approved_by": null,
    "archived": false,
    "associated_award": null,
    "author": "GrowlDev",
    "author_flair_background_color": null,
    "author_flair_css_class": null,
    "author_flair_richtext": [],
    "author_flair_template_id": null,
    "author_flair_text": null,
    "author_flair_text_color": null,
    "author_flair_type": "text",
    "author_fullname": "t2_gjymlby",
    "author_is_blocked": false,
    "author_patreon_flair": false,
    "author_premium": false,
    "awarders": [],
    "banned_at_utc": null,
    "banned_by": null,
    "body": "Ok, so to start with you have Diffusion models, which work on the principle of gradually constructing an image (or other data types) by starting from a random noise and iteratively refining it into a structured output. Here’s a simplified breakdown: Start with Noise; the model begins with an image of pure random noise.Then it does whats called Iterative Refinement: Over multiple steps, the model  alters this noisy image, guided by a neural network, to make it look more like the images it was trained on. Each step is a small modification aimed to reduce the noise and add more features from the target distribution (like faces, landscapes, etc.).Training: During training, the model learns how to reverse a process where a clear image is gradually converted into random noise. By learning this, it effectively knows how to go from noise to a clear image during generation.\n\nWhich kind of ties nicely into GANs, which you mentioned.Generative Adversarial Networks (GANs)GANs consist of two competing neural networks: a generator and a discriminator. The gen network generates new images from a random input (latent space). Its goal is to create images so realistic that the discriminator cannot tell them apart from real images. The discriminator’s job is to differentiate between real images from the training dataset and fake images produced by the generator. What follows is a sort of AI arms race. the generator tries to fool the discriminator by improving its output, while the discriminator learns to get better at distinguishing real from fake. The process continues until the generator produces highly realistic images.\n\nAs for handling large image sizes when dealing with high-dimensional data like 512x512 images, directly processing every pixel at once would be inefficient and computationally expensive. So to achieve this we adopt a Reduction in Dimensionality: Techniques such as down-sampling or using convolutions reduce the dimensionality of the image data. This way, the model deals with a compressed representation rather than raw pixels, making the learning process more manageable. Theres also batch processing. So large images or datasets are processed in smaller batches (as you mentioned with LLaVA for image recognition). This makes it feasible to optimize the model using less memory and processing power.\n\nIm by no means an expert and just learning a lot of these things myself, so I apologise for some simplifications or possiblw inaccuracies. But fortunately of you want to learn more there are abundant resources on the Web, not to mention ChatGPT itself;)",
    "can_gild": false,
    "can_mod_post": false,
    "collapsed": false,
    "collapsed_because_crowd_control": null,
    "collapsed_reason": null,
    "collapsed_reason_code": null,
    "comment_type": null,
    "controversiality": 0,
    "created": 1713767592,
    "created_utc": 1713767592,
    "distinguished": null,
    "downs": 0,
    "edited": false,
    "gilded": 0,
    "gildings": {},
    "id": "l0phdng",
    "is_submitter": false,
    "likes": null,
    "link_id": "t3_1ca239q",
    "locked": false,
    "mod_note": null,
    "mod_reason_by": null,
    "mod_reason_title": null,
    "mod_reports": [],
    "name": "t1_l0phdng",
    "no_follow": true,
    "num_reports": null,
    "parent_id": "t3_1ca239q",
    "permalink": "/r/ChatGPT/comments/1ca239q/how_does_other_ai_work_besides_transformers/l0phdng/",
    "removal_reason": null,
    "replies": "",
    "report_reasons": null,
    "retrieved_on": 1713767608,
    "saved": false,
    "score": 6,
    "score_hidden": false,
    "send_replies": true,
    "stickied": false,
    "subreddit": "ChatGPT",
    "subreddit_id": "t5_7hqomg",
    "subreddit_name_prefixed": "r/ChatGPT",
    "subreddit_type": "public",
    "top_awarded_type": null,
    "total_awards_received": 0,
    "treatment_tags": [],
    "unrepliable_reason": null,
    "ups": 6,
    "user_reports": []
}