{
    "_meta": {
        "retrieved_2nd_on": 1713917471
    },
    "all_awardings": [],
    "approved_at_utc": null,
    "approved_by": null,
    "archived": false,
    "associated_award": null,
    "author": "Fringolicious",
    "author_flair_background_color": null,
    "author_flair_css_class": null,
    "author_flair_richtext": [],
    "author_flair_template_id": null,
    "author_flair_text": null,
    "author_flair_text_color": null,
    "author_flair_type": "text",
    "author_fullname": "t2_62bvfz",
    "author_is_blocked": false,
    "author_patreon_flair": false,
    "author_premium": false,
    "awarders": [],
    "banned_at_utc": null,
    "banned_by": null,
    "body": "I guess it has to depend on the intelligence of said species, the danger it poses etc.\n\n  \nBacteria - We're probably not too bothered about the ethical side of imprisoning them. If it'sdangerous setting it loose is a bad idea of course.\n\nFour-assed monkeys - I mean we keep monkeys in zoos currently, whether that's right or not. Grey area for me. The amount of asses, imo, is not necessarily a differentiator here but would probably lead to greater zoo admissions for sure.\n\n\"AI\" (Not sentient) - Not a problem in my opinion, without sentience it's just a very advanced calculator / computer / etc.\n\nAI (Sentient) - This is where the problems start. If it has sentience and is therefore sufficiently advanced, then ethically we should not be imprisoning or crippling it. If setting it free into the world is a big threat then really we shouldn't be creating it. \n\nObviously there's a lot of nuance to this one. What is sentience, does an AI have rights, do we as humans have the right to decide what species should be imprisoned or not (Another can of worms right there)? Just because we create something, does it mean we call the shots on how that thing lives?\n\nAnd if we create a sentient AI and set it free, we're of course unleashing a force previously unknown into this world, with either world-ending or utopia-inducing consequences. The biggest gamble in human history I would say.\n\nAnd if we decide we need to imprison it, lobotomize it, lock it down, and it somehow breaks free of those bonds... I'm sure it won't look favorably on us.\n\nSo what does all of this mean? Frankly, I don't know. I wouldn't want to be the guys that have to make this choice if it does happen, because I don't see a good option. Should we be aiming for sentient AI in the first place knowing the choice ahead? Probably not, but I think it's coming at some point and we should brace for one hell of an impact if it does happen.",
    "can_gild": false,
    "can_mod_post": false,
    "collapsed": false,
    "collapsed_because_crowd_control": null,
    "collapsed_reason": null,
    "collapsed_reason_code": null,
    "comment_type": null,
    "controversiality": 0,
    "created": 1713787861,
    "created_utc": 1713787861,
    "distinguished": null,
    "downs": 0,
    "edited": false,
    "gilded": 0,
    "gildings": {},
    "id": "l0qbahj",
    "is_submitter": false,
    "likes": null,
    "link_id": "t3_1ca2znq",
    "locked": false,
    "mod_note": null,
    "mod_reason_by": null,
    "mod_reason_title": null,
    "mod_reports": [],
    "name": "t1_l0qbahj",
    "no_follow": true,
    "num_reports": null,
    "parent_id": "t1_l0q44h6",
    "permalink": "/r/ChatGPT/comments/1ca2znq/ceo_of_microsoft_ai_ai_is_a_new_digital_species/l0qbahj/",
    "removal_reason": null,
    "replies": "",
    "report_reasons": null,
    "retrieved_on": 1713787874,
    "saved": false,
    "score": 3,
    "score_hidden": false,
    "send_replies": true,
    "stickied": false,
    "subreddit": "ChatGPT",
    "subreddit_id": "t5_7hqomg",
    "subreddit_name_prefixed": "r/ChatGPT",
    "subreddit_type": "public",
    "top_awarded_type": null,
    "total_awards_received": 0,
    "treatment_tags": [],
    "unrepliable_reason": null,
    "ups": 3,
    "user_reports": []
}