{
    "_meta": {
        "retrieved_2nd_on": 1714096771
    },
    "all_awardings": [],
    "approved_at_utc": null,
    "approved_by": null,
    "archived": false,
    "associated_award": null,
    "author": "aviaara",
    "author_flair_background_color": null,
    "author_flair_css_class": null,
    "author_flair_richtext": [],
    "author_flair_template_id": null,
    "author_flair_text": null,
    "author_flair_text_color": null,
    "author_flair_type": "text",
    "author_fullname": "t2_93zz83bc1",
    "author_is_blocked": false,
    "author_patreon_flair": false,
    "author_premium": false,
    "awarders": [],
    "banned_at_utc": null,
    "banned_by": null,
    "body": "It just depends on how carefully they review and how consistent the writing is with your own style. I could tell when 2 of my students used AI without necessarily relying on the AI detectors. Do you\nknow all of the content very well? Did you make sure it’s very similar to your other work? My guess is that unless you are very savvy with it and know how to cover your tracks they will be able to tell something is off and ask you questions about your essays until it is clear that you didn’t write them yourself. IMO the best bet is to (semi) come clean before they ask you anything and email them explaining you used grammarly to revise your essays but after doing some internet research\nyou realized that this uses AI. You can then ask if this is allowed, and if not, if you can have a chance to resubmit all of your essays before the semester is over (also explain you don’t have earlier versions  of the essays). Another option is to just completely clean and explain you panicked because you procrastinated and did something you knew wasn’t right. This is the best way of avoiding having all of your essays failed and possible suspension. The other folks are messing with you saying you can get arrested but you definitely can get suspended and if could for sure affect your future academic career. Ethically, it’s also pretty screwed up because essentially you are getting an unfair advantage over all of your classmates who aren’t using it so you are really doing them (and yourself) dirty more than the teacher. You can just wait and see what happens but I would say there’s a good chance you’ll be found out and that the consequences will be really severe compared to if you own up to it before being accused. It’s not really about outsmarting Turnitin but about outsmarting your teacher, which you may believe you can do but probably can’t, at least with 4 essays submitted at one time. They could be living under a rock though and not notice but personally I think the odds are strongly against you. Good luck, maybe just use the AI in ethical ways in the future while you’re still in school? You can still use it to draft outlines of essays and to get some ideas but copying and pasting word for word (even with some revisions) is also not going to help you improve your skills or learn anything and is almost certainly going to end badly for you at some point, even if you get lucky this one time. Hope this helps!",
    "can_gild": false,
    "can_mod_post": false,
    "collapsed": false,
    "collapsed_because_crowd_control": null,
    "collapsed_reason": null,
    "collapsed_reason_code": null,
    "comment_type": null,
    "controversiality": 0,
    "created": 1713967163,
    "created_utc": 1713967163,
    "distinguished": null,
    "downs": 0,
    "edited": false,
    "gilded": 0,
    "gildings": {},
    "id": "l11nct2",
    "is_submitter": false,
    "likes": null,
    "link_id": "t3_1cbv6qp",
    "locked": false,
    "mod_note": null,
    "mod_reason_by": null,
    "mod_reason_title": null,
    "mod_reports": [],
    "name": "t1_l11nct2",
    "no_follow": true,
    "num_reports": null,
    "parent_id": "t3_1cbv6qp",
    "permalink": "/r/ChatGPT/comments/1cbv6qp/used_chatgpt_for_some_of_my_work_will_my_teacher/l11nct2/",
    "removal_reason": null,
    "replies": "",
    "report_reasons": null,
    "retrieved_on": 1713967178,
    "saved": false,
    "score": 1,
    "score_hidden": false,
    "send_replies": true,
    "stickied": false,
    "subreddit": "ChatGPT",
    "subreddit_id": "t5_7hqomg",
    "subreddit_name_prefixed": "r/ChatGPT",
    "subreddit_type": "public",
    "top_awarded_type": null,
    "total_awards_received": 0,
    "treatment_tags": [],
    "unrepliable_reason": null,
    "ups": 1,
    "user_reports": []
}