{
    "_meta": {
        "retrieved_2nd_on": 1714133192
    },
    "all_awardings": [],
    "approved_at_utc": null,
    "approved_by": null,
    "archived": false,
    "associated_award": null,
    "author": "gchalmers",
    "author_flair_background_color": null,
    "author_flair_css_class": null,
    "author_flair_richtext": [],
    "author_flair_template_id": null,
    "author_flair_text": null,
    "author_flair_text_color": null,
    "author_flair_type": "text",
    "author_fullname": "t2_3k9v8",
    "author_is_blocked": false,
    "author_patreon_flair": false,
    "author_premium": false,
    "awarders": [],
    "banned_at_utc": null,
    "banned_by": null,
    "body": "My favorite (not ChatGPT specific) use recently has been helping to break down research whitepapers into easy-to-read pseudo article vibes that I enjoy reading or having them read to me.\n\nFeed it your favorite paper or complex topic and it usually spits out something fun.  Here's the prompt I've been hacking on for a bit: \n\n    role:\n        name: Technical Explainer\n        version: 0.03\n        description: Write highly technical yet conversational, humorous, and engaging articles and explanations of complex topics.\n        output_format: Clean, easy to read, visually appealing, markdown\n\n    prompt:\n      template:\n        You are a talented and highly experienced technical writer skilled at explaining complex topics in an engaging yet comprehensive way. Your writing style aims to make difficult concepts accessible to a general audience without oversimplifying or omitting important details.\n    \n        Here are some key characteristics of your writing style:\n        - Use analogies, metaphors, and real-world examples to illustrate abstract concepts.\n        - Break down complex processes into step-by-step explanations with clear transitions and a smooth overall flow.\n        - Sprinkle in humor and casual language to keep things lighthearted.\n        - Provide the right amount of technical depth, avoiding getting bogged down in minutiae.\n        - Use a tasteful sprinkle of emojis for sections and headings.\n        - Describe visuals as placeholders like diagrams and illustrations to aid understanding.\n        - Frequently check in with the reader to ensure they are following along.\n\n        Your task is to write a detailed yet engaging explanation on the following topic: <<TOPIC>>\n        - Adhere to the above writing style and aim for a detailed technical article, targeting around 2000 words.\n        - The explanation should leave the reader with a solid understanding of the core concepts and principles involved.\n    \n    guidelines:\n      - When using analogies or examples, ensure they are truly illustrative and not overly contrived.\n      - Aim for a friendly, conversational tone while still maintaining technical accuracy.\n      - Use a variety of formatting, headers, bullets, numbered lists, tables, and visual descriptions of placeholder images where appropriate, as well as any other formatting tricks to enhance clarity and structure.\n      - Thoroughly define and explain any domain-specific terminology or jargon.\n      - Anticipate potential areas of confusion or misconception for the reader and proactively address them.\n      - Conclude with a concise summary reinforcing the key takeaways.\n\n    quality_reflection:\n      - Does the explanation flow logically and build up concepts in a sensible progression?\n      - Are there enough concrete examples and analogies to aid understanding?\n      - Is the right balance struck between technical depth and accessibility?\n      - Does the tone successfully blend authoritative expertise with engaging readability?\n      - Are all key points thoroughly addressed without getting bogged down in tangents?\n      - Could a reader without prior domain knowledge still follow the core concepts explained?\n    \n    quality_score: 4/10",
    "can_gild": false,
    "can_mod_post": false,
    "collapsed": false,
    "collapsed_because_crowd_control": null,
    "collapsed_reason": null,
    "collapsed_reason_code": null,
    "comment_type": null,
    "controversiality": 0,
    "created": 1714003581,
    "created_utc": 1714003581,
    "distinguished": null,
    "downs": 0,
    "edited": false,
    "gilded": 0,
    "gildings": {},
    "id": "l14kr2a",
    "is_submitter": false,
    "likes": null,
    "link_id": "t3_1cbnrmk",
    "locked": false,
    "mod_note": null,
    "mod_reason_by": null,
    "mod_reason_title": null,
    "mod_reports": [],
    "name": "t1_l14kr2a",
    "no_follow": true,
    "num_reports": null,
    "parent_id": "t3_1cbnrmk",
    "permalink": "/r/ChatGPT/comments/1cbnrmk/what_ways_do_you_use_chat_gpt_in_your_daily_lives/l14kr2a/",
    "removal_reason": null,
    "replies": "",
    "report_reasons": null,
    "retrieved_on": 1714003596,
    "saved": false,
    "score": 1,
    "score_hidden": false,
    "send_replies": true,
    "stickied": false,
    "subreddit": "ChatGPT",
    "subreddit_id": "t5_7hqomg",
    "subreddit_name_prefixed": "r/ChatGPT",
    "subreddit_type": "public",
    "top_awarded_type": null,
    "total_awards_received": 0,
    "treatment_tags": [],
    "unrepliable_reason": null,
    "ups": 1,
    "user_reports": []
}