{
    "_meta": {
        "is_edited": true,
        "retrieved_2nd_on": 1714396771
    },
    "all_awardings": [],
    "approved_at_utc": null,
    "approved_by": null,
    "archived": false,
    "associated_award": null,
    "author": "Fontaigne",
    "author_flair_background_color": null,
    "author_flair_css_class": null,
    "author_flair_richtext": [],
    "author_flair_template_id": null,
    "author_flair_text": null,
    "author_flair_text_color": null,
    "author_flair_type": "text",
    "author_fullname": "t2_afft1rm3",
    "author_is_blocked": false,
    "author_patreon_flair": false,
    "author_premium": false,
    "awarders": [],
    "banned_at_utc": null,
    "banned_by": null,
    "body": "If you worked on any of the word processing apps that store progress copies, then show that to your prof. For example,Microsoft Word has a feature that stores all your updates. (If you turn it on.). \n\nIt won't help you this time, but in the future, save your work under a name that has the date  as part of the file name, YYYY-MMDD and save, then \"save as new name\" every half hour or hour.  Use a letter suffix, followed by a number, and change the letter every time you do a major change. \n\nExample:\n\n* Myessay2024-04-17A0.doc\n* Myessay2024-04-17A1.doc\n* Myessay2024-04-17A2.doc\n* Myessay2024-04-17A3.doc\n\nEvery once in a while, print out a physical copy, mark it up with notes, and change the letter then continue. You might make a quick video at the same time, describing the overall progress and what is happening this step. \n\n* Myessay2024-04-17B0.doc\n* Myessay2024-04-17B1.doc\n* Myessay2024-04-17B2.doc\n\nThat way, your entire process has been documented. That will help you in case a teacher falsely accuses you in the future. When you did eight hours work and have literally sixteen progress files and seven videos, it's difficult for a teacher to claim you're cheating. \n\n*****  \n  \n&nbsp;  \n  \n\n\nNow, what to do this time. Since the teacher is using a faulty method to accuse you, you have nothing to lose by challenging them. \n\nShow this comment to your teacher and ask whether they would be amenable to letting you prove how much work you did. Turnitin is not infallible; in fact, it's pretty bad, and obviously worse for repeated submissions. \n\nTell your teacher, quite simply, that they can ask you anything they want about the process you used to write your essay. \n\nIn fact, tell them they can put your essay into an AI model, have it rewrite some SMALL part of the essay, and you will review a printout of the essay and tell the teacher which part wasn't written by you. \n\nBecause if you wrote it, then the wording when rewritten by a chatbot will likely look wrong to you. Just mark up the printed copy with which sentences you wouldn't write like that. \n\nNow, assuming you really did all the work, then you know what examples you picked and why, and you can also talk about what things you thought about putting in but ended up leaving out. \n\nIf the teacher isn't lazy, and does understand the limitations of the technology, then they will let you prove the work you did. \n\nIf not, then you can review the teacher, and you probably also have some recourse in both academia and law. Once again, assuming that you really did the work and have any evidence that a fair teacher would have reviewed and this one unreasonably refused to.  \n\nBest wishes.",
    "can_gild": false,
    "can_mod_post": false,
    "collapsed": false,
    "collapsed_because_crowd_control": null,
    "collapsed_reason": null,
    "collapsed_reason_code": null,
    "comment_type": null,
    "controversiality": 1,
    "created": 1714267166,
    "created_utc": 1714267166,
    "distinguished": null,
    "downs": 0,
    "edited": false,
    "gilded": 0,
    "gildings": {},
    "id": "l1kxcnr",
    "is_submitter": false,
    "likes": null,
    "link_id": "t3_1ceo94d",
    "locked": false,
    "mod_note": null,
    "mod_reason_by": null,
    "mod_reason_title": null,
    "mod_reports": [],
    "name": "t1_l1kxcnr",
    "no_follow": true,
    "num_reports": null,
    "parent_id": "t3_1ceo94d",
    "permalink": "/r/ChatGPT/comments/1ceo94d/failed_class_for_ai_accusation/l1kxcnr/",
    "removal_reason": null,
    "replies": "",
    "report_reasons": null,
    "retrieved_on": 1714267180,
    "saved": false,
    "score": 2,
    "score_hidden": false,
    "send_replies": true,
    "stickied": false,
    "subreddit": "ChatGPT",
    "subreddit_id": "t5_7hqomg",
    "subreddit_name_prefixed": "r/ChatGPT",
    "subreddit_type": "public",
    "top_awarded_type": null,
    "total_awards_received": 0,
    "treatment_tags": [],
    "unrepliable_reason": null,
    "ups": 2,
    "user_reports": []
}