{
    "_meta": {
        "retrieved_2nd_on": 1714593730
    },
    "all_awardings": [],
    "approved_at_utc": null,
    "approved_by": null,
    "archived": false,
    "associated_award": null,
    "author": "Joe4o2",
    "author_flair_background_color": null,
    "author_flair_css_class": null,
    "author_flair_richtext": [],
    "author_flair_template_id": null,
    "author_flair_text": null,
    "author_flair_text_color": null,
    "author_flair_type": "text",
    "author_fullname": "t2_xa2pm",
    "author_is_blocked": false,
    "author_patreon_flair": false,
    "author_premium": false,
    "awarders": [],
    "banned_at_utc": null,
    "banned_by": null,
    "body": "I took two programming classes in college. They were both C++. Actually, they were the exact same class, and I ended up taking it twice. I’ve played with arduino, a little raspberry pi, Python used on the pi, but no truly original projects. Not until ChatGPT. Your video game is probably right on par with my skill levels pre-ChatGPT. \n\nPython is just a coding language. Popular, diverse, powerful, and everywhere. Anyone who says “I’m an expert in Python” knows a lot, and a little. Python is so vast and expanding, no one can know all of it. The people who are best at Python know a few tools, and know them inside and out. But it’s easy to pick up on when you’ve got a goal in mind, and ChatGPT is a great teacher. You just have to be willing to learn, and ask it to teach you. \n\nGoogle apps scripts are fun. Say I have a Google doc, and a Google sheet. My doc is a template of a form I’m sending to my students. I don’t want to type up 30 forms. So I make a Google apps script. It’s a little programming area. I can write a program in there that turns each row into a new doc that’s a filled in version of the template, and save it wherever I want with whatever name I want. \n\nIf Bob, John, Jane, and Karen are in the sheet, it will make 4 new files, name them “Bob’s Letter”, “John’s Letter”, etc, and save them in a folder titled “Letters to Students”. And that’s just some basic stuff. I can make a function that adds a new menu with options to my doc, and run custom programs straight from there! I have one that converts all my student work samples into PDFs, and drops the PDFs into the proper submission folder on Google drive. It does them instantly. That’s 30 less times I have to go into a doc, save as PDF, and upload to a new folder. \n\nI would start on YouTube for both, but especially Google apps scripts. Replicate exactly what someone else does. Then start tweaking it. Make it do something that actually makes your life easier, even if it’s just one thing! Have it add your signature to a page, or fill in data from a Google sheet. Just make it do something.\n\nFor Python, lookup PyCharm. It’s an IDE for Python that I greatly enjoy. Still go to YouTube, but you can also ask ChatGPT how to use it. It’s good at giving directions to follow and helps with troubleshooting. \n\nChatGPT doesn’t always take the most direct paths when programming. I may say, “this program needs to do x, y, and z, but it’s doing x, then z, and. O things happening because it can’t actually do a because it skipped x.” And ChatGPT will say “oh, let’s make it tell you ‘I errored out’ instead of fixing what’s going wrong. You will learn to recognize those moments, and try asking it a different question to get to the answer you need.\n\nI now have my big program in 3 flavors: a demo, my personal version, and a version I use for coworkers (my alpha testers). It’s over 1,000 lines of code, it navigates webpages, converts files, sends emails, takes screenshots, labels things, reads excel sheets, merges screenshots into PDFs, and can pick out what data I want based on the target date range associated with an assignment. It’s a super fancy web scraper, but I couldn’t have done it without ChatGPT. On my own, this would have been a lifetime endeavor. Probably would have had to go back to school to complete it. With ChatGPT, I’ve become a self-taught programmer and gone through several iterations of this project in about a year and a half. And I’ve only had the paid version of ChatGPT for 6 months, I made significant headway with 3.5 before that.\n\nMy experience with AI has been amazing. It’s revolutionized my ability to do my job. I think if everyone got AI working for them the way it’s worked for me, we’d all get a lot more time off, and believe it or not, that’s like my number one priority.",
    "can_gild": false,
    "can_mod_post": false,
    "collapsed": false,
    "collapsed_because_crowd_control": null,
    "collapsed_reason": null,
    "collapsed_reason_code": null,
    "comment_type": null,
    "controversiality": 0,
    "created": 1714464117,
    "created_utc": 1714464117,
    "distinguished": null,
    "downs": 0,
    "edited": false,
    "gilded": 0,
    "gildings": {},
    "id": "l1wsr6h",
    "is_submitter": false,
    "likes": null,
    "link_id": "t3_1cgls4y",
    "locked": false,
    "mod_note": null,
    "mod_reason_by": null,
    "mod_reason_title": null,
    "mod_reports": [],
    "name": "t1_l1wsr6h",
    "no_follow": true,
    "num_reports": null,
    "parent_id": "t1_l1wp75z",
    "permalink": "/r/ChatGPT/comments/1cgls4y/anyone_finding_chatgpt_40_copilot_helpful_for/l1wsr6h/",
    "removal_reason": null,
    "replies": "",
    "report_reasons": null,
    "retrieved_on": 1714464131,
    "saved": false,
    "score": 10,
    "score_hidden": false,
    "send_replies": true,
    "stickied": false,
    "subreddit": "ChatGPT",
    "subreddit_id": "t5_7hqomg",
    "subreddit_name_prefixed": "r/ChatGPT",
    "subreddit_type": "public",
    "top_awarded_type": null,
    "total_awards_received": 0,
    "treatment_tags": [],
    "unrepliable_reason": null,
    "ups": 10,
    "user_reports": []
}