{
    "_meta": {
        "is_edited": true,
        "retrieved_2nd_on": 1714779956
    },
    "all_awardings": [],
    "approved_at_utc": null,
    "approved_by": null,
    "archived": false,
    "associated_award": null,
    "author": "Peruvian_Skies",
    "author_flair_background_color": null,
    "author_flair_css_class": null,
    "author_flair_richtext": [],
    "author_flair_template_id": null,
    "author_flair_text": null,
    "author_flair_text_color": null,
    "author_flair_type": "text",
    "author_fullname": "t2_i0lhuvu5",
    "author_is_blocked": false,
    "author_patreon_flair": false,
    "author_premium": false,
    "awarders": [],
    "banned_at_utc": null,
    "banned_by": null,
    "body": "Intelligence is not consciousness, of course. But let's look at three possible worldviews here.\n\n1) Materialism. Consciousness is a consequence of certain underlying physical processes. Where those processes occur, there will be consciousness. If it arose in animals, there's no reason why it can't arise in machines too. If consciousness exists at all, then a sufficiently powerful AI will be conscious. \n\n2) Pantheism. Reality itself is conscious, individual consciousness relates to that like a drop of water relates to the ocean. Consciousness can attach itself to any system capable of perceiving and interpreting, to the extent in which that system perceives and interprets. If consciousness exists at all, then a sufficiently powerful AI will be conscious.  \n\n3) Schizomysticism. Some things are inherently capable of having consciousness when it's conditions are met, and some are inherently incapable of having consciousness even when those conditions are met. Maybe God personally assigns souls, maybe it's about having a connection to the Source of all life, maybe it's about having more Sacred or more Profane in your body/mind/soul's composition, there are several ways to spin this. In this case, it may be the case that biological systems are fundamentally different from mechanical ones and only the former can be conscious. The problem is that we can't tell. If this is our reality, we have absolutely no idea what the rules are. We can't even detect consciousness in each other - I just assume that you have it like you assume that I have it. Maybe one third of people aren't conscious. Maybe plants are conscious. Maybe iron ore is conscious, but only magnetite, not hematite. AI may or may not achieve consciousness because the rules may or may not prevent mechanical intelligences from having subjective experience. Maybe God will grace certain AIs with a soul like he does babies, maybe he won't. We will never know if AI can be conscious or not.\n\nI can't conceive of a fourth category that simultaneously allows for at least one human to be conscious and categorically forbids all machines from being conscious. Therefore, apart from direct divine revelation, I would never feel confident in saying that AI can't ever be conscious.",
    "can_gild": false,
    "can_mod_post": false,
    "collapsed": false,
    "collapsed_because_crowd_control": null,
    "collapsed_reason": null,
    "collapsed_reason_code": null,
    "comment_type": null,
    "controversiality": 0,
    "created": 1714650349,
    "created_utc": 1714650349,
    "distinguished": null,
    "downs": 0,
    "edited": false,
    "gilded": 0,
    "gildings": {},
    "id": "l28bzwu",
    "is_submitter": false,
    "likes": null,
    "link_id": "t3_1cicgtj",
    "locked": false,
    "mod_note": null,
    "mod_reason_by": null,
    "mod_reason_title": null,
    "mod_reports": [],
    "name": "t1_l28bzwu",
    "no_follow": true,
    "num_reports": null,
    "parent_id": "t3_1cicgtj",
    "permalink": "/r/ChatGPT/comments/1cicgtj/why_ai_let_alone_agi_does_not_exist_and_never/l28bzwu/",
    "removal_reason": null,
    "replies": "",
    "report_reasons": null,
    "retrieved_on": 1714650365,
    "saved": false,
    "score": 1,
    "score_hidden": false,
    "send_replies": true,
    "stickied": false,
    "subreddit": "ChatGPT",
    "subreddit_id": "t5_7hqomg",
    "subreddit_name_prefixed": "r/ChatGPT",
    "subreddit_type": "public",
    "top_awarded_type": null,
    "total_awards_received": 0,
    "treatment_tags": [],
    "unrepliable_reason": null,
    "ups": 1,
    "user_reports": []
}