{
    "_meta": {
        "retrieved_2nd_on": 1715067553
    },
    "all_awardings": [],
    "approved_at_utc": null,
    "approved_by": null,
    "archived": false,
    "associated_award": null,
    "author": "paralog",
    "author_flair_background_color": null,
    "author_flair_css_class": null,
    "author_flair_richtext": [],
    "author_flair_template_id": null,
    "author_flair_text": null,
    "author_flair_text_color": null,
    "author_flair_type": "text",
    "author_fullname": "t2_4tgz0",
    "author_is_blocked": false,
    "author_patreon_flair": false,
    "author_premium": false,
    "awarders": [],
    "banned_at_utc": null,
    "banned_by": null,
    "body": "The promise any artist makes to their audience is \"I have created something that I believe is worth your time.\" Game designers and narrative designers have developed a ton of conventions for communicating \"There is nothing else important to discover here,\" like repeating NPC dialogue and invisible walls. \n\nRemember that the professional and academic work on balancing authored and generative elements in games goes back decades before the availability of conversational AI, and the major problems are still relevant today-- without a thoughtful approach, current technology just allows you to run into those problems faster and at scale. \n\nOne of the biggest issues is the same faced by generated novels: the loss of narrativity, or the sense that what you're reading is actually a story. A player might gleefully engage with your NPCs for a while, but eventually the illusion will fail and the player will realize they're not engaging with any kind of authorial intent. This backlash also hits the actually-authored parts of the story, preventing the player from engaging with any element of the game at all, even compared to the traditional problems you're looking to solve: limited narrative branching, repeated dialogue, and similar experiences across multiple playthroughs. \n\nIt is definitely possible to use AI for NPC dialogue and behavior in interesting ways, as evidenced by Suck Up. The key to that experience landing for the player is that the use of GenAI is disclosed upfront and is clearly necessary to support the narrow (but innovative) gameplay experience. That way, the player never feels like their time is being wasted, as they might in a \"BioWare RPG but AI writes all the dialogue\" approach.\n\nUltimately the most important thing IMO is to clearly communicate which portions of the game's presentation are important to the player's overall engagement with the work (the authored parts) and which parts use AI to help support a believably responsive world (the generated parts). That way the player never feels deceived by the latter, and that negative attitude doesn't get carried over to the former. \n\nI know five paragraphs of a few sentences each are super GPT-coded, but I promise a human person (with a longstanding interest in interactive narrative design) wrote this.",
    "can_gild": false,
    "can_mod_post": false,
    "collapsed": false,
    "collapsed_because_crowd_control": null,
    "collapsed_reason": null,
    "collapsed_reason_code": null,
    "comment_type": null,
    "controversiality": 0,
    "created": 1714937930,
    "created_utc": 1714937930,
    "distinguished": null,
    "downs": 0,
    "edited": false,
    "gilded": 0,
    "gildings": {},
    "id": "l2qa9b6",
    "is_submitter": false,
    "likes": null,
    "link_id": "t3_1cks013",
    "locked": false,
    "mod_note": null,
    "mod_reason_by": null,
    "mod_reason_title": null,
    "mod_reports": [],
    "name": "t1_l2qa9b6",
    "no_follow": true,
    "num_reports": null,
    "parent_id": "t3_1cks013",
    "permalink": "/r/ChatGPT/comments/1cks013/will_you_enjoy_a_game_which_is_a_combination_of/l2qa9b6/",
    "removal_reason": null,
    "replies": "",
    "report_reasons": null,
    "retrieved_on": 1714937944,
    "saved": false,
    "score": 3,
    "score_hidden": false,
    "send_replies": true,
    "stickied": false,
    "subreddit": "ChatGPT",
    "subreddit_id": "t5_7hqomg",
    "subreddit_name_prefixed": "r/ChatGPT",
    "subreddit_type": "public",
    "top_awarded_type": null,
    "total_awards_received": 0,
    "treatment_tags": [],
    "unrepliable_reason": null,
    "ups": 3,
    "user_reports": []
}