{
    "_meta": {
        "is_edited": true,
        "retrieved_2nd_on": 1715090117
    },
    "all_awardings": [],
    "approved_at_utc": null,
    "approved_by": null,
    "archived": false,
    "associated_award": null,
    "author": "Hubbubb22",
    "author_flair_background_color": null,
    "author_flair_css_class": null,
    "author_flair_richtext": [],
    "author_flair_template_id": null,
    "author_flair_text": null,
    "author_flair_text_color": null,
    "author_flair_type": "text",
    "author_fullname": "t2_ij0ur3ox",
    "author_is_blocked": false,
    "author_patreon_flair": false,
    "author_premium": false,
    "awarders": [],
    "banned_at_utc": null,
    "banned_by": null,
    "body": "Your point was that we can both USE the device and simultaneously ACQUIRE critical thinking skills. Your point of comparison was that we use calculators whike also understanding the math underlying the use of said calculators. In fact, that is not the case. Calculators perform both System 1 (rote thinking) and System 2 (more complex tasks). The basic fact is that advanced math skills have been slipping for decades because students DON'T learn more complex systems of thinking. [edit--in fact, math skills have been slipping, math teachers will tell you, because students no longer even learn to perform basic arithmatic computations by rote--and as a consequence they are less prepared when they enter higher level math classes].\n\nIt may be reasonable to argue that allowing the use of devices or AI technology for basic research and gathering of information would be less problematic because we might be able to equate those tasks with system 1 thinking--but one important point made above is that AI often provides objectively wrong information. One must already possess some critical thinking skills to discern the validity of the information provided. Calculators don't fail this basic talk of rote recall/calculation, or even the higher level functions that they can perform.\n\nIn the case of AI one MUST presuppose some critical thinking skills in order to be able to USE the AI. \n\nTo sum,\n1) we cannot both acquire a skill while off-porting that skill to a device. There must be a period of learning when we acquire said skills without any assistive technology.\n\n2) using calculators and AI as a point of comparison is flawed because calculators rarely err in their calculations whereas AI errs regularly enough as took be seriously problematic. One must presuppose the acquisition of critical thinking as a prerequisite to engage with AI. [an aside--one could also presuppose the aquisition of basic gathering and computational skills as well, but that ship sailed in the 1980s.]\n\n3) thus, at this stage it is reasonable to argue for the banning of AI on two grounds... or at the very least presuppose the acquaintance of critical thinking skills prior to its use in a learning environment.",
    "can_gild": false,
    "can_mod_post": false,
    "collapsed": false,
    "collapsed_because_crowd_control": null,
    "collapsed_reason": null,
    "collapsed_reason_code": null,
    "comment_type": null,
    "controversiality": 0,
    "created": 1714960505,
    "created_utc": 1714960505,
    "distinguished": null,
    "downs": 0,
    "edited": false,
    "gilded": 0,
    "gildings": {},
    "id": "l2rtx8w",
    "is_submitter": false,
    "likes": null,
    "link_id": "t3_1ckonsj",
    "locked": false,
    "mod_note": null,
    "mod_reason_by": null,
    "mod_reason_title": null,
    "mod_reports": [],
    "name": "t1_l2rtx8w",
    "no_follow": true,
    "num_reports": null,
    "parent_id": "t1_l2rj89v",
    "permalink": "/r/ChatGPT/comments/1ckonsj/my_essay_being_flagged_as_ai_when_it_is_100_human/l2rtx8w/",
    "removal_reason": null,
    "replies": "",
    "report_reasons": null,
    "retrieved_on": 1714960520,
    "saved": false,
    "score": 1,
    "score_hidden": false,
    "send_replies": true,
    "stickied": false,
    "subreddit": "ChatGPT",
    "subreddit_id": "t5_7hqomg",
    "subreddit_name_prefixed": "r/ChatGPT",
    "subreddit_type": "public",
    "top_awarded_type": null,
    "total_awards_received": 0,
    "treatment_tags": [],
    "unrepliable_reason": null,
    "ups": 1,
    "user_reports": []
}