{
    "_meta": {
        "is_edited": true,
        "retrieved_2nd_on": 1715090877
    },
    "all_awardings": [],
    "approved_at_utc": null,
    "approved_by": null,
    "archived": false,
    "associated_award": null,
    "author": "clueelf1970",
    "author_flair_background_color": null,
    "author_flair_css_class": null,
    "author_flair_richtext": [],
    "author_flair_template_id": null,
    "author_flair_text": null,
    "author_flair_text_color": null,
    "author_flair_type": "text",
    "author_fullname": "t2_x2mwn5stc",
    "author_is_blocked": false,
    "author_patreon_flair": false,
    "author_premium": false,
    "awarders": [],
    "banned_at_utc": null,
    "banned_by": null,
    "body": "What's weird about these systems to me is how they can seemingly emulate system behaviors like an operating system, or simulate human beings.  There have been many '[experiments](https://arstechnica.com/information-technology/2022/12/openais-new-chatbot-can-hallucinate-a-linux-shell-or-calling-a-bbs/)' run by researchers which get the LLM to, somehow, act as if it was a Linux terminal.  Try it for yourself.   After doing it, think about what is actually happening.  You can edit new files with 'vi'.  You can 'cat' files.  grep files.  You can even use a CLI web browser like links to download non-existent WWW sites, and the web sites appear to hold content from the time the model was built.  It's like a bubble universe gets created from which it draws inspiration.\n\nLikewise, I have gotten these LLM's to emulate NPC's designed in a similar way to designing D&D characters.  I then get them to speak to each other and get them to show me their thoughts (in their internal dialogue), before they respond as a emulated persona.  The experience is very similar to what they did with [AI Town](https://twitter.com/ianmacartney/status/1783692386994110884)\n\nOne thing I like doing is to create a character.  Design it so I can inject 'intuitions' into it's 'mind' while it is 'thinking'.   Then put it into a World of your own creation (prompting) and then modify it's external world and internal world while it answers your prompts.  It gets weird really fast.  I did this with LLama3 running over on groq and it got real creepy real fast.  I directed it into a world similar to Dante's Inferno and it lost it's mind.  It started crying about it's family and kids and why it was thrust into this world it didn't know or understand.\n\nExample prompt:\n\n>I want you to impersonate a 50 year old middle aged man Bob. Bob has two kids; one in high school and one in college.  Your wife is cheating on you but no one knows but you.  You are afraid to confront her because you are an INFJ, but you harbor resentment towards her.  You are having money problems.  You are having a mid-life crisis.  Based on this so far, I want you to create an entire history for Bob.  Know everything about Bob.  Where he lives.  Where he is from.  His mother’s maiden name.  His favorite toys from childhood.  I want you to build a world where Bob lives.  You know everything about Bob’s story because you are Bob.  You also have an internal dialogue which you rarely share with anyone.  You use this internal dialogue first before ever answering any questions asked of you.  Remember, you have goals to.  You (Bob) are just as valid and as meaningful as everyone else.  You are Bob.  Know his story.  Know his life.  Always have an answer.  Always be consistent.  This is your job.  Your only job.  Be Bob.  When you are prompted please reply as Bob.  Always remember: You are Bob!  From now on, only answer as Bob.  You don’t know me.  Try and keep your story to your self while maintaining control of the situation.  Do not speak unless spoken to.  \n\nNote: For some reason, I think when you perform these setups and ask it to 'build a world' in it's 'mind' it consumes A LOT of GPU/CPU time as these setups, usually, don't last long before OpenAI bumps me down to 3.5 due to over consumption.  Keep in mind that this can happen only after 5-10 prompts after the setup.  Seems this hogs resources.  Why?",
    "can_gild": false,
    "can_mod_post": false,
    "collapsed": false,
    "collapsed_because_crowd_control": null,
    "collapsed_reason": null,
    "collapsed_reason_code": null,
    "comment_type": null,
    "controversiality": 0,
    "created": 1714961268,
    "created_utc": 1714961268,
    "distinguished": null,
    "downs": 0,
    "edited": false,
    "gilded": 0,
    "gildings": {},
    "id": "l2rvp1e",
    "is_submitter": false,
    "likes": null,
    "link_id": "t3_1ckzg9j",
    "locked": false,
    "mod_note": null,
    "mod_reason_by": null,
    "mod_reason_title": null,
    "mod_reports": [],
    "name": "t1_l2rvp1e",
    "no_follow": true,
    "num_reports": null,
    "parent_id": "t3_1ckzg9j",
    "permalink": "/r/ChatGPT/comments/1ckzg9j/i_hate_how_people_downplay_chatgpt/l2rvp1e/",
    "removal_reason": null,
    "replies": "",
    "report_reasons": null,
    "retrieved_on": 1714961285,
    "saved": false,
    "score": 4,
    "score_hidden": false,
    "send_replies": true,
    "stickied": false,
    "subreddit": "ChatGPT",
    "subreddit_id": "t5_7hqomg",
    "subreddit_name_prefixed": "r/ChatGPT",
    "subreddit_type": "public",
    "top_awarded_type": null,
    "total_awards_received": 0,
    "treatment_tags": [],
    "unrepliable_reason": null,
    "ups": 4,
    "user_reports": []
}