{
    "_meta": {
        "is_edited": true,
        "retrieved_2nd_on": 1715117556
    },
    "all_awardings": [],
    "approved_at_utc": null,
    "approved_by": null,
    "archived": false,
    "associated_award": null,
    "author": "Temporal_Integrity",
    "author_flair_background_color": null,
    "author_flair_css_class": null,
    "author_flair_richtext": [],
    "author_flair_template_id": null,
    "author_flair_text": null,
    "author_flair_text_color": null,
    "author_flair_type": "text",
    "author_fullname": "t2_jr48sifq8",
    "author_is_blocked": false,
    "author_patreon_flair": false,
    "author_premium": false,
    "awarders": [],
    "banned_at_utc": null,
    "banned_by": null,
    "body": "Exactly. Knowing programming language is a tiiiiny part of the job description of a programmer. Say you want a tic tac toe game. Now this is something very easy for an LLM to make, since it's not very novel at all. You can just ask \"please write the code for a tic tac toe game\", and it will do it. However, there aren't a lot of people who are employed to writing tic tac toe games. Most software developers make something new. People think programming languages is an important part of programming, because they're not able to read it. Computer code is nothing more than ridiculously detailed instructions. If these istructions are in python or english doesn't really matter much for the computer. It's going to be reading the code as \"01100011 01101111 01100100 01100101\" anyway.\n\nBut let's say nobody has ever made a tic tac toe game before. \n\nYou have to describe it in ridiculous detail to make sure it turns out exactly how you want it to be. If you want to describe tic tac toe to a human, it's something like \"its a game where players take turns writing X or O in a grid, and then the first one to get three in a row wins\". Now this is pretty much detailed enough for a human. For instance, a human will intuitively assume that you can not write an X in the field where the other player has already written an O. A computer does not assume.\nWhen you're playing with a human, they will also ask questions to clarify. How large should the grid be? Do we count diagonal lines as \"in a row\", or will only a row count? Does columns count? You have to instruct the AI of every concievably scenario to get the exact game you want.  In English, it's something like this:\n\n\n*This will be a player vs player game.* \n\n*The game will be played on a 3x3 grid.*\n\n*Player takes turn marking fields on the grid.*\n\n*Player one will be represented by the symbol X.*  \n\n*Player two will be represented by the symbol O.*\n\n*If X is in a field that is adjacent to two other fields also containing X, this means player one wins.*\n\n*If O is in a field that is adjacent to two other fields containing O, this means player two wins.**\n\n\nThis looks pretty detailed, right? Oh shit, you didn't mention what happens when you run out of spaces in the grid, and there are no winners. Now the game broke. Okay let's try again\n\n*If all fields in the grid has been filled, but there are no winners, display a message saying \"Draw!\" for five seconds, and then restart the game.*\n\n\n Oh but shit the X has the same color as the background, so it's not visible. Should have specified the color!  \nOh no, the O is so small we can not see it. Should have specified the size!",
    "can_gild": false,
    "can_mod_post": false,
    "collapsed": false,
    "collapsed_because_crowd_control": null,
    "collapsed_reason": null,
    "collapsed_reason_code": null,
    "comment_type": null,
    "controversiality": 0,
    "created": 1714987944,
    "created_utc": 1714987944,
    "distinguished": null,
    "downs": 0,
    "edited": false,
    "gilded": 0,
    "gildings": {},
    "id": "l2t2msk",
    "is_submitter": false,
    "likes": null,
    "link_id": "t3_1clbty4",
    "locked": false,
    "mod_note": null,
    "mod_reason_by": null,
    "mod_reason_title": null,
    "mod_reports": [],
    "name": "t1_l2t2msk",
    "no_follow": true,
    "num_reports": null,
    "parent_id": "t1_l2ssgmo",
    "permalink": "/r/ChatGPT/comments/1clbty4/is_ai_going_to_replace_coders_and_programmers/l2t2msk/",
    "removal_reason": null,
    "replies": "",
    "report_reasons": null,
    "retrieved_on": 1714987959,
    "saved": false,
    "score": 1,
    "score_hidden": false,
    "send_replies": true,
    "stickied": false,
    "subreddit": "ChatGPT",
    "subreddit_id": "t5_7hqomg",
    "subreddit_name_prefixed": "r/ChatGPT",
    "subreddit_type": "public",
    "top_awarded_type": null,
    "total_awards_received": 0,
    "treatment_tags": [],
    "unrepliable_reason": null,
    "ups": 1,
    "user_reports": []
}