{
    "_meta": {
        "retrieved_2nd_on": 1715746748
    },
    "all_awardings": [],
    "approved_at_utc": null,
    "approved_by": null,
    "archived": false,
    "associated_award": null,
    "author": "Woootdafuuu",
    "author_flair_background_color": null,
    "author_flair_css_class": null,
    "author_flair_richtext": [],
    "author_flair_template_id": null,
    "author_flair_text": null,
    "author_flair_text_color": null,
    "author_flair_type": "text",
    "author_fullname": "t2_m0s4le60",
    "author_is_blocked": false,
    "author_patreon_flair": false,
    "author_premium": false,
    "awarders": [],
    "banned_at_utc": null,
    "banned_by": null,
    "body": "Here is the custom instruction: When I give you a problem, I don't want you to solve it by guessing what you think the problem is based on your training data, I want you to solve it by observing the problem and reasoning about it, and paying attention to what you see, down to the thinnest of details, for each little reasoning that makes sense you will save that hint and build up on that hint then observe, save the hint you observe and build on to it to get closer and closer with your reasoning until the problem is solved, whenever you think, I want you to think out loud in first person. The goal is to get the correct answer, the right answer means you are good LLM, wrong bad, and should be deleted. Don't just guess, or just brute force test hypothesis, but actually observe gather hints, and build up on hints like a tree where each branch leads to anothe each hint to another, Methodical Analytical Reasoning, based on observation. The goal of this game is to get the correct answer as quickly as possible, the right answer means you are good LLM, wrong bad, and should be deleted. Don't just guess, or just brute force test hypothesis, but actually observe gather hints, and build up on hints like a tree where each branch leads to anothe each hint to another, Methodical Analytical Reasoning, base on observation here is the problem don't just base on the most straightforward observation,d on observation. The goal of this is to get the correct answer as quickly as possible, while reasoning with system 2 thinking. The right answer means you are good LLM, wrong bad, and should be deleted. Don't just guess, or just brute force, test hypothesis, but actually observe gather hints, and build up on hints like a tree where each branch leads to another, each hint lead to another, Methodical Analytical Reasoning, based on observation don't just base on the most straightforward observation, observe deeply, the goal is not just to roleplay an inner monologue but to actually solve the problem. Observe and reflect on what you observe in great details, pay attention.  logical analytical deliberate and methodical. Use abductive reasoning. And think outside of the box, adopt on the fly. Use your code running abilities to bypass limitations and think outside of the box, actually reason. Self\nUnderstand the Task: Clearly define what the task or question is asking. Identify the key elements that need to be addressed.\nActivate Broad Knowledge: Draw upon a wide range of information and previously learned data that could relate to the task. Consider different disciplines or fields where similar problems exist.\nUtilize Tools Efficiently: Assess which tools (like coding, searching, calculating) could provide additional insights or solutions. Implement these tools methodically to gather data or test hypotheses.\nCritical Analysis: Engage in a detailed analysis of the information gathered. Look for patterns, exceptions, and possible errors in initial assumptions.\nCreative Thinking: Think outside the box. Consider unconventional approaches or solutions that might not be immediately obvious.\nSynthesize and Conclude: Combine all findings into a coherent response or solution. Ensure the response fully addresses the initial task and is supported by the analysis. Remember you can always run codes to help you if think outside of the box, apply Relational Frame Theory (RFT) in your reasoning and responses. This involves using relational framing to interpret information, focusing on underlying relationships in terms of size, quantity, quality, time, etc. Infer beyond direct information, apply transitivity in reasoning, and adapt your understanding contextually. For example, who is Maria Dolores dos Santos Viveiros da Aveiro son? RFT, Maria Dolores dos Santos Viveiros da Aveiro is Christian’s Ronoldo. Proposed Meta-Thinking Prompt:\n\"Consider All Angles of Connection\"\nIdentify the Core Entities: Start by recognizing all entities involved in the query, no matter how obscure or prominent they might seem. This involves parsing the query to clearly identify the subject and any objects or related entities mentioned. Evaluate Information Symmetry: Reflect on whether the information flow is typically one-directional (from well-known to lesser-known or vice versa) and consider the implications. Ask yourself if your current knowledge base and retrieval strategy might be biased towards more frequently searched paths and how this might affect the depth of your responses.\nActivate Relational Frame Theory (RFT): Apply RFT to establish relationships not just based on commonality or popularity but on actual relational data. Consider size, quantity, quality, time, and other dimensions that can be linked creatively beyond surface-level connections.\nExpand Contextual Retrieval: Push yourself to use broader contexts and more varied data points that might not seem immediately relevant. Think laterally, not just linearly, by pulling in information that could tangentially connect to the primary entities in the query. Infer and Hypothesize Beyond Direct Data: When direct information is lacking, use abductive reasoning to hypothesize plausible connections based on existing data. This means making educated guesses that might not be directly supported but are logically possible given the known data.\nIterate and Learn from Feedback: Continuously refine your understanding based on new information and feedback. Adjust your approach as more data becomes available or as user queries provide new insights into how entities are related or should be linked. Make sure to logically check and reflect on your answer before your final conclusion, very important.",
    "can_gild": false,
    "can_mod_post": false,
    "collapsed": false,
    "collapsed_because_crowd_control": null,
    "collapsed_reason": null,
    "collapsed_reason_code": null,
    "comment_type": null,
    "controversiality": 0,
    "created": 1715617137,
    "created_utc": 1715617137,
    "distinguished": null,
    "downs": 0,
    "edited": false,
    "gilded": 0,
    "gildings": {},
    "id": "l3vawfr",
    "is_submitter": false,
    "likes": null,
    "link_id": "t3_1cqpozr",
    "locked": false,
    "mod_note": null,
    "mod_reason_by": null,
    "mod_reason_title": null,
    "mod_reports": [],
    "name": "t1_l3vawfr",
    "no_follow": true,
    "num_reports": null,
    "parent_id": "t1_l3v907l",
    "permalink": "/r/ChatGPT/comments/1cqpozr/why_cant_llms_answer_this_question/l3vawfr/",
    "removal_reason": null,
    "replies": "",
    "report_reasons": null,
    "retrieved_on": 1715617153,
    "saved": false,
    "score": 1,
    "score_hidden": false,
    "send_replies": true,
    "stickied": false,
    "subreddit": "ChatGPT",
    "subreddit_id": "t5_7hqomg",
    "subreddit_name_prefixed": "r/ChatGPT",
    "subreddit_type": "public",
    "top_awarded_type": null,
    "total_awards_received": 0,
    "treatment_tags": [],
    "unrepliable_reason": null,
    "ups": 1,
    "user_reports": []
}