{
    "_meta": {
        "retrieved_2nd_on": 1715793567
    },
    "all_awardings": [],
    "approved_at_utc": null,
    "approved_by": null,
    "archived": false,
    "associated_award": null,
    "author": "indiegameplus",
    "author_flair_background_color": null,
    "author_flair_css_class": null,
    "author_flair_richtext": [],
    "author_flair_template_id": null,
    "author_flair_text": null,
    "author_flair_text_color": null,
    "author_flair_type": "text",
    "author_fullname": "t2_mncub",
    "author_is_blocked": false,
    "author_patreon_flair": false,
    "author_premium": false,
    "awarders": [],
    "banned_at_utc": null,
    "banned_by": null,
    "body": "Hey there! This may fulfil what you're looking for, I made a custom gpt a while back called Infinite Quests kinda based on this concept. The url for it is \"https://chatgpt.com/g/g-ekMDjW4nG-infinite-quests\". Essentially, you can make it randomly generate you a backstory, character name and info, location, setting, anything you want really, and then it will start you off and give you 4 options each move, or if none of them suit what you want to do, you can give your own prompt instead and it will continue on the story. Each turn ends with your health status and money and mood, and it's highly adaptable for different genres. I personally really dig it for crafting realistic grounded character studies, say a person struggling with addiction issues or in a rough spot, finding their way out by making the right decisions, hanging out with their friends and family, getting different careers. With the launch of GPT 4-O today I was having an absolute blast just talking to it, and playing through a different story, here's an example snippet for you.\n\nMe: Give me a completely randomized scenario and character. I want it to be in 2020, actually sorry, set in 2023, do it in Los Angeles, and make my character in the early 20s. Add in a part about a drug problem, and give me some information about my friends, family, potential love interests, and then we will start our adventure. Just say where I am, how much money I have, what area I'm living in, and then just, yeah, I wake up in the morning, and then just tell me, just say, put us in a situation, and then say, give me four options as we've discussed, and then I can either choose one of them, or I can give you my own custom option, we'll go from there.\n\nChatGPT: **Title: Shadows of Sunset**\n\n**Setting: Los Angeles, 2023**\n\n**Character Profile:**\n- **Name:** Jamie\n- **Age:** 22\n- **Background:** Born and raised in the heart of Los Angeles. Jamie attended a local community college but dropped out due to struggles with a developing drug problem, specifically with painkillers after a minor car accident last year.\n- **Family:** Lives with an older sibling, Alex, who is often busy with work. Parents live in San Diego and are supportive but somewhat distant. \n- **Friends:** Jamie has a close-knit group including:\n  - **Max:** A childhood friend who shares a passion for music and has his own battles with substance abuse.\n  - **Lila:** An ambitious film student, often the voice of reason in the group.\n- **Love Interest:** Recently, Jamie has grown closer to Chris, a bartender at a local dive bar. Chris is charming but mysterious and seems to have a complicated past.\n\n**Current Situation:**\nYou wake up in your modest apartment in Koreatown, sunlight filtering through thin curtains. The sounds of the bustling city start to permeate the walls. It's a new day, and despite the challenges, there's a buzz of potential in the air.\n\n- **Health:** Moderate (recovering from last night's indulgence)\n- **Cash:** $120\n- **Mood:** Anxious but hopeful\n\nYou roll out of bed, feeling the remnants of last night's choices weighing on your body and mind. You remember you have a job interview at a local bookstore in a few hours.\n\n**Immediate Choices:**\n1. **Prepare for the interview:** Take a shower, get dressed in your best, albeit slightly worn, outfit, and review common interview questions.\n2. **Blow off the interview:** Call Max to see if he wants to hang out instead. Maybe a day off could help you destress.\n3. **Visit Chris at the bar:** It's early, but Chris’s bar opens for the lunch crowd, and you could use some friendly conversation.\n4. **Go for a walk in your neighborhood:** Clear your head and plan your next steps carefully.\n\nChoose an option, or suggest your own course of action!\n\nHope this kinda scratches ur itch for that type of game, feel free to give it a go! But totally get it if you don't vibe with it!",
    "can_gild": false,
    "can_mod_post": false,
    "collapsed": false,
    "collapsed_because_crowd_control": null,
    "collapsed_reason": null,
    "collapsed_reason_code": null,
    "comment_type": null,
    "controversiality": 0,
    "created": 1715663961,
    "created_utc": 1715663961,
    "distinguished": null,
    "downs": 0,
    "edited": false,
    "gilded": 0,
    "gildings": {},
    "id": "l3yn9wc",
    "is_submitter": false,
    "likes": null,
    "link_id": "t3_1crjzw0",
    "locked": false,
    "mod_note": null,
    "mod_reason_by": null,
    "mod_reason_title": null,
    "mod_reports": [],
    "name": "t1_l3yn9wc",
    "no_follow": true,
    "num_reports": null,
    "parent_id": "t3_1crjzw0",
    "permalink": "/r/ChatGPT/comments/1crjzw0/ai_roleplaying_campaign/l3yn9wc/",
    "removal_reason": null,
    "replies": "",
    "report_reasons": null,
    "retrieved_on": 1715663975,
    "saved": false,
    "score": 2,
    "score_hidden": false,
    "send_replies": true,
    "stickied": false,
    "subreddit": "ChatGPT",
    "subreddit_id": "t5_7hqomg",
    "subreddit_name_prefixed": "r/ChatGPT",
    "subreddit_type": "public",
    "top_awarded_type": null,
    "total_awards_received": 0,
    "treatment_tags": [],
    "unrepliable_reason": null,
    "ups": 2,
    "user_reports": []
}