{
    "_meta": {
        "retrieved_2nd_on": 1715852438
    },
    "all_awardings": [],
    "approved_at_utc": null,
    "approved_by": null,
    "archived": false,
    "associated_award": null,
    "author": "uno_in_particolare",
    "author_flair_background_color": null,
    "author_flair_css_class": null,
    "author_flair_richtext": [],
    "author_flair_template_id": null,
    "author_flair_text": null,
    "author_flair_text_color": null,
    "author_flair_type": "text",
    "author_fullname": "t2_10460f",
    "author_is_blocked": false,
    "author_patreon_flair": false,
    "author_premium": false,
    "awarders": [],
    "banned_at_utc": null,
    "banned_by": null,
    "body": ">1. Language Learning\n\n>Duolingo Stock fell by $65 in the last 5 days. That should tell you the entire story.  \n  \n\n  \nAren't you just disproving your own point? \n\nIf the stock is falling for 5 days, that means it was doing so before gpt4o's reveal - not everything rotates around gpt. If I had to guess, it's more likely linked to the fuss about the features removed from duolingo premium and moved to the struggling and expensive ai subscription\n\n  \nIn general, I don't see how they are competitors. Duolingo is about learning a language, and build a habit out of learning. Chatgpt can't help much in that, or at least not in any more than it helps learning in general, as you mention in one of your other points\n\n>  \nFor context, Duolingo is a language-learning app. Now GPT-4o can easily translate terms in other languages by just pointing it to the ChatGPT's Camera.\n\n>This is massive if you want to travel globally as a nomad. You don't have to know a language now. You can just translate on the fly in any random country.\n\nThat's.... literally google lens, and it's been out forever. It's really impressive compared to what we had like 10y ago, but it's not exactly news.\n\nFurthermore, I don't see this as an area where a statistical model like gpt can shine. This problem is OCR (recognizing text from a picture) and translation. Both are already working quite well as evidenced by, again, lens.\n\nI think both aspects can be improved on, but I don't see any game changer - it's already working quite well, it's just optimizing now\n\n>2. Solving School Problems For Students\n\n>I wish I had this in school. Learning could've been more efficient and faster.\n\n>Most students fear asking questions because they feel it might be dumb. Now you can ask ChatGPT any dumb question.\n\n\n\nAgreed, GPT is great for learning, so long as you treat everything it says with an ocean of salt. Still, I do think this is one of the use cases where GPT really shines - interactive learning\n\n  \nI don't believe in replaces khan academy, courses or lectures in any way though. It's best suited to reason about stuff and ask questions on what you don't understand or to confirm you do\n\n  \nIn any case, this hasn't changed at all with the recent update, everything I said applies to GPT 3.5 too\n\n>3. Bed Time Stories For Kids3. Bed Time Stories For Kids\n\n  \nHonestly feels really... wrong. Either read it for them, or an audiobook already solved the issue. I wouldn't try to put my voice in a toy.\n\nIt is great that the robotic voice sounds better than what we're used to, though\n\n\n\n>4. Be My Eyes For The Blind\n\n  \nNot sure I understand what you mean, but sure - it can surely help people with disabilities\n\nStill, we're talking about \"potential\", the current GPT is not really up to par\n\n>5. Be My Friend\n\n  \nDystopic as hell, and IMO very dangerous\n\n\n\nI won't go covering the other half of the points as this reply is already massive, but in generaly I feel like you're severely, and I mean by a looooot, overestimating what current GPT can do. More like gpt8-o.\n\n But even then, even considering future potential, some stuff I really don't see happening with a LLM, and some stuff \\*can\\* happen  but probably shouldn't",
    "can_gild": false,
    "can_mod_post": false,
    "collapsed": false,
    "collapsed_because_crowd_control": null,
    "collapsed_reason": null,
    "collapsed_reason_code": null,
    "comment_type": null,
    "controversiality": 0,
    "created": 1715722817,
    "created_utc": 1715722817,
    "distinguished": null,
    "downs": 0,
    "edited": false,
    "gilded": 0,
    "gildings": {},
    "id": "l42d3er",
    "is_submitter": false,
    "likes": null,
    "link_id": "t3_1crtfv2",
    "locked": false,
    "mod_note": null,
    "mod_reason_by": null,
    "mod_reason_title": null,
    "mod_reports": [],
    "name": "t1_l42d3er",
    "no_follow": true,
    "num_reports": null,
    "parent_id": "t3_1crtfv2",
    "permalink": "/r/ChatGPT/comments/1crtfv2/9_use_cases_for_gpt4o/l42d3er/",
    "removal_reason": null,
    "replies": "",
    "report_reasons": null,
    "retrieved_on": 1715722834,
    "saved": false,
    "score": 2,
    "score_hidden": false,
    "send_replies": true,
    "stickied": false,
    "subreddit": "ChatGPT",
    "subreddit_id": "t5_7hqomg",
    "subreddit_name_prefixed": "r/ChatGPT",
    "subreddit_type": "public",
    "top_awarded_type": null,
    "total_awards_received": 0,
    "treatment_tags": [],
    "unrepliable_reason": null,
    "ups": 2,
    "user_reports": []
}