{
    "_meta": {
        "is_edited": true,
        "retrieved_2nd_on": 1715896748
    },
    "all_awardings": [],
    "approved_at_utc": null,
    "approved_by": null,
    "archived": false,
    "associated_award": null,
    "author": "WhoDisagrees",
    "author_flair_background_color": null,
    "author_flair_css_class": null,
    "author_flair_richtext": [],
    "author_flair_template_id": null,
    "author_flair_text": null,
    "author_flair_text_color": null,
    "author_flair_type": "text",
    "author_fullname": "t2_cgnl2fec1",
    "author_is_blocked": false,
    "author_patreon_flair": false,
    "author_premium": false,
    "awarders": [],
    "banned_at_utc": null,
    "banned_by": null,
    "body": "I think its really cool, I bought pro and I can't make it do anything hugely useful for me. \n\nI don't write trash web spam text. I don't do webdesign or computer science. I do, occaisionally some stats and R and I have found chatGPT moderately usefull with this, but since its data for publication I would never let a lying bastard language model remotely near my data unsupervised. So moderately useful in writing R scripts, but I know what I'm doing anyway and the operations I need it to do are quite simple. Sometimes if I don't know an excel function i ask, but 50% of the time it doesn't know because I don't know the name of a function, just its intended purpose and the model doesn't get it. \n\nI have had some success using in for writing grants etc, not for writing them but for giving a basic structure, for example \"summarise this text in 500 words\" and I put in a 3k proposal, it writes like a dumb teenager but then it is quicker for me to go through and edit it. If you ask it for the sequence of a gene, it makes up a fake sequence instead of telling me it can't. If I ask it to draw a biologically accurate nematode, it gives it wings and a tongue. If I ask it about something which isn't well studied, it lies, says it is and answers about something adjactent like a teenager bluffing a teacher that they did the reading. \n\nI'm hoping the real time translation is good, I'll try using that when my wifes mother who doesnt speak english comes to stay this year, and I'll get a GPT which just translates whatever is said without prompting. Maybe I can pair it with noise cancelling headphones and a speaker for when shes out and about.\n\nBut for me, in biology (non-bioinformatics) it is basically a cool toy at this point. It can't paint my fence, or clean my home, or make my coffee (any better than a timer), or usefully buy my shopping, or interact with my data in a way which is useful, it can read the literature (the scientist GPT) but it simply repeats the abstract without any serious insight. It cannot read NGS datasets without being spoonfed them, and it definately cannot generate hypotheses which don't suck when presented with data. \n\nProbably the best thing I had it do was make some scenes from stories I told my daughter, she loves some of the drawings DALLE comes up with. \n\nIt seems like it is a godsend for people writing spam emails and buzzfeed level trash web content. Probably great for coding, or for doing a lame office job to the standard of an 18 year old outsourced indian remote worker. But it feels as wide as the ocean and as deep as a puddle. \n\nI am still in awe of how far we have come, but I feel like the real world changing models and applications are yet to come. If anyone thinks they can build this, I suggest somehow downloading all of the NGS datasets of RNAseq and variants and proteomics that you can get your hands on and training a model to understand what is what and how to interact with they, and then output representations of data to the user based on the cumulative data, with an understanding of what each set is and sources to demonstrate this is not a hallucination.",
    "can_gild": false,
    "can_mod_post": false,
    "collapsed": false,
    "collapsed_because_crowd_control": null,
    "collapsed_reason": null,
    "collapsed_reason_code": null,
    "comment_type": null,
    "controversiality": 0,
    "created": 1715766657,
    "created_utc": 1715766657,
    "distinguished": null,
    "downs": 0,
    "edited": false,
    "gilded": 0,
    "gildings": {},
    "id": "l44tujq",
    "is_submitter": false,
    "likes": null,
    "link_id": "t3_1csdsfg",
    "locked": false,
    "mod_note": null,
    "mod_reason_by": null,
    "mod_reason_title": null,
    "mod_reports": [],
    "name": "t1_l44tujq",
    "no_follow": true,
    "num_reports": null,
    "parent_id": "t3_1csdsfg",
    "permalink": "/r/ChatGPT/comments/1csdsfg/chatgpt_is_the_most_amazing_invention_and_i_cant/l44tujq/",
    "removal_reason": null,
    "replies": "",
    "report_reasons": null,
    "retrieved_on": 1715766675,
    "saved": false,
    "score": 26,
    "score_hidden": false,
    "send_replies": true,
    "stickied": false,
    "subreddit": "ChatGPT",
    "subreddit_id": "t5_7hqomg",
    "subreddit_name_prefixed": "r/ChatGPT",
    "subreddit_type": "public",
    "top_awarded_type": null,
    "total_awards_received": 0,
    "treatment_tags": [],
    "unrepliable_reason": null,
    "ups": 26,
    "user_reports": []
}