{
    "_meta": {
        "retrieved_2nd_on": 1715912355
    },
    "all_awardings": [],
    "approved_at_utc": null,
    "approved_by": null,
    "archived": false,
    "associated_award": null,
    "author": "readparse",
    "author_flair_background_color": null,
    "author_flair_css_class": null,
    "author_flair_richtext": [],
    "author_flair_template_id": null,
    "author_flair_text": null,
    "author_flair_text_color": null,
    "author_flair_type": "text",
    "author_fullname": "t2_8gu8g",
    "author_is_blocked": false,
    "author_patreon_flair": false,
    "author_premium": false,
    "awarders": [],
    "banned_at_utc": null,
    "banned_by": null,
    "body": "I agree with you, except that I understand why so many people don't use it.  I'll come back to that.\n\nI'm a highly technical IT guy who has to move around between programming, system administration, complex cloud architectures, network troubleshooting, analysis, project management, documentation, etc.\n\nI can do everythingi I do without ChatGPT, but it's become a tool that I prefer to use for an increasing number of things.   I seldom ask it to create complete solutions for me, but i'm constantly using it, in much the same way that I've been using Google for so many years.\n\nGoogle is indispensable, of course.  You really can't do what I do without it (or some equivalent, like Bing or DuckDuckGo or whatever).\n\nAs people here know, the current challenge with ChatGPT is figuring out how to use it.  What it's good at, what lies it tells, and just remembering to bring it in to help with certain kinds of problems.  It's such a new tool, and such a general tool, that there are many times when it doesn't occur to me to use it as soon as I could.\n\nSo why do people not use it?  Partially for the same reason that some people are better at Googling than others are.  Some people struggle to put themselves in the mindset of a search engine and to think about how to best to refine queries.\n\nThe same is true for AI, but it's a bigger problem, because even experienced researchers are just learning how to use this tool.\n\nThe other reason is the controversy.   It's one thing to not know how to use a tool.  It's another to fear the tool, or to fear big companies and governments and how they will use the information you share with AI.    And as if that wasn't enough, there are people who refuse to use it because they feel like doing so will quicken the inevitable phasing out of their job.  \n\nFor example, I have a sister who is a graphic designer for the film industry.   This means she does a lot of graphic design work that just has to look good enough to be shot as part of a film or TV show.   Some of those items have to look perfect, and others are barely seen at all.    This is a perfect opportunity to use AI, except she's in a union that is staunchly opposed to using AI for anything at all, because the union itself sees it as a threat to their jobs.   I see it in the same way I see using AI for programming tasks.  It can make me faster and better, and can help me avoid overly monotonous tasks, so I can focus on harder tasks and increase my output.   This makes me more valuable.\n\nDoes it present the opportunity to need fewer IT people in the future?  Yes it does.  So I get why people are worried about it.   But in every industry, the smartest people in that industry are embracing this technology to see how it can help them be better.  And if it also thins out the herd of less skilled people in our professionals, all the better.",
    "can_gild": false,
    "can_mod_post": false,
    "collapsed": false,
    "collapsed_because_crowd_control": null,
    "collapsed_reason": null,
    "collapsed_reason_code": null,
    "comment_type": null,
    "controversiality": 0,
    "created": 1715782747,
    "created_utc": 1715782747,
    "distinguished": null,
    "downs": 0,
    "edited": false,
    "gilded": 0,
    "gildings": {},
    "id": "l45rmid",
    "is_submitter": false,
    "likes": null,
    "link_id": "t3_1csdsfg",
    "locked": false,
    "mod_note": null,
    "mod_reason_by": null,
    "mod_reason_title": null,
    "mod_reports": [],
    "name": "t1_l45rmid",
    "no_follow": true,
    "num_reports": null,
    "parent_id": "t3_1csdsfg",
    "permalink": "/r/ChatGPT/comments/1csdsfg/chatgpt_is_the_most_amazing_invention_and_i_cant/l45rmid/",
    "removal_reason": null,
    "replies": "",
    "report_reasons": null,
    "retrieved_on": 1715782764,
    "saved": false,
    "score": 1,
    "score_hidden": false,
    "send_replies": true,
    "stickied": false,
    "subreddit": "ChatGPT",
    "subreddit_id": "t5_7hqomg",
    "subreddit_name_prefixed": "r/ChatGPT",
    "subreddit_type": "public",
    "top_awarded_type": null,
    "total_awards_received": 0,
    "treatment_tags": [],
    "unrepliable_reason": null,
    "ups": 1,
    "user_reports": []
}