{
    "_meta": {
        "is_edited": true,
        "retrieved_2nd_on": 1715966380
    },
    "all_awardings": [],
    "approved_at_utc": null,
    "approved_by": null,
    "archived": false,
    "associated_award": null,
    "author": "altered_state",
    "author_flair_background_color": null,
    "author_flair_css_class": null,
    "author_flair_richtext": [],
    "author_flair_template_id": null,
    "author_flair_text": null,
    "author_flair_text_color": null,
    "author_flair_type": "text",
    "author_fullname": "t2_9gu1k",
    "author_is_blocked": false,
    "author_patreon_flair": false,
    "author_premium": false,
    "awarders": [],
    "banned_at_utc": null,
    "banned_by": null,
    "body": "Download Obsidian, if you aren’t using it already.\n\nImport anything you’ve ever written from Apple Notes, Evernote, Notion, OneNote, Logseq, and more. In my case, I imported 16 years of near-daily journaling from Apple Notes (2.4k notes, 2.6 million words, in my case).\n\nDownload Obsidian’s Copilot plugin.\n\nGenerate and paste your OpenAI API key into Copilot’s settings.\n\nPlay around with a few parameters; consider setting context window to max if you’re already well-organized.\n\nSet chat mode to Vault QA.\n\nBegin asking questions about your past self for serious introspection to enhance your IRL therapy sessions (my elderly therapist couldn’t comprehend what I had running on my laptop when I first asked *her* to ask *me* questions about *my past self*), or to connect disparate business ideas you’ve had over the past decade if you’re an entrepreneur to come up with novel ideas — currently working on a new business, in my case, relating to the intersection of ML and my old degree in biochem).\n\nBe mindful of your API prompt costs. After your first prompt and response, check your OAI usage dashboard before proceeding with more prompts. You might have to tune a few parameters in Copilot to prevent spending $0.38 per query, in my case when I first tried it.\n\nThat’s it! And that’s just for my current use case. I’ve been running Ollama locally for complete data privacy but that requires a bit more work to get up and running. Copilot supports other models like Claude 3 as well.\n\nHope this sparks some ingenuity for potential use cases on your end. Lord knows I haven’t even begun to explore 1% of what my PC is actually capable of handling — family health issues have taken priority. That said, although ChatGPT has remained a weak AI therapist at the moment, it has enhanced my monthly visits with my actual therapist hundredfold. I’m a SWE but **this** was the most impactful use case for me, by a mile. Chatting with my past self is something I’ve never dreamed of in my lifetime. YMMV of course, especially if you don’t journal or perform any sort of stream-of-consciousness writing whatsoever. If anything, I’d say that this tech should persuade those on the fence of journaling to actually put pen to (digital) paper! Everything can be run locally and entirely offline. Write down your deepest, darkest thoughts, and let machine learning do the rest of the work for you.",
    "can_gild": false,
    "can_mod_post": false,
    "collapsed": false,
    "collapsed_because_crowd_control": null,
    "collapsed_reason": null,
    "collapsed_reason_code": null,
    "comment_type": null,
    "controversiality": 0,
    "created": 1715836770,
    "created_utc": 1715836770,
    "distinguished": null,
    "downs": 0,
    "edited": false,
    "gilded": 0,
    "gildings": {},
    "id": "l49mjet",
    "is_submitter": false,
    "likes": null,
    "link_id": "t3_1csdsfg",
    "locked": false,
    "mod_note": null,
    "mod_reason_by": null,
    "mod_reason_title": null,
    "mod_reports": [],
    "name": "t1_l49mjet",
    "no_follow": true,
    "num_reports": null,
    "parent_id": "t1_l45affi",
    "permalink": "/r/ChatGPT/comments/1csdsfg/chatgpt_is_the_most_amazing_invention_and_i_cant/l49mjet/",
    "removal_reason": null,
    "replies": "",
    "report_reasons": null,
    "retrieved_on": 1715836785,
    "saved": false,
    "score": 2,
    "score_hidden": false,
    "send_replies": true,
    "stickied": false,
    "subreddit": "ChatGPT",
    "subreddit_id": "t5_7hqomg",
    "subreddit_name_prefixed": "r/ChatGPT",
    "subreddit_type": "public",
    "top_awarded_type": null,
    "total_awards_received": 0,
    "treatment_tags": [],
    "unrepliable_reason": null,
    "ups": 2,
    "user_reports": []
}