{
    "_meta": {
        "is_edited": true,
        "retrieved_2nd_on": 1716089583
    },
    "all_awardings": [],
    "approved_at_utc": null,
    "approved_by": null,
    "archived": false,
    "associated_award": null,
    "author": "Culinaire_Life",
    "author_flair_background_color": null,
    "author_flair_css_class": null,
    "author_flair_richtext": [],
    "author_flair_template_id": null,
    "author_flair_text": null,
    "author_flair_text_color": null,
    "author_flair_type": "text",
    "author_fullname": "t2_pq07kfpr5",
    "author_is_blocked": false,
    "author_patreon_flair": false,
    "author_premium": false,
    "awarders": [],
    "banned_at_utc": null,
    "banned_by": null,
    "body": "I want to believe...but...I have seen too much of humanity sadly :(\n\nI lived through the mass adoption of the Internet with smart phones. When I first discovered the Internet as a young kid it changed my life in so many amazing ways I can't even count them. I was able to make friends, fall in love, learn all kinds of skills, even start a couple businesses as a kid. It all seemed so amazing and yet it was quite secretive. It was predominantly tech professionals or just professionals who had to get on it for work, but that narrowness provided this amazing connectivity and genuine connection.\n\nI even remember meeting someone who showed me how to use AdSense as arbitrage to make a few bucks generating crappy content like recipes and reposting them all over and stuff. I distinctly remember thinking \"this is pretty stupid\" and I didn't even consider that the ultra amazing life-changing Internet I found that was filled with genuine people all over who provided help and community, a force that allowed you to learn practically anything, connect to real people, etc... would be discarded in favor of the dumb shitty thing my friend showed me. Now the internet is a hollow shell of what it was when I first discovered it. And they're only trying to make it even worse.\n\nSo I have seen the cycle sadly. I know that for a little while the AI chatbots are going to seem super cool and awesome and make a few people rich. But when society at large adopts them, like the Internet, it will be the absolute worst version you can imagine. And the absolute worst version I can imagine with the new AI chatbots is so horrific I am seriously contemplating suicide in the next 5-10 years unless I see governments begin to step in and regulate things in a very serious way.\n\nIt's fascinating and horrific to have witnessed the world go this way. I recall the whole Y2K scare and I was so unworried about it that I constantly explained to my friends and parents reasons why it was going to be nothing. What grounded me against the scary news as a little kid? All of my friends working as Sys admins I would meet in different cities around the country on my hokie family RV summer camping trips thanks to the Internet. I could see how sincere, hard-working, and masterful all of these people I personally knew where; there was simply no way people like that were going to let something like the Y2K bug actually harm anyone. Fast-forward to today and I don't feel like that at all. Now, I feel like the people running things would try to cash in on the Y2K crisis and get rich with a bunch of AI-generated fake solutions that made us feel safe just long enough until the billionaires absconded and we all died in some horrific agony...\n\nI am not suicidal, but the world I am seeing being built scares me more than death, so at some point if my predictions keep coming true, a bullet is going to be the vastly more logical choice than remaining alive in this hellscape.",
    "can_gild": false,
    "can_mod_post": false,
    "collapsed": false,
    "collapsed_because_crowd_control": null,
    "collapsed_reason": null,
    "collapsed_reason_code": null,
    "comment_type": null,
    "controversiality": 0,
    "created": 1715959972,
    "created_utc": 1715959972,
    "distinguished": null,
    "downs": 0,
    "edited": false,
    "gilded": 0,
    "gildings": {},
    "id": "l4gvqrl",
    "is_submitter": false,
    "likes": null,
    "link_id": "t3_1ctn9il",
    "locked": false,
    "mod_note": null,
    "mod_reason_by": null,
    "mod_reason_title": null,
    "mod_reports": [],
    "name": "t1_l4gvqrl",
    "no_follow": true,
    "num_reports": null,
    "parent_id": "t1_l4gon6x",
    "permalink": "/r/ChatGPT/comments/1ctn9il/what_do_you_think_about_the_reddit_partnership/l4gvqrl/",
    "removal_reason": null,
    "replies": "",
    "report_reasons": null,
    "retrieved_on": 1715959988,
    "saved": false,
    "score": 2,
    "score_hidden": false,
    "send_replies": true,
    "stickied": false,
    "subreddit": "ChatGPT",
    "subreddit_id": "t5_7hqomg",
    "subreddit_name_prefixed": "r/ChatGPT",
    "subreddit_type": "public",
    "top_awarded_type": null,
    "total_awards_received": 0,
    "treatment_tags": [],
    "unrepliable_reason": null,
    "ups": 2,
    "user_reports": []
}