{
    "_meta": {
        "retrieved_2nd_on": 1716113710
    },
    "all_awardings": [],
    "approved_at_utc": null,
    "approved_by": null,
    "archived": false,
    "associated_award": null,
    "author": "trajo123",
    "author_flair_background_color": null,
    "author_flair_css_class": null,
    "author_flair_richtext": [],
    "author_flair_template_id": null,
    "author_flair_text": null,
    "author_flair_text_color": null,
    "author_flair_type": "text",
    "author_fullname": "t2_3ofwm7j3",
    "author_is_blocked": false,
    "author_patreon_flair": false,
    "author_premium": false,
    "awarders": [],
    "banned_at_utc": null,
    "banned_by": null,
    "body": ">IMHO, no, they have no ability to reason or understand.  \n...  \nHowever, the AI has never lived on this planet, has never seen it, and could never possibly know.  \n...\n\n>Of course there's a case to be made that AI models do in fact think and reason in the same way as people\n\nYou are conflating two different things. On one side, the concepts of understanding and reasoning, and on the other side experiencing the world and thinking like humans do. You do not need to argue that LLMs process information differently and that they did not experience the world directly as living beings, that much is clear. \n\nBut the concept of understanding can be discussed separately from how the world is experienced and how the information is processed. There are some useful analogies to think about this question: \"does a man born blind really understand what colors are, what is light and dark?\". \"Does a deaf man understand sound, music, etc?\" The point is that how one perceives the world is not relevant to whether one is capable of understanding.\n\nAs others have pointed out, you need to start with a more detailed and objective definition of understanding. I delve into such a definition in [this comment](https://www.reddit.com/r/ChatGPT/comments/1ctypcj/comment/l4g6qun/?utm_source=share&utm_medium=web3x&utm_name=web3xcss&utm_term=1&utm_content=share_button). But it basically boils down to: 1. ability to acquire knowledge, 2. making sense of the information by finding patterns, 3. integrate information with existing knowledge, 4. application: using the acquired knowledge to solve problems, make predictions, make decisions. 5. the ability to communicate the acquired knowledge, 6 being able to take perspective, appreciate limitations of the knowledge. LLMs do actually ticks all the boxes. So LLMs, for all intents and purposes, do understand. \n\nUnderstanding can never be perfect though, and while some LLMs are better than others, they all make mistakes. But so do we, anyone thinking they understand something perfectly is just deluding themselves. However LLMs, because they different from humans, because they are not embodied and acquire knowledge differently, they will always make different kinds of mistakes from humans. They will always be a little bit of \"idiot savants\". They do understand and they do reason albeit very differently from us.",
    "can_gild": false,
    "can_mod_post": false,
    "collapsed": false,
    "collapsed_because_crowd_control": null,
    "collapsed_reason": null,
    "collapsed_reason_code": null,
    "comment_type": null,
    "controversiality": 0,
    "created": 1715984100,
    "created_utc": 1715984100,
    "distinguished": null,
    "downs": 0,
    "edited": false,
    "gilded": 0,
    "gildings": {},
    "id": "l4iqmll",
    "is_submitter": false,
    "likes": null,
    "link_id": "t3_1ctypcj",
    "locked": false,
    "mod_note": null,
    "mod_reason_by": null,
    "mod_reason_title": null,
    "mod_reports": [],
    "name": "t1_l4iqmll",
    "no_follow": true,
    "num_reports": null,
    "parent_id": "t1_l4gmxkk",
    "permalink": "/r/ChatGPT/comments/1ctypcj/do_llms_actually_understand_language_or_do_they/l4iqmll/",
    "removal_reason": null,
    "replies": "",
    "report_reasons": null,
    "retrieved_on": 1715984116,
    "saved": false,
    "score": 1,
    "score_hidden": false,
    "send_replies": true,
    "stickied": false,
    "subreddit": "ChatGPT",
    "subreddit_id": "t5_7hqomg",
    "subreddit_name_prefixed": "r/ChatGPT",
    "subreddit_type": "public",
    "top_awarded_type": null,
    "total_awards_received": 0,
    "treatment_tags": [],
    "unrepliable_reason": null,
    "ups": 1,
    "user_reports": []
}