{
    "_meta": {
        "retrieved_2nd_on": 1716281837
    },
    "all_awardings": [],
    "approved_at_utc": null,
    "approved_by": null,
    "archived": false,
    "associated_award": null,
    "author": "all_upper_case",
    "author_flair_background_color": null,
    "author_flair_css_class": null,
    "author_flair_richtext": [],
    "author_flair_template_id": null,
    "author_flair_text": null,
    "author_flair_text_color": null,
    "author_flair_type": "text",
    "author_fullname": "t2_54r565ku",
    "author_is_blocked": false,
    "author_patreon_flair": false,
    "author_premium": false,
    "awarders": [],
    "banned_at_utc": null,
    "banned_by": null,
    "body": "Well, GPT is a glorified Siri in roughly the same way that a MacBook Air is a glorified TI-86 — which is to say that \"glorified\" is doing a *lot* of work in both of those comparisons. \n\nSome things Siri can do: set a timer, alarm, or reminder; transcribe and send a text; answer a simple verbal math problem; tell one of a few predetermined jokes; answer simple, factual general knowledge questions, as long as Google has the answer already written at the top of the search results (i think that's how it works at least, correct me if I'm off base).\n\nSome things ChatGPT can do: patiently help you break down your intergenerational societal trauma while role-playing as a medieval court jester who has been extensively trained, anachronistically, in the works of the most renowned modern psychologists and philosophers, and write a Shakespearean sonnet in the same context comparing your college experiences to the conflict of morals in Starship Troopers between the troopers and the military industrial complex that commands them.\n\n(And yes, I know that's only one example compared to like 7 examples for Siri, but I don't like r/BrandNewSentence enough to write more content for them right now.)\n\nTo your other point, everybody knows GPT is \"faking\" its emotions; the only way for it to have real emotions would be if it were truly sentient, and that would be a completely different bucket of worms altogether—I think even the most skeptical people in society would acknowledge that creating an entirely new form of life from scratch would be far more than just a gimmicky Siri 2.0.\n\nBut on the other hand, nobody really has to like anything they don't want to, and they certainly don't have to be interested in any given new technology. Nobody likes evangelists or being proselytized, so stand in your truth and forget about GPT if you want to!\n\n(Here's a link to the official app just in case you wanna try it out tho: https://apps.apple.com/us/app/chatgpt/id6448311069)",
    "can_gild": false,
    "can_mod_post": false,
    "collapsed": false,
    "collapsed_because_crowd_control": null,
    "collapsed_reason": null,
    "collapsed_reason_code": null,
    "comment_type": null,
    "controversiality": 0,
    "created": 1716152224,
    "created_utc": 1716152224,
    "distinguished": null,
    "downs": 0,
    "edited": false,
    "gilded": 0,
    "gildings": {},
    "id": "l4sb8kg",
    "is_submitter": false,
    "likes": null,
    "link_id": "t3_1cv9zwl",
    "locked": false,
    "mod_note": null,
    "mod_reason_by": null,
    "mod_reason_title": null,
    "mod_reports": [],
    "name": "t1_l4sb8kg",
    "no_follow": true,
    "num_reports": null,
    "parent_id": "t1_l4ra0ms",
    "permalink": "/r/ChatGPT/comments/1cv9zwl/this_is_insane/l4sb8kg/",
    "removal_reason": null,
    "replies": "",
    "report_reasons": null,
    "retrieved_on": 1716152238,
    "saved": false,
    "score": 2,
    "score_hidden": false,
    "send_replies": true,
    "stickied": false,
    "subreddit": "ChatGPT",
    "subreddit_id": "t5_7hqomg",
    "subreddit_name_prefixed": "r/ChatGPT",
    "subreddit_type": "public",
    "top_awarded_type": null,
    "total_awards_received": 0,
    "treatment_tags": [],
    "unrepliable_reason": null,
    "ups": 2,
    "user_reports": []
}