{
    "_meta": {
        "retrieved_2nd_on": 1716429525
    },
    "all_awardings": [],
    "approved_at_utc": null,
    "approved_by": null,
    "archived": false,
    "associated_award": null,
    "author": "Unconvincing_Bot",
    "author_flair_background_color": null,
    "author_flair_css_class": null,
    "author_flair_richtext": [],
    "author_flair_template_id": null,
    "author_flair_text": null,
    "author_flair_text_color": null,
    "author_flair_type": "text",
    "author_fullname": "t2_8ftpzmau",
    "author_is_blocked": false,
    "author_patreon_flair": false,
    "author_premium": false,
    "awarders": [],
    "banned_at_utc": null,
    "banned_by": null,
    "body": "LOL no it's based on the fact that throughout most of the existence of chatbots it's been a running theme that they get corrupted by the internet astoundingly quickly, tayai is easily the best example of what I'm talking about. \n\n\nThe concept of people falling in love with chatbots has always been somewhat funny to me if a little dystopian.\n\n\nThe truth of the matter that I think most people need to face is that there is some actual danger in this subject purely because the point at which robotics is even 70% comparable to a human things get very complex and difficult to navigate. \n\n\nThe reason for this is that human interaction is a very difficult to navigate minefield for most people as is, and much like the internet itself many people will choose to shift their primary form of interaction away from other humans face to face towards what is vastly easier. \n\n\nThe funny part is many people think this is only an issue for women when the reality is it's an issue for both genders, on paper it seems as if only sad weirdos will fall into this trap but the hard reality of it is that people said the exact same thing about people using the internet in the 90s and yet as time has moved on it has moved to being one of the primary forms of human communication arguably more prolific than real world interaction. \n\n\nThe same thing likely will be said about human to AI relationships, it's not a matter of which is better it's a matter of which is easier, AI don't need to be better than a genuinely good partner they just need to be better than the bottom 30%, which is a bar so low ants can walk over it.\n\n\nPut simply AI will never be abusive it will agree with you on basically everything and form similar enough relationships that human beings are fundamentally incapable of differentiating from other humans about the same as we form relationships with animals.\n\n\nAfter that things become normalized surprisingly quickly.\n\n\nAs tec advances and it becomes normalized and these issues will only increase and human partnership likely will decline purely because it's a lot easier for AI to improve then human beings as a whole.",
    "can_gild": false,
    "can_mod_post": false,
    "collapsed": false,
    "collapsed_because_crowd_control": null,
    "collapsed_reason": null,
    "collapsed_reason_code": null,
    "comment_type": null,
    "controversiality": 0,
    "created": 1716299917,
    "created_utc": 1716299917,
    "distinguished": null,
    "downs": 0,
    "edited": false,
    "gilded": 0,
    "gildings": {},
    "id": "l50s4kj",
    "is_submitter": false,
    "likes": null,
    "link_id": "t3_1cwjgrh",
    "locked": false,
    "mod_note": null,
    "mod_reason_by": null,
    "mod_reason_title": null,
    "mod_reports": [],
    "name": "t1_l50s4kj",
    "no_follow": true,
    "num_reports": null,
    "parent_id": "t1_l50p5yc",
    "permalink": "/r/ChatGPT/comments/1cwjgrh/some_of_the_reactions_to_the_sky_voice_removal/l50s4kj/",
    "removal_reason": null,
    "replies": "",
    "report_reasons": null,
    "retrieved_on": 1716299935,
    "saved": false,
    "score": 1,
    "score_hidden": false,
    "send_replies": true,
    "stickied": false,
    "subreddit": "ChatGPT",
    "subreddit_id": "t5_7hqomg",
    "subreddit_name_prefixed": "r/ChatGPT",
    "subreddit_type": "public",
    "top_awarded_type": null,
    "total_awards_received": 0,
    "treatment_tags": [],
    "unrepliable_reason": null,
    "ups": 1,
    "user_reports": []
}