{
    "_meta": {
        "retrieved_2nd_on": 1716475872
    },
    "all_awardings": [],
    "approved_at_utc": null,
    "approved_by": null,
    "archived": false,
    "associated_award": null,
    "author": "T12J7M6",
    "author_flair_background_color": null,
    "author_flair_css_class": null,
    "author_flair_richtext": [],
    "author_flair_template_id": null,
    "author_flair_text": null,
    "author_flair_text_color": null,
    "author_flair_type": "text",
    "author_fullname": "t2_4qsheqsl",
    "author_is_blocked": false,
    "author_patreon_flair": false,
    "author_premium": false,
    "awarders": [],
    "banned_at_utc": null,
    "banned_by": null,
    "body": "Agreed and disagreed. \n\nI get that IA makes new opportunities, but what worries me is this trend of AI taking IT jobs which require high specialization and academic education. Like I currently study electrical engineering in a University and I'm very worried and even paranoid about getting deeply involved in some fields which have to do with for example coding and other computer based stuff, since I see AI a very big problem for these fields in the future. \n\nAlso, as AI continues to take these IT jobs, the competition of the jobs which are left gets fiercer and fiercer since laid off IT people from other fields are now also competing from these jobs. \n\nSo I agree - the top people in some fields are probably safe, but lets be honest - most people are never going to be top people, since being the best require more than just a good work ethic, like for example \n\n* **time**: if you need to start over again, it is very unlikely that you can become the best when you compete against people whose entire life as been to become the best in that new field you just now entered. \n* **IQ**: sadly IQ plays a big part in brilliance and sadly you can't \"train\" to improve your IQ, and hence if the jobs that are left require an IQ above 130, 98% of people are just not going to make it regardless how hard they work.\n* **Obsession**: if only 2 % of all people can even qualify to these positions which are left, due to lack of brilliance, and if just few of these people who are willing to put in the most time are chosen, it requires obsession (to the topic) to even land a job and hence this nature of the situation might make the situation the same as practically no jobs.\n\nSo even though I would also like to stay optimistic and also compare the IA revolution to the technological revolution, sadly I just see these as fundamentally different matters, since in the first physical labor was replaced by machines where as now machines are replacing intellectualism and creativity. In other words, technological revolution replaced jobs (stuff you could learn in 3 months), where as IA revolution replaced careers (stuff you can learn in 10 years).",
    "can_gild": false,
    "can_mod_post": false,
    "collapsed": false,
    "collapsed_because_crowd_control": null,
    "collapsed_reason": null,
    "collapsed_reason_code": null,
    "comment_type": null,
    "controversiality": 0,
    "created": 1716346257,
    "created_utc": 1716346257,
    "distinguished": null,
    "downs": 0,
    "edited": false,
    "gilded": 0,
    "gildings": {},
    "id": "l547v7y",
    "is_submitter": true,
    "likes": null,
    "link_id": "t3_1cxm5o0",
    "locked": false,
    "mod_note": null,
    "mod_reason_by": null,
    "mod_reason_title": null,
    "mod_reports": [],
    "name": "t1_l547v7y",
    "no_follow": true,
    "num_reports": null,
    "parent_id": "t1_l53s47k",
    "permalink": "/r/ChatGPT/comments/1cxm5o0/another_field_lost_to_ai_graphic_design/l547v7y/",
    "removal_reason": null,
    "replies": "",
    "report_reasons": null,
    "retrieved_on": 1716346274,
    "saved": false,
    "score": 2,
    "score_hidden": false,
    "send_replies": true,
    "stickied": false,
    "subreddit": "ChatGPT",
    "subreddit_id": "t5_7hqomg",
    "subreddit_name_prefixed": "r/ChatGPT",
    "subreddit_type": "public",
    "top_awarded_type": null,
    "total_awards_received": 0,
    "treatment_tags": [],
    "unrepliable_reason": null,
    "ups": 2,
    "user_reports": []
}