{
    "_meta": {
        "is_edited": true,
        "retrieved_2nd_on": 1716508075
    },
    "all_awardings": [],
    "approved_at_utc": null,
    "approved_by": null,
    "archived": false,
    "associated_award": null,
    "author": "__nickerbocker__",
    "author_flair_background_color": null,
    "author_flair_css_class": null,
    "author_flair_richtext": [],
    "author_flair_template_id": null,
    "author_flair_text": null,
    "author_flair_text_color": null,
    "author_flair_type": "text",
    "author_fullname": "t2_374htaas",
    "author_is_blocked": false,
    "author_patreon_flair": false,
    "author_premium": true,
    "awarders": [],
    "banned_at_utc": null,
    "banned_by": null,
    "body": "I began receiving unsubstantiated HOA violations, as in, my property is immaculate and there was absolutely no reason to be receiving these things. I used it (we) to begin the process of documenting these actions and investigation/strategy. The management company was being difficult so we began inundating them with long winded emails with wording such that we are documenting this process and it shall be recorded that no response confirms X. The entire time we were asking for a reasonable and amicable resolution which of course was consistently ignored.\n\nThen we put in a public records request for all violation notices issued to the community for the past year. In an attempt to overwhelm me, the HOA attorneys deployed the classic legal strategy of sending literally all records for all time, as thousands of PDFs, nested into inconsistent directories, with about 30% duplicates. I lol'd, no big deal. We wrote a script to gather the documents and convert the PDFs to text and remove duplicates.With the cleaned txt files, we wrote another script to concurrently call the gpt-4o API using openai function calling to extract consistent data from them in JSON. That cost was only $9 in API fees and only took a few minutes of time. With the new dataset, we ran analysis to find enforcement anomalies. We then took the data subset and dumped it into a Google map, and just like that, we have proof of targeted and selective enforcement.\n\nWe held those cards close to the chest as we closed in on who was responsible for the issuance of the fake violations. Turns out it was a board member. After getting the board to sign off on the condition of my property, we wrote a message to the board to hopefully bait one of them into driving by the house to perform an unwarranted inspection. I had just finished upgrading my security cameras to 4k with views up and down both sides of the street when they took the bait! HOA Karen just couldn't help herself. Now we have video evidence of the HOA president driving out her way, stopping at my house to take pictures, and then speeding off without stopping anywhere else. Targeted harassment.\n\nWe then engaged the HOAs law firm with a demand letter, and based on all the evidence I'm confident that we got 'em!",
    "can_gild": false,
    "can_mod_post": false,
    "collapsed": false,
    "collapsed_because_crowd_control": null,
    "collapsed_reason": null,
    "collapsed_reason_code": null,
    "comment_type": null,
    "controversiality": 0,
    "created": 1716378461,
    "created_utc": 1716378461,
    "distinguished": null,
    "downs": 0,
    "edited": false,
    "gilded": 0,
    "gildings": {},
    "id": "l55nvev",
    "is_submitter": false,
    "likes": null,
    "link_id": "t3_1cxpq7d",
    "locked": false,
    "mod_note": null,
    "mod_reason_by": null,
    "mod_reason_title": null,
    "mod_reports": [],
    "name": "t1_l55nvev",
    "no_follow": true,
    "num_reports": null,
    "parent_id": "t3_1cxpq7d",
    "permalink": "/r/ChatGPT/comments/1cxpq7d/coolest_thing_youve_done_with_4o/l55nvev/",
    "removal_reason": null,
    "replies": "",
    "report_reasons": null,
    "retrieved_on": 1716378476,
    "saved": false,
    "score": 556,
    "score_hidden": false,
    "send_replies": true,
    "stickied": false,
    "subreddit": "ChatGPT",
    "subreddit_id": "t5_7hqomg",
    "subreddit_name_prefixed": "r/ChatGPT",
    "subreddit_type": "public",
    "top_awarded_type": null,
    "total_awards_received": 0,
    "treatment_tags": [],
    "unrepliable_reason": null,
    "ups": 556,
    "user_reports": []
}