{
    "_meta": {
        "removal_type": "deleted",
        "retrieved_2nd_on": 1716513881,
        "was_deleted_later": true
    },
    "all_awardings": [],
    "approved_at_utc": null,
    "approved_by": null,
    "archived": false,
    "associated_award": null,
    "author": "LogMeln",
    "author_flair_background_color": null,
    "author_flair_css_class": null,
    "author_flair_richtext": [],
    "author_flair_template_id": null,
    "author_flair_text": null,
    "author_flair_text_color": null,
    "author_flair_type": "text",
    "author_fullname": "t2_ppcdnbgq",
    "author_is_blocked": false,
    "author_patreon_flair": false,
    "author_premium": false,
    "awarders": [],
    "banned_at_utc": null,
    "banned_by": null,
    "body": "I'm the head of marketing at an enterprise software company. As the head of the dept, I've once had my hands deep in each area of the business, copywriting, digital marketing, SEO, SEM, product marketing, customer research, competitive research, sales enablement, etc. Over the years of leading teams, i've had to take a few steps back to focus more on strategy vs the tactical work. I use GPT for a few things; \n\n* Reviewing/validating my strategy to make sure it's sound\n* I use a lot of voice notes throughout the day, speaking my thoughts and strategy, I take that and let GPT consolidate and clean up my notes\n* I also take customer conversations ive had and upload the transcript and ask gpt to extract the most valuable insights\n* I am also fairly active on LinkedIn as I lead the marketing org and want to be a good example to the teams to be active and practice social selling; I take a lot of my thoughts on ask it to write a linkedin post\n* we have big focus areas for each area of marketing (SEO, SEM, content, etc) and I always try to strategically connect the BIG dots across the entire teams. I ask GPT to help me connect the dots to have a quarterly and yearly themes. \n* I often find that my content team and copywriting team is slow -- writing in itself is subjective so ill never say the writing is bad, but its factual to say its slow. so i will use GPT to give the team a good head start on content we've all agreed on. i will ask the team to always add in quantitative metrics and analysis we do on our own and sprinkle it in to the \"core\" outline i provide created by GPT\n* i also like to get in the weeds with our digital advertising. whenever my team creates ad copy for me, i like to provide 1 more theme as a test. whether its negative sentiment, humor, emotional -- i feed our ad copy into GPT and ask it to generate me a version with that one theme\n* the BIGGEST usecase however, is to take my entire marketing strategy doc and consolidate the entire thing for the c-suite. CEO, CFO, CRO -- those who don't speak marketing language. I ask GPT to clean up my strategy doc for a non-marketer c-suite and its been received SO well. its probably been the greatest help to my career in the last maybe 4 years (i was using other GPT products in the past)\n\nOutside of work:\n\n* I give it a list of things in my fridge and ask for a recipe -- including cocktails (im no longer drinking tho)\n* I often have conversations with it to help me make decisions when im purchasing something -- i ask it to ask me some qualifying questions to help me narrow down to 1 item from a choice of maybe 2 or 3. \n* when im playing video games, i ask if a certain strategy will work, or what the best party for my RPG and why.",
    "can_gild": false,
    "can_mod_post": false,
    "collapsed": false,
    "collapsed_because_crowd_control": null,
    "collapsed_reason": null,
    "collapsed_reason_code": null,
    "comment_type": null,
    "controversiality": 0,
    "created": 1716384273,
    "created_utc": 1716384273,
    "distinguished": null,
    "downs": 0,
    "edited": false,
    "gilded": 0,
    "gildings": {},
    "id": "l560tje",
    "is_submitter": false,
    "likes": null,
    "link_id": "t3_1cxw96y",
    "locked": false,
    "mod_note": null,
    "mod_reason_by": null,
    "mod_reason_title": null,
    "mod_reports": [],
    "name": "t1_l560tje",
    "no_follow": true,
    "num_reports": null,
    "parent_id": "t3_1cxw96y",
    "permalink": "/r/ChatGPT/comments/1cxw96y/what_do_you_guys_genuinely_use_chatgpt_for/l560tje/",
    "removal_reason": null,
    "replies": "",
    "report_reasons": null,
    "retrieved_on": 1716384287,
    "saved": false,
    "score": 66,
    "score_hidden": false,
    "send_replies": true,
    "stickied": false,
    "subreddit": "ChatGPT",
    "subreddit_id": "t5_7hqomg",
    "subreddit_name_prefixed": "r/ChatGPT",
    "subreddit_type": "public",
    "top_awarded_type": null,
    "total_awards_received": 0,
    "treatment_tags": [],
    "unrepliable_reason": null,
    "ups": 66,
    "user_reports": []
}