{
    "_meta": {
        "retrieved_2nd_on": 1716522630
    },
    "all_awardings": [],
    "approved_at_utc": null,
    "approved_by": null,
    "archived": false,
    "associated_award": null,
    "author": "Seakawn",
    "author_flair_background_color": null,
    "author_flair_css_class": null,
    "author_flair_richtext": [],
    "author_flair_template_id": null,
    "author_flair_text": null,
    "author_flair_text_color": null,
    "author_flair_type": "text",
    "author_fullname": "t2_3lv77",
    "author_is_blocked": false,
    "author_patreon_flair": false,
    "author_premium": false,
    "awarders": [],
    "banned_at_utc": null,
    "banned_by": null,
    "body": "Just gonna bounce my own agreements on some of these.\n\n> The first task I used it for was grading my papers before submission so I could use the feedback immediately rather than after I get the paper back.\n\nI would have loved this back when I was in school. Would have not only made my grades way better, probably, but also would have helped me learn as I'd have doubled my feedback and had more chances to get the hang of it.\n\nBut, better late than never. I often submit my notes and other writings to cGPT and ask for thoughts, summaries, veracity, some kind of advice, etc. Super interesting stuff to bolster my thoughts and writing by having this kind of feedback loop.\n\n>Various things can be difficult to research because of the wrong words. So I'll ask chatgpt for a research summary and I'll have all the phrases I need to properly research it (do not trust ChatGPT's research!)\n\nThis is one of the coolest and sort of mindblowing perks of LLMs for me. I often wanna research something but literally don't even have the vocabulary of whatever the jargon is. So I can just messily describe what it is that I'm thinking about and wanting, and it'll just be like, \"oh, yeah, in that field that's classified as X, under the category Y, and there's even a term Z for the specific dynamic you described. So you can probably look up...\"\n\nSome information truly used to be inaccessible to me, or otherwise gatekept under a ton of fucking effort and reading despite access to the internet, due to this type of resistance. It's such a relief to not have to ever experience this kind of issue anymore and freely find out exactly what it is that I'm thinking of and how to look into it specifically.\n\n>I'm working on an Arduino project right now. I intend to use it for coding but haven't yet.\n\nCoding or other fields/hobbies are so much easier to learn now. I have an actual book for getting started with Arduino, but still didn't understand some of the basic stuff, while the book just moved on. So I used ChatGPT to help me understand edge detection, and some other stuff, on both a wider and deeper level than the book explained, which helped me really integrate some of the early lessons in logic and hardware before moving on to more advanced sketches.",
    "can_gild": false,
    "can_mod_post": false,
    "collapsed": false,
    "collapsed_because_crowd_control": null,
    "collapsed_reason": null,
    "collapsed_reason_code": null,
    "comment_type": null,
    "controversiality": 0,
    "created": 1716393016,
    "created_utc": 1716393016,
    "distinguished": null,
    "downs": 0,
    "edited": false,
    "gilded": 0,
    "gildings": {},
    "id": "l56p30m",
    "is_submitter": false,
    "likes": null,
    "link_id": "t3_1cxcelq",
    "locked": false,
    "mod_note": null,
    "mod_reason_by": null,
    "mod_reason_title": null,
    "mod_reports": [],
    "name": "t1_l56p30m",
    "no_follow": true,
    "num_reports": null,
    "parent_id": "t1_l52y8ff",
    "permalink": "/r/ChatGPT/comments/1cxcelq/im_very_suspicious_about_why_the_openai_company/l56p30m/",
    "removal_reason": null,
    "replies": "",
    "report_reasons": null,
    "retrieved_on": 1716393033,
    "saved": false,
    "score": 2,
    "score_hidden": false,
    "send_replies": true,
    "stickied": false,
    "subreddit": "ChatGPT",
    "subreddit_id": "t5_7hqomg",
    "subreddit_name_prefixed": "r/ChatGPT",
    "subreddit_type": "public",
    "top_awarded_type": null,
    "total_awards_received": 0,
    "treatment_tags": [],
    "unrepliable_reason": null,
    "ups": 2,
    "user_reports": []
}