{
    "_meta": {
        "is_edited": true,
        "retrieved_2nd_on": 1716528919
    },
    "all_awardings": [],
    "approved_at_utc": null,
    "approved_by": null,
    "archived": false,
    "associated_award": null,
    "author": "Gamerboy11116",
    "author_flair_background_color": null,
    "author_flair_css_class": null,
    "author_flair_richtext": [],
    "author_flair_template_id": null,
    "author_flair_text": null,
    "author_flair_text_color": null,
    "author_flair_type": "text",
    "author_fullname": "t2_1btouv",
    "author_is_blocked": false,
    "author_patreon_flair": false,
    "author_premium": false,
    "awarders": [],
    "banned_at_utc": null,
    "banned_by": null,
    "body": "> Without IP they wouldn’t have ever made mario or sonic to copy in the first place.\n\nThat’s ridiculous. Human creativity and desire to make doesn’t die just because it’s moderately harder to make money off it.\n\n> The fans are welcome to invent their own games,\n\nNot with copyright, they aren’t. Even if your work is _non-profit,_ copyright still applies in most cases. It’s possible to file a patent on a _mathematical algorithm,_ for goodness’ sake.\n\n> and with your system they will never get paid.\n\nThey could crowd-fund. Like tons of people are being forced to today, as more and more jobs are taken away by inevitable automation.\n\nAnd you know corporations can still sell media, even without copyright, right? It just wouldn’t be nearly as profitable because other people could legally pirate, but that’s really no different to today, and just like now, people would still be willing to pay for convenience. \n\nAnd there’d still be such a thing as closed-source. You can even protect against source-code leaks (which would admittedly be a lot more damaging) with the fact that source-code leaks don’t get constant bug-fixes, new features and improvements for free. Which would now be even more heavily encouraged. As would customer support.\n\nLike, what’s the problem here?\n\n> IP has nothing to do with why insulin is expensive - it has been off patent since before you were born.\n\nFirst off; little rude. Secondly, just because it’s been ‘off-patent’ doesn’t mean patents aren’t the [reason](https://journals.plos.org/plosmedicine/article?id=10.1371/journal.pmed.1004309) why it’s so expensive.\n\n> As far as companies abusing individual rights, isn’t that what OpenAI is accused of doing here? Not sure why you want to be on the side of the for-profit company trying to sell a product by exploiting other peoples work.\n\nI’m not on OpenAI’s ‘side’. It’s just that I’m _against_ the side that is _for_ intellectual property- because I think the whole concept of intellectual property is silly and dangerous.\n\nWhich just so happens to put me on their side in _both_ these debates, actually.\n\n> The private sector while money hungry and shady has made tremendous contributions to health and technology. You basically want to unhire all these people, or ask them to do it as a hobby, or have just Government funded research. This is a terrible idea.\n\nNot at all. The private sector still exists, even without copyright law. You’re only really talking about a few specific types of corporations.\n\nAnd, quite frankly, if I had to choose between having five people working for the good of humanity, and six people working for the good of humanity, but one of them is malicious and only looking for ways to use any new developments exclusively for _themselves_ at the expense of everything else, I know what I’d choose.\n\n> The other part of your argument is that art and creative work has intrinsic value. Then why do you want to make its monetary value zero? We should be incentivizing this creativity, not consigning it to a brief period after getting home from the office or manufacturing plant.\n\nI never said that. Abolishing intellectual property wouldn’t make the value of art zero- all it means is people couldn’t tell anybody what they’re _allowed_ to make art out of anymore.",
    "can_gild": false,
    "can_mod_post": false,
    "collapsed": false,
    "collapsed_because_crowd_control": null,
    "collapsed_reason": null,
    "collapsed_reason_code": null,
    "comment_type": null,
    "controversiality": 0,
    "created": 1716399309,
    "created_utc": 1716399309,
    "distinguished": null,
    "downs": 0,
    "edited": false,
    "gilded": 0,
    "gildings": {},
    "id": "l577vq3",
    "is_submitter": false,
    "likes": null,
    "link_id": "t3_1cx6thm",
    "locked": false,
    "mod_note": null,
    "mod_reason_by": null,
    "mod_reason_title": null,
    "mod_reports": [],
    "name": "t1_l577vq3",
    "no_follow": true,
    "num_reports": null,
    "parent_id": "t1_l56mzu3",
    "permalink": "/r/ChatGPT/comments/1cx6thm/ok_can_we_have_sky_back_now/l577vq3/",
    "removal_reason": null,
    "replies": "",
    "report_reasons": null,
    "retrieved_on": 1716399325,
    "saved": false,
    "score": 1,
    "score_hidden": false,
    "send_replies": true,
    "stickied": false,
    "subreddit": "ChatGPT",
    "subreddit_id": "t5_7hqomg",
    "subreddit_name_prefixed": "r/ChatGPT",
    "subreddit_type": "public",
    "top_awarded_type": null,
    "total_awards_received": 0,
    "treatment_tags": [],
    "unrepliable_reason": null,
    "ups": 1,
    "user_reports": []
}