{
    "_meta": {
        "is_edited": true,
        "retrieved_2nd_on": 1716530304
    },
    "all_awardings": [],
    "approved_at_utc": null,
    "approved_by": null,
    "archived": false,
    "associated_award": null,
    "author": "FoxB1t3",
    "author_flair_background_color": null,
    "author_flair_css_class": null,
    "author_flair_richtext": [],
    "author_flair_template_id": null,
    "author_flair_text": null,
    "author_flair_text_color": null,
    "author_flair_type": "text",
    "author_fullname": "t2_xtvtxgi16",
    "author_is_blocked": false,
    "author_patreon_flair": false,
    "author_premium": false,
    "awarders": [],
    "banned_at_utc": null,
    "banned_by": null,
    "body": "First of all, just to context, I'm a sales director in a small company, I would say. We do about six million dollars of revenue and there is like 13 people on board currently. We are a freight forwarding company based in Europe. So, being a sales director in this size company, kind of makes me involved not only into managing people but also into operations and sales processes itself. I'm not a developer, I don't know programming languages like Python and stuff, but I know the structures of it because I'm a tech freak. I was always interested in tech and at some point of my life I wanted to be a programmer, a developer, or something like this, but I've never been one for real.\n\n--\n\nAlthough I'm not a developer, I understand programming concepts, which helped me communicate effectively with ChatGPT. Our company struggled with predicting spot prices accurately due to various factors like seasonal trends, vehicle availability, holidays, and fuel prices. Our freight forwarders' estimates were on average 10-11% off the actual spot price, causing inefficiencies and potential losses. I hired ChatGPT, which suggested building a price prediction model using a deep neural network. With over 20,000 past transport records, we had a substantial dataset to work with but at first I thought that machine went crazy and that there is no way I can do something that complex. Well, never was so much wrong. GPT guided me through the process, we created a learning script, it also helped me with augmenting data (creating new features, giving ideas for them etc.) and hyperparameter tuning and after just few weeks (and overheated PC... which was actually a great idea to convince my wife that I need new powerfull machine, lol) I was able to create a model which is approximately 7% off the actual spot prices, which to me is significant improvement. For some people it might be easy, it might be obvious and stuff. But for me - this kind of approach and such things was always limited for the biggest companies, not for such small ones like my own. I'm quite sure that this is the way it works in big corporations... but being able to introduce it, deploy on my level is something outstanding for me. So now our forwarders can just input key details like pickup and delivery locations, type of cargo, and vehicle type to get a reliable price estimate. To my knowledge such good model is very rare or even non-existent among the competition.\n\n--\n\nThe second project addressed the challenge of gathering and standardizing data from our network of carriers. As a freight forwarding company specializing in express transport, we frequently receive emails from around sixty carriers, each listing their available vehicles. These emails, however, come in various formats, making it difficult to consolidate and use the data effectively. The lack of a standardized format resulted in significant inefficiencies - errors and need to waste 2 hours for a person to read them and refine. To tackle this we created a solution where each carrier's email is processed through ChatGPT who extracts the critical information and then compiles this data into a unified file. This file is subsequently integrated into our internal company map, allowing our freight forwarders to quickly see the locations of available vehicles. Of course it not only refined the emails but also helped me write the Python script necessary for these operations. Additionally, guided me on deploying the system within the company. This solution has been operational for about six months now and has proven to be highly reliable, with no reported errors.\n\n--\n\nThe third project focuses on automating the process of saving quotation details into our CRM system. In our express transport business, quotations are often sent to clients via email, with each email potentially having a different format. This unstructured nature of our quotations necessitated a system to standardize and collect this data efficiently. Previously, our forwarders had to manually input information into the CRM system, including pickup and delivery locations, client price, estimated cost, vehicle type, and other relevant details. Given the fast-paced environment of express transport, this manual process was time-consuming and prone to inconsistencies. Why you don't have a pricing/quotation form you ask? Well in this type of business you often work on WhatsApp, on Skype, use very short Emails which are not always perfectly structured as often we only got minutes to get the transport or not. Time is crucial so when you are for example - driving your car, you are not stopping to enter everything into CRM and send the offer to the client but rather send short message with crucial information in matter of seconds. I developed a system with ChatGPT's assistance. Now, when forwarders send a quotation, they simply include a dedicated email address in the CC field. This email is then forwarded to our quotation data collection service, where ChatGPT processes it. ChatGPT extracts the necessary information from the email, standardizes it, and inputs it directly into our CRM system.\n\n--\n\nI did more and perhaps more complex projects with ChatGPT but I would not dare to tell about it here. I also use it to analyze data sometimes but honestly I find traditional programs and ways better, yet. Yet. Beside that, most of the above message wrote ChatGPT actually, since I don't bother to write myself anymore.",
    "can_gild": false,
    "can_mod_post": false,
    "collapsed": false,
    "collapsed_because_crowd_control": null,
    "collapsed_reason": null,
    "collapsed_reason_code": null,
    "comment_type": null,
    "controversiality": 0,
    "created": 1716400697,
    "created_utc": 1716400697,
    "distinguished": null,
    "downs": 0,
    "edited": false,
    "gilded": 0,
    "gildings": {},
    "id": "l57c2eg",
    "is_submitter": false,
    "likes": null,
    "link_id": "t3_1cxw96y",
    "locked": false,
    "mod_note": null,
    "mod_reason_by": null,
    "mod_reason_title": null,
    "mod_reports": [],
    "name": "t1_l57c2eg",
    "no_follow": true,
    "num_reports": null,
    "parent_id": "t3_1cxw96y",
    "permalink": "/r/ChatGPT/comments/1cxw96y/what_do_you_guys_genuinely_use_chatgpt_for/l57c2eg/",
    "removal_reason": null,
    "replies": "",
    "report_reasons": null,
    "retrieved_on": 1716400712,
    "saved": false,
    "score": 1,
    "score_hidden": false,
    "send_replies": true,
    "stickied": false,
    "subreddit": "ChatGPT",
    "subreddit_id": "t5_7hqomg",
    "subreddit_name_prefixed": "r/ChatGPT",
    "subreddit_type": "public",
    "top_awarded_type": null,
    "total_awards_received": 0,
    "treatment_tags": [],
    "unrepliable_reason": null,
    "ups": 1,
    "user_reports": []
}