{
    "_meta": {
        "retrieved_2nd_on": 1716561639
    },
    "all_awardings": [],
    "approved_at_utc": null,
    "approved_by": null,
    "archived": false,
    "associated_award": null,
    "author": "sturnus-vulgaris",
    "author_flair_background_color": null,
    "author_flair_css_class": null,
    "author_flair_richtext": [],
    "author_flair_template_id": null,
    "author_flair_text": null,
    "author_flair_text_color": null,
    "author_flair_type": "text",
    "author_fullname": "t2_14hdnz",
    "author_is_blocked": false,
    "author_patreon_flair": false,
    "author_premium": false,
    "awarders": [],
    "banned_at_utc": null,
    "banned_by": null,
    "body": "I'm a teacher. There are a ton of practical applications that aren't student facing (I did a really ambitious AI art gallery, based on the text we were reading, where students evaluated \"art\" I created on Dall-E, but I haven't gotten brave enough to have them work extensively with text-based AI). I've also let students illustrate slide presentations with Dall-E, but again, I made certain that text wasn't an option. I use ChatGPT to make presentations for teachers, write reports and grant stuff, and make newsletters. I find it works exceptionally well at converting my notes into prose (like meeting notes converted into an email reminder of the key points). \n\nI *hate* teachers using it to create tests from wholecloth. I have caught far too many quiz questions that students studied absolutely incorrect answers for (a science teacher and a social studies teacher kept using it without proofing the results). I find, again, that it can really speed up the process of converting texts to quizzes, but I look at those very, very carefully (the idea of teaching an untruth is just abhorrent to me). I've also caught math story problems that were given to students but did not have correct solutions offered.\n\nIt can also help with lesson planning, which is some of the most formulaic busy work we put on teacher's schedules. When I started teaching, I was doing lesson planning every Sunday for 10 hours. I don't think a damn bit of it was ever read by anyone or ever really helped me teach. I'm glad to see new teachers will have a way out of that.\n\nMy general opinion-- Really productive teachers can use it to speed up a lot of drudgery and produce even higher quality work. Really lazy teachers can use it to look productive, but don't scratch the surface because you won't like what you see.",
    "can_gild": false,
    "can_mod_post": false,
    "collapsed": false,
    "collapsed_because_crowd_control": null,
    "collapsed_reason": null,
    "collapsed_reason_code": null,
    "comment_type": null,
    "controversiality": 0,
    "created": 1716432027,
    "created_utc": 1716432027,
    "distinguished": null,
    "downs": 0,
    "edited": false,
    "gilded": 0,
    "gildings": {},
    "id": "l59o22w",
    "is_submitter": false,
    "likes": null,
    "link_id": "t3_1cxw96y",
    "locked": false,
    "mod_note": null,
    "mod_reason_by": null,
    "mod_reason_title": null,
    "mod_reports": [],
    "name": "t1_l59o22w",
    "no_follow": true,
    "num_reports": null,
    "parent_id": "t3_1cxw96y",
    "permalink": "/r/ChatGPT/comments/1cxw96y/what_do_you_guys_genuinely_use_chatgpt_for/l59o22w/",
    "removal_reason": null,
    "replies": "",
    "report_reasons": null,
    "retrieved_on": 1716432043,
    "saved": false,
    "score": 1,
    "score_hidden": false,
    "send_replies": true,
    "stickied": false,
    "subreddit": "ChatGPT",
    "subreddit_id": "t5_7hqomg",
    "subreddit_name_prefixed": "r/ChatGPT",
    "subreddit_type": "public",
    "top_awarded_type": null,
    "total_awards_received": 0,
    "treatment_tags": [],
    "unrepliable_reason": null,
    "ups": 1,
    "user_reports": []
}