{
    "_meta": {
        "retrieved_2nd_on": 1716582688
    },
    "all_awardings": [],
    "approved_at_utc": null,
    "approved_by": null,
    "archived": false,
    "associated_award": null,
    "author": "Trick_Text_6658",
    "author_flair_background_color": null,
    "author_flair_css_class": null,
    "author_flair_richtext": [],
    "author_flair_template_id": null,
    "author_flair_text": null,
    "author_flair_text_color": null,
    "author_flair_type": "text",
    "author_fullname": "t2_8ibljods",
    "author_is_blocked": false,
    "author_patreon_flair": false,
    "author_premium": false,
    "awarders": [],
    "banned_at_utc": null,
    "banned_by": null,
    "body": "About it being free... I mean, aren't you asking for too much? It's quite new and cutting-edge technology. Used correctly it can really boost your skills - and I mean for real. Like getting a new job, optimize your company and stuff like that, beside of creating nsfw perv talks or creating a new gym plan. Such things can bring you money. So aside of it being free (which to me is just HUGE even if that was 5 messages per 3hrs), the 20$ price tag is like nothing. To put that into perspective - if you pay this 20$ and use this correctly you can quite easily make 200$ out of it in given month and if you think a bit more you could make 2000$ of it. Look at the history - did anyone gave you free internet once it came into public? Or mobile phone? Or other cutting-edge technologies. I'm not sure how old are you (totally no offence, I just get that people might not remember it as not everyone is old man like me lol) but no - there was no free internet, no free TV and no free mobiles. Yet, here, we have something AMAZING and you can try it for free. \n\nRegarding higher paid plans - sure that makes sense! There is API of course but not everyone is a codder or at least understands structures of programming language like Python, so I'm 100% on your side. It would be good to have more expensive plan with higher caps. Honestly I thought hundred times about it and only thing that comes up to my mind is that it's just very unprofitable for them. I believe these chatbox conversations are super expensive in terms of computing because there is a lot of context to load each time user sends a message. In API they don't care that much, since when you develop application basing on GPT then you load all the context by yourself and thus pay for it by yourself as the more context you load = the more token usage you have. So when developing something like that you really care about context length as that translates onto your costs directly. In this chatbox nobody cares about it and context is fully loaded with each message. I believe it's extremely expensive for OpenAI. \n\nRegarding rollout... yeah man, agreed. It's not being childish, guess we all got it. First they tease for 2 years. Then they \"release\" it or rather pre-release it again with future 2-3 months ahead dates. Then after it's released it's bugged and we need to wait another year for fixes. Annoying AF man.",
    "can_gild": false,
    "can_mod_post": false,
    "collapsed": false,
    "collapsed_because_crowd_control": null,
    "collapsed_reason": null,
    "collapsed_reason_code": null,
    "comment_type": null,
    "controversiality": 0,
    "created": 1716453072,
    "created_utc": 1716453072,
    "distinguished": null,
    "downs": 0,
    "edited": false,
    "gilded": 0,
    "gildings": {},
    "id": "l5annmg",
    "is_submitter": false,
    "likes": null,
    "link_id": "t3_1cy2z3l",
    "locked": false,
    "mod_note": null,
    "mod_reason_by": null,
    "mod_reason_title": null,
    "mod_reports": [],
    "name": "t1_l5annmg",
    "no_follow": true,
    "num_reports": null,
    "parent_id": "t1_l5algtw",
    "permalink": "/r/ChatGPT/comments/1cy2z3l/gpt4o_separating_reality_from_the_hype/l5annmg/",
    "removal_reason": null,
    "replies": "",
    "report_reasons": null,
    "retrieved_on": 1716453091,
    "saved": false,
    "score": 2,
    "score_hidden": false,
    "send_replies": true,
    "stickied": false,
    "subreddit": "ChatGPT",
    "subreddit_id": "t5_7hqomg",
    "subreddit_name_prefixed": "r/ChatGPT",
    "subreddit_type": "public",
    "top_awarded_type": null,
    "total_awards_received": 0,
    "treatment_tags": [],
    "unrepliable_reason": null,
    "ups": 2,
    "user_reports": []
}