{
    "_meta": {
        "retrieved_2nd_on": 1716603474
    },
    "all_awardings": [],
    "approved_at_utc": null,
    "approved_by": null,
    "archived": false,
    "associated_award": null,
    "author": "Effective-Bass-7887",
    "author_flair_background_color": null,
    "author_flair_css_class": null,
    "author_flair_richtext": [],
    "author_flair_template_id": null,
    "author_flair_text": null,
    "author_flair_text_color": null,
    "author_flair_type": "text",
    "author_fullname": "t2_rb180saw",
    "author_is_blocked": false,
    "author_patreon_flair": false,
    "author_premium": false,
    "awarders": [],
    "banned_at_utc": null,
    "banned_by": null,
    "body": "Hi, I am a professor at a university who has been struggling trying to find the right balance in my classes now that AI is here.  I have also experimented with how it can help me as both a professor and a researcher.  The problem as I see it is that whereas AI is a good tool for learning, students are not using it to learn, but are using it to do their work for them.  I have rather small classes, but I would have to say that because AI is so easy to access for cheating (i.e.,, by this I mean using AI to create their response) cheating has skyrocketed - I would guess from pre-AI of about 1/10 to 6/10 - and after figuring out how to catch students - dropped down to 4/10 - I don't have the energy to keep after all students.  Each student who was accused, has \"fessed up.\"   Whereas handwriting everything in front of the professor is not feasible (both of my classes this past semester were lab based so I could have them write their essays/answers using the Insight program to monitor computer activity using MWORD).  \n\nThe best AI detector is the Professor's brain, but I have found that ChatGpt is a useful ally in detecting AI work as it will recognize its own creations and say so.  A number of students say they are using Grammarly - and some are indeed doing so (some have discovered its a good out if they get caught)- but Chat says that AI detectors will only flag work as AI work if the user abuses Grammarly so that the AI voice takes over  (Grammarly has an AI engine - that may be Chat - I am not quite sure about that).  The newer versions of Grammarly are not your Gradma's version.  Correcting grammar and punctuation on an author created essay is not the same as getting Grammarly to modify it so extensively that it is no longer the author's creation.  Of, in the newer versions of Grammarly, getting AI to write it in the first place.  \n\nI am interested in hearing some ways that faculty are trying to handle this intrusive and destructive use of AI and I would have to say that I think this is a crossroads for Online education.\n\nMy solutions:\n\n1.  Removing outside of the class homework -at least that count for credit (e.g. 5/7 graduate students were using AI.  Again, I don't have time to grade AI work.  But I am thinking of handing out the homework and having them do it in class in place of the class review for the test.  \n\n2.  My students can't stand online discussion boards after COVID - I think they are burnt out and AI work proliferates - so discussions are moved to the classroom.\n\n3.  My exams are already in the classroom and written or on the computer if the Insight program is available.\n\n4.  My papers are very individualized and portions are very difficult to cheat on - but literature reviews and theoretical applications - AI is great at and being used even by some of my students who I never thought would do so.  \n\nAny ideas???",
    "can_gild": false,
    "can_mod_post": false,
    "collapsed": false,
    "collapsed_because_crowd_control": null,
    "collapsed_reason": null,
    "collapsed_reason_code": null,
    "comment_type": null,
    "controversiality": 0,
    "created": 1716473865,
    "created_utc": 1716473865,
    "distinguished": null,
    "downs": 0,
    "edited": false,
    "gilded": 0,
    "gildings": {},
    "id": "l5br1hi",
    "is_submitter": false,
    "likes": null,
    "link_id": "t3_13ecw4a",
    "locked": false,
    "mod_note": null,
    "mod_reason_by": null,
    "mod_reason_title": null,
    "mod_reports": [],
    "name": "t1_l5br1hi",
    "no_follow": true,
    "num_reports": null,
    "parent_id": "t3_13ecw4a",
    "permalink": "/r/ChatGPT/comments/13ecw4a/notes_from_a_teacher_on_ai_detection/l5br1hi/",
    "removal_reason": null,
    "replies": "",
    "report_reasons": null,
    "retrieved_on": 1716473883,
    "saved": false,
    "score": 1,
    "score_hidden": false,
    "send_replies": true,
    "stickied": false,
    "subreddit": "ChatGPT",
    "subreddit_id": "t5_7hqomg",
    "subreddit_name_prefixed": "r/ChatGPT",
    "subreddit_type": "public",
    "top_awarded_type": null,
    "total_awards_received": 0,
    "treatment_tags": [],
    "unrepliable_reason": null,
    "ups": 1,
    "user_reports": []
}