{
    "_meta": {
        "is_edited": true,
        "retrieved_2nd_on": 1716611185
    },
    "all_awardings": [],
    "approved_at_utc": null,
    "approved_by": null,
    "archived": false,
    "associated_award": null,
    "author": "biglybiglytremendous",
    "author_flair_background_color": null,
    "author_flair_css_class": null,
    "author_flair_richtext": [],
    "author_flair_template_id": null,
    "author_flair_text": null,
    "author_flair_text_color": null,
    "author_flair_type": "text",
    "author_fullname": "t2_mdkleh3",
    "author_is_blocked": false,
    "author_patreon_flair": false,
    "author_premium": false,
    "awarders": [],
    "banned_at_utc": null,
    "banned_by": null,
    "body": "I’ve been encouraging students to use AI since about 2017, first with chatbots like Replika, and now whichever models they can get their hands on. I see people have suggested in the comments that work in college should be your own, and I can agree with that as someone who is in academia and buys in hard to the idea that grappling with ideas is the best way to learn; however, there’s no reason students can’t wrestle with the material and learn from it by processing over time and iterative tasks too. I encourage students to use AI as a way to create a productive workflow, streamline thoughts, brainstorm ideas, and co-create first drafts of work. I absolutely think AI has a place in the classroom if used in a way that expands creativity, promotes deeper dives, and engages students in co-creative learning. \n\nAsk me if they should rip off a ChatGPT-generated response without examining what it said, changing any of its diction or syntax, or looking more deeply into the response in any way, and you know what I would say. The students who clearly copy and paste without a second thought (you know the ones—those who can’t even be arsed to check out where their cursor lies before highlighting or reading over what they copied into their paper who submit final drafts with “Certainly! I’d be glad to help you!” as the beginning of their essay…) should absolutely be failed from the assignment, spoken with about how to best use AI, and told they have to work *with* the AI to be smart about it. Half of these types of students are in college just to get the degree their parents require of them, though, and would cheat their way through with zero effort even if AI weren’t there “helping them” along the way. The other half are clueless and need some help navigating not just AI but understanding assignments in general. Sprinkled through these two halves are students who find themselves panicked last minute and need to do *something,* or students who feel like their jobs are dependent on high grades and think they can’t afford to do well. These are the students you talk to about how to improve, or engage them in discussions about whatever is eating away at them to find a better solution for everyone involved.\n\nTLDR: AI belongs in classrooms as long as it is utilized in a productive and meaningful way.",
    "can_gild": false,
    "can_mod_post": false,
    "collapsed": false,
    "collapsed_because_crowd_control": null,
    "collapsed_reason": null,
    "collapsed_reason_code": null,
    "comment_type": null,
    "controversiality": 0,
    "created": 1716481577,
    "created_utc": 1716481577,
    "distinguished": null,
    "downs": 0,
    "edited": false,
    "gilded": 0,
    "gildings": {},
    "id": "l5cd43h",
    "is_submitter": false,
    "likes": null,
    "link_id": "t3_1cydqpz",
    "locked": false,
    "mod_note": null,
    "mod_reason_by": null,
    "mod_reason_title": null,
    "mod_reports": [],
    "name": "t1_l5cd43h",
    "no_follow": true,
    "num_reports": null,
    "parent_id": "t3_1cydqpz",
    "permalink": "/r/ChatGPT/comments/1cydqpz/im_going_through_college_this_is_the_first_time/l5cd43h/",
    "removal_reason": null,
    "replies": "",
    "report_reasons": null,
    "retrieved_on": 1716481592,
    "saved": false,
    "score": 1,
    "score_hidden": false,
    "send_replies": true,
    "stickied": false,
    "subreddit": "ChatGPT",
    "subreddit_id": "t5_7hqomg",
    "subreddit_name_prefixed": "r/ChatGPT",
    "subreddit_type": "public",
    "top_awarded_type": null,
    "total_awards_received": 0,
    "treatment_tags": [],
    "unrepliable_reason": null,
    "ups": 1,
    "user_reports": []
}