{
    "_meta": {
        "retrieved_2nd_on": 1716743993
    },
    "all_awardings": [],
    "approved_at_utc": null,
    "approved_by": null,
    "archived": false,
    "associated_award": null,
    "author": "aseichter2007",
    "author_flair_background_color": null,
    "author_flair_css_class": null,
    "author_flair_richtext": [],
    "author_flair_template_id": null,
    "author_flair_text": null,
    "author_flair_text_color": null,
    "author_flair_type": "text",
    "author_fullname": "t2_ojzp7ucyz",
    "author_is_blocked": false,
    "author_patreon_flair": false,
    "author_premium": false,
    "awarders": [],
    "banned_at_utc": null,
    "banned_by": null,
    "body": "Their solution is pathetic.  \nThey have control of the infrastructure and the ability to do it right, one of very few players with that capacity, they have a duty to not kludge it on like this.  \n\nThey could build OS level implementation to generate screen approximations that correctly represent interactables in view. They could build data and train a very targeted small model for navigating this simplified UI, intelligently integrating data across multiple windows services to provide a tailored local or remote AI integration. \n\nInstead they're going to plug a multimodal LLM on it and hide the output completely out of view. \n\nWe're closing in on being able to walk away from our desks, and get yes/no decisions via mobile while we make dinner, as the computer just does the job you told it to do:\n\n\"Hey I'm going out, computer you're in charge of the office, act as me and send drafts to my mobile number for approval before sending out, complete support tickets but I will review them when I get back.\"\n\nWe're headed to a world where most people's expected natural workflow, curate AI like an as needed approval or small edit, and go about your day, be that ski-ing or really anything short of combat sports. Jobs that require frontier research or bartering better hold off but for a lot of careers, we will either eliminate humans for pennies on the dollar, or we will land on a model where approvals are needed. \n\nMicrosoft, as the only entity that can, should integrate AI with windows correctly and safely, because eventually they will have data escape and everyone in the world will have their pants down in one go. But they're not open source, they hoard control, and they don't respect any boundaries so even if they implement locally and ethically, there is no promise that will remain true. \n\nAs it is, it's an authoritarian wet dream, an excuse to literally watch every screen all the time and do heavy compute on it all the time. This path is madness. \n\nOpen unbiased and local AI is foundational to public health and safety. Microsoft seems to consistently align itself against those values. I'll stick with windows 10.  You can block updates by renaming the folders for some of the update stuff but it breaks the windows store. I don't miss it. I made Clipboard Conqueror to provide a powerful local copilot alternative that I could trust to only send data where I tell it to. Try it out.",
    "can_gild": false,
    "can_mod_post": false,
    "collapsed": false,
    "collapsed_because_crowd_control": null,
    "collapsed_reason": null,
    "collapsed_reason_code": null,
    "comment_type": null,
    "controversiality": 0,
    "created": 1716614380,
    "created_utc": 1716614380,
    "distinguished": null,
    "downs": 0,
    "edited": false,
    "gilded": 0,
    "gildings": {},
    "id": "l5kr4im",
    "is_submitter": false,
    "likes": null,
    "link_id": "t3_1czz31x",
    "locked": false,
    "mod_note": null,
    "mod_reason_by": null,
    "mod_reason_title": null,
    "mod_reports": [],
    "name": "t1_l5kr4im",
    "no_follow": true,
    "num_reports": null,
    "parent_id": "t3_1czz31x",
    "permalink": "/r/ChatGPT/comments/1czz31x/is_microsofts_aipowered_copilot_pcs_a_new_type_of/l5kr4im/",
    "removal_reason": null,
    "replies": "",
    "report_reasons": null,
    "retrieved_on": 1716614393,
    "saved": false,
    "score": 2,
    "score_hidden": false,
    "send_replies": true,
    "stickied": false,
    "subreddit": "ChatGPT",
    "subreddit_id": "t5_7hqomg",
    "subreddit_name_prefixed": "r/ChatGPT",
    "subreddit_type": "public",
    "top_awarded_type": null,
    "total_awards_received": 0,
    "treatment_tags": [],
    "unrepliable_reason": null,
    "ups": 2,
    "user_reports": []
}