{
    "_meta": {
        "retrieved_2nd_on": 1716820017
    },
    "all_awardings": [],
    "approved_at_utc": null,
    "approved_by": null,
    "archived": false,
    "associated_award": null,
    "author": "AffectionateRadio356",
    "author_flair_background_color": null,
    "author_flair_css_class": null,
    "author_flair_richtext": [],
    "author_flair_template_id": null,
    "author_flair_text": null,
    "author_flair_text_color": null,
    "author_flair_type": "text",
    "author_fullname": "t2_9v28wdj8",
    "author_is_blocked": false,
    "author_patreon_flair": false,
    "author_premium": false,
    "awarders": [],
    "banned_at_utc": null,
    "banned_by": null,
    "body": "I dunno man there's always been animosity between different classes, it's a part of our history and likely our psychology. I'll also say that the cries for solidarity grow suspiciously louder as certain previously \"safe\" sectors are threatened. There was once a time when it was hip to talk about Appalachian coal miners or rust belt foundry workers learning to code, secure with a smug smirk and the knowledge those people will never learn to code. As someone who's had to sweat, freeze, ache or otherwise suffer for just about every dollar I've ever touched I cannot lie to you and say that I am going to shed a lot of tears for white collar workers losing their jobs to AI. My personal sampling of these types has left a sour taste in my mouth, both in person and online. \n\nHowever, OP makes some valid points. I currently work in manufacturing, and specifically I work in manufacturing something that helps move goods. Our orders are way down. We're entering into a third round of layoffs next week. It breaks my heart to see these people go out the door. I think a lot of people tend to assume factory workers are all one kind of person so if you're a bleeding heart type let me give you some motivation: we provide not just stable pay but an opportunity for insurance and in some cases immigration paperwork that's contingent upon employment, we employ people in addiction recovery treatment, single moms and dads, teenagers fresh out of high school who's other options might be a whole lot worse get a shot at a career with us. But we make a product that moves goods. Fewer goods need to be moved, fewer units need to be made. Fewer units need to be made, fewer jobs where people get paid. So I really don't want to see whole sectors of well paid office jobs gutted where suddenly nobody needs their goods moved around because nobody can afford to buy them.",
    "can_gild": false,
    "can_mod_post": false,
    "collapsed": false,
    "collapsed_because_crowd_control": null,
    "collapsed_reason": null,
    "collapsed_reason_code": null,
    "comment_type": null,
    "controversiality": 0,
    "created": 1716689006,
    "created_utc": 1716689006,
    "distinguished": null,
    "downs": 0,
    "edited": false,
    "gilded": 0,
    "gildings": {},
    "id": "l5owvmh",
    "is_submitter": false,
    "likes": null,
    "link_id": "t3_1d0hff2",
    "locked": false,
    "mod_note": null,
    "mod_reason_by": null,
    "mod_reason_title": null,
    "mod_reports": [],
    "name": "t1_l5owvmh",
    "no_follow": true,
    "num_reports": null,
    "parent_id": "t3_1d0hff2",
    "permalink": "/r/ChatGPT/comments/1d0hff2/psa_if_white_collar_workers_lose_their_jobs/l5owvmh/",
    "removal_reason": null,
    "replies": "",
    "report_reasons": null,
    "retrieved_on": 1716689021,
    "saved": false,
    "score": 0,
    "score_hidden": false,
    "send_replies": true,
    "stickied": false,
    "subreddit": "ChatGPT",
    "subreddit_id": "t5_7hqomg",
    "subreddit_name_prefixed": "r/ChatGPT",
    "subreddit_type": "public",
    "top_awarded_type": null,
    "total_awards_received": 0,
    "treatment_tags": [],
    "unrepliable_reason": null,
    "ups": 0,
    "user_reports": []
}