{
    "_meta": {
        "retrieved_2nd_on": 1716827658
    },
    "all_awardings": [],
    "approved_at_utc": null,
    "approved_by": null,
    "archived": false,
    "associated_award": null,
    "author": "godtrek",
    "author_flair_background_color": null,
    "author_flair_css_class": null,
    "author_flair_richtext": [],
    "author_flair_template_id": null,
    "author_flair_text": null,
    "author_flair_text_color": null,
    "author_flair_type": "text",
    "author_fullname": "t2_a860s",
    "author_is_blocked": false,
    "author_patreon_flair": false,
    "author_premium": false,
    "awarders": [],
    "banned_at_utc": null,
    "banned_by": null,
    "body": "Imagine a future where AI is in emulator's and can take the game's code and art assets and train on it quickly, and be able to remix the game to create new stories or expand. Like, I LOVE Majora's Mask. One of my favorite games of all time. But imagine, if AI can go into the ROM and just add new dungeons, add new lands and stories and characters? Imagine having an endless amount of Mario 64 levels to play through? \n\nFor me, my biggest wet dream would to feed an AI the original Animal Crossing: Population Growing GameCube ROM and instruct an AI to flesh it out to have the same features as New Horizons, so I can terraform and do other cool shit. Make me brand new villagers, and make it so conversing with Villagers isn't pre-written dialogue in dialogue trees, but instead make it so each villager has memories and you can build genuine friendships with them, have them say new things all of the time, constantly populate the game with a never ending selections of brand new funiture or brand new K.K. Slider tracks.\n\nBasically, I just want Animal Crossing but Dungeon Master AI where it generates an experience around me that always evolves and reacts to my actions and what I say. Make it so the world actually exists when I'm not playing, so when I come back after not playing for a week, the villagers kept living their lives and I missed it when the villagers were into some fad for a week haha. \n\nto me, this is the natural progression in game develpment. Instead of guardrail pre-written scenarios, it's virtually boundless and endlessly explorable with genuinely active NPC's that also react to the world around them like I am and the game treats NPC's like the player, so if a Villager wants the world to change in some way like the player, it will so it will always sort of feel like a subtle competition of ideas meshing together in a soup to create a universe that feels very real to the player because a big part of playing a game isn't being totally in control over the experience, it's about experiencing the experience as it's presented to you, giving you ample time to navigate and solve puzzles to get things you want. \n\nNintendo however, is NOT the company to be doing this for a very very very long time. Nintendo is probably the most backward thinking game company on the planet. They often times take an absurd amount of time to cave in to what players are all ready getting from the competition, and often times it's a significantly worse experience because they have to do it the \"Nintendo way\". Which is almost always from the perspective of a toy company and not a game company. \n\nWe are going to get this level of AI one day, I have faith. However, when it rolls around you already know Nintendo won't touch it for like 10 years and when they do it will be so disgustingly neutered it will be pointless when the entire industry has moved onto the future. The only saving grace Nintendo has is their IP and outside of that, it's all pure worse than everyone else. So, I see the best experiences being experienced in emulators as the emulation community couldn't give a rat's ass what Nintendo wants and the emulation community has a long history of improving Nintendo games.",
    "can_gild": false,
    "can_mod_post": false,
    "collapsed": false,
    "collapsed_because_crowd_control": null,
    "collapsed_reason": null,
    "collapsed_reason_code": null,
    "comment_type": null,
    "controversiality": 0,
    "created": 1716698048,
    "created_utc": 1716698048,
    "distinguished": null,
    "downs": 0,
    "edited": false,
    "gilded": 0,
    "gildings": {},
    "id": "l5pe4vi",
    "is_submitter": false,
    "likes": null,
    "link_id": "t3_1d0t9tu",
    "locked": false,
    "mod_note": null,
    "mod_reason_by": null,
    "mod_reason_title": null,
    "mod_reports": [],
    "name": "t1_l5pe4vi",
    "no_follow": true,
    "num_reports": null,
    "parent_id": "t3_1d0t9tu",
    "permalink": "/r/ChatGPT/comments/1d0t9tu/im_excited_for_more_ai_in_video_games/l5pe4vi/",
    "removal_reason": null,
    "replies": "",
    "report_reasons": null,
    "retrieved_on": 1716698066,
    "saved": false,
    "score": 0,
    "score_hidden": false,
    "send_replies": true,
    "stickied": false,
    "subreddit": "ChatGPT",
    "subreddit_id": "t5_7hqomg",
    "subreddit_name_prefixed": "r/ChatGPT",
    "subreddit_type": "public",
    "top_awarded_type": null,
    "total_awards_received": 0,
    "treatment_tags": [],
    "unrepliable_reason": null,
    "ups": 0,
    "user_reports": []
}