{
    "_meta": {
        "retrieved_2nd_on": 1716867525
    },
    "all_awardings": [],
    "approved_at_utc": null,
    "approved_by": null,
    "archived": false,
    "associated_award": null,
    "author": "bishtap",
    "author_flair_background_color": null,
    "author_flair_css_class": null,
    "author_flair_richtext": [],
    "author_flair_template_id": null,
    "author_flair_text": null,
    "author_flair_text_color": null,
    "author_flair_type": "text",
    "author_fullname": "t2_69809ikl",
    "author_is_blocked": false,
    "author_patreon_flair": false,
    "author_premium": false,
    "awarders": [],
    "banned_at_utc": null,
    "banned_by": null,
    "body": "I would hope so. But the flaws I run into when using ChatGPT to understand scientific concepts are probably similar to if one were to ask it about history. .\nI am just looking at high school and some undergrad level chemistry, which I think is a mile away from doing anything seriously harmful. A lot of high school science in chemistry is baloney ancient irrelevant scientific theories anyway. Real modern chemistry is more complex than the BS in school books.  \n\nSo the annoyances with AI re science that I run into is not deliberate . It comes down to I think the AI developers not wanting to get into copyright problems. So it changes words. As well as not having strong reasoning built in.. if it did then it'd have a heap of questions to resolve contradictions in training data. But the reasoning is improving. \n\nGoogle AI, run by Demi Hassabi is very sane. They weren't the first to release an AI chat bot. Microsoft were the idiots that did that.\n\nThey have great projects to help scientific endeavours. \n\nThere is a conspiracy that we are lumbered with something that started life as a chatbot and however much it develops, and however amazing it gets, is fundamentally a glorified chatbot, like a sales person.  So instead of an AI that is like Mr Spock, we get the opposite. \n\nThis might change because online education companies like khan academy will want that improved so it doesn't make stupid mistakes. And tech companies will work with them. I don't think we are going to be forever lumbered with an AI that is dodgy at school subjects but good at programming. \n\nI do hope they are conspiring to help remove the dangers but I am not hopeful.  \n\nAI + Jihad groups is a massive hazard. Besides the kid in a garage. \n\nAnd robotics developments + AI. \n\nThe nukes problem is there are already bad actors  that know how to build nukes... I know a guy working very high level in chemistry that said there were a lot of Iranian nationals getting into chemistry and going back to Iran, and it's a hazard but what can he do. \n\nThe AI might have a safeguard to detect Nuke related questions and not answer.  But I think the issues I run into are from AI evading copyright and so not able to present precise language from its sources.\n\nBut they better be conspiring to keep it safer!",
    "can_gild": false,
    "can_mod_post": false,
    "collapsed": false,
    "collapsed_because_crowd_control": null,
    "collapsed_reason": null,
    "collapsed_reason_code": null,
    "comment_type": null,
    "controversiality": 0,
    "created": 1716737918,
    "created_utc": 1716737918,
    "distinguished": null,
    "downs": 0,
    "edited": false,
    "gilded": 0,
    "gildings": {},
    "id": "l5r9dpm",
    "is_submitter": false,
    "likes": null,
    "link_id": "t3_1d0mcpn",
    "locked": false,
    "mod_note": null,
    "mod_reason_by": null,
    "mod_reason_title": null,
    "mod_reports": [],
    "name": "t1_l5r9dpm",
    "no_follow": true,
    "num_reports": null,
    "parent_id": "t1_l5qgob1",
    "permalink": "/r/ChatGPT/comments/1d0mcpn/is_private_tutoring_going_to_disappear_soon/l5r9dpm/",
    "removal_reason": null,
    "replies": "",
    "report_reasons": null,
    "retrieved_on": 1716737933,
    "saved": false,
    "score": 1,
    "score_hidden": false,
    "send_replies": true,
    "stickied": false,
    "subreddit": "ChatGPT",
    "subreddit_id": "t5_7hqomg",
    "subreddit_name_prefixed": "r/ChatGPT",
    "subreddit_type": "public",
    "top_awarded_type": null,
    "total_awards_received": 0,
    "treatment_tags": [],
    "unrepliable_reason": null,
    "ups": 1,
    "user_reports": []
}