{
    "_meta": {
        "retrieved_2nd_on": 1716871231
    },
    "all_awardings": [],
    "approved_at_utc": null,
    "approved_by": null,
    "archived": false,
    "associated_award": null,
    "author": "send-moobs-pls",
    "author_flair_background_color": null,
    "author_flair_css_class": null,
    "author_flair_richtext": [],
    "author_flair_template_id": null,
    "author_flair_text": null,
    "author_flair_text_color": null,
    "author_flair_type": "text",
    "author_fullname": "t2_v6y9xwqp8",
    "author_is_blocked": false,
    "author_patreon_flair": false,
    "author_premium": false,
    "awarders": [],
    "banned_at_utc": null,
    "banned_by": null,
    "body": "I'm gonna try to be general here but, the main thing you need to know is - break it down. AI does better the more specific and contained the job is. We are not at the point where you go up to Chat GPT and say \"Give me a paper/essay/novel/program\" etc. \n\nYou need to follow the usual process if you want good results. For writing that means you do not just ask it to write. Forget writing and go higher in the process, but actually go higher than whatever you just imagined when I said that. \n\nYou start as far back as possible. Define the concept, refine it. Ask AI to evaluate the topic, consider pros and cons, consider tweaking or different directions. Make the AI work with you on creating an outline and a plan - see what I'm getting at with \"the usual process?\".\n\nFigure out what major aspects you want, then what those aspects will need. Plan the sections of a paper, the architecture. Plan for data and sources (** do not ask AI to just include a source. It will hallucinate if not used properly. Ask it to determine what kind of sources would be good, where to find them, give it a source and let it evaluate **)\n\nThen you can start having it do actual writing. One step at a time! And you should still plan to evaluate and ask for edits where needed. The results you will get when asking for a 2 paragraph section, with a focused topic and knowledge of the overall plan, giving it a source to reference, is immensely better than what people get when they try to create 8 paragraphs in a single prompt. \n\nIn the end, AI can save you huge amounts of time and make really good work. But it's not magic. Think of yourself as a teacher/advisor/editor, guiding the AI through the process. It can do most of the raw effort but you are the project leader, you are responsible for making sure that the AI has things broken down into strategic tasks, and for setting your \"team\" up with a good architecture/plan that will allow the pieces to come together well.",
    "can_gild": false,
    "can_mod_post": false,
    "collapsed": false,
    "collapsed_because_crowd_control": null,
    "collapsed_reason": null,
    "collapsed_reason_code": null,
    "comment_type": null,
    "controversiality": 0,
    "created": 1716741617,
    "created_utc": 1716741617,
    "distinguished": null,
    "downs": 0,
    "edited": false,
    "gilded": 0,
    "gildings": {},
    "id": "l5rj5in",
    "is_submitter": false,
    "likes": null,
    "link_id": "t3_1d13ibh",
    "locked": false,
    "mod_note": null,
    "mod_reason_by": null,
    "mod_reason_title": null,
    "mod_reports": [],
    "name": "t1_l5rj5in",
    "no_follow": true,
    "num_reports": null,
    "parent_id": "t3_1d13ibh",
    "permalink": "/r/ChatGPT/comments/1d13ibh/how_to_write_a_research_paper_using_ai/l5rj5in/",
    "removal_reason": null,
    "replies": "",
    "report_reasons": null,
    "retrieved_on": 1716741634,
    "saved": false,
    "score": 2,
    "score_hidden": false,
    "send_replies": true,
    "stickied": false,
    "subreddit": "ChatGPT",
    "subreddit_id": "t5_7hqomg",
    "subreddit_name_prefixed": "r/ChatGPT",
    "subreddit_type": "public",
    "top_awarded_type": null,
    "total_awards_received": 0,
    "treatment_tags": [],
    "unrepliable_reason": null,
    "ups": 2,
    "user_reports": []
}