{
    "_meta": {
        "retrieved_2nd_on": 1716875645
    },
    "all_awardings": [],
    "approved_at_utc": null,
    "approved_by": null,
    "archived": false,
    "associated_award": null,
    "author": "PhoneRoutine",
    "author_flair_background_color": null,
    "author_flair_css_class": null,
    "author_flair_richtext": [],
    "author_flair_template_id": null,
    "author_flair_text": null,
    "author_flair_text_color": null,
    "author_flair_type": "text",
    "author_fullname": "t2_qravwuy",
    "author_is_blocked": false,
    "author_patreon_flair": false,
    "author_premium": false,
    "awarders": [],
    "banned_at_utc": null,
    "banned_by": null,
    "body": "When I find these statements, I just feel how short sighted everyone is. Look back a few decades. We had immense technology development. Pre-internet, pre-Web 2.0, pre-mobile was a totally different world. Just take this platform alone. Today everyone across the world is sharing ideas on this platform on the latest thing. It was unheard of few couple of decades ago. It would take years, literally years for technology to move from one country to another. Let alone be used, and then feedback shared with people.\n\nEven in engineering - once every engineering drawing was made by hand, every microprocessor design was done by hand. Today computers do all of that and while in theory you can do it yourself, you can't run a business if you don't have computers.\n\nThe same scare people are giving about AI was the same scare people said about computers. Yes, computers took those jobs, but we just moved on to the next level. I remember in early 2000s bank clerks in India agitating and having multiple strikes to stop computers from being used in banks. In today's world, if your bank doesn't have computers, you can't operate a bank. \n\nWhen I joined the R&D team 20 yrs back, we had Solidworks Simulation software. Whenever I designed my part, my boss would force me to do manual load calculations on paper and show him the deflection and breaking point. I knew the equation but I would run the simulation in SW and back calculate based on the SW answer. Even 20 yrs back, this was happening. I'm sure my boss knew but this practice made sure I was very aware of all the things and I'm not being complacent and be fooled by the black box calculation that SW simulation did.\n\nYou need to understand the reasoning and logic behind how things work but still use the latest tools to ensure you are ahead of the curve. That's how we progress.",
    "can_gild": false,
    "can_mod_post": false,
    "collapsed": false,
    "collapsed_because_crowd_control": null,
    "collapsed_reason": null,
    "collapsed_reason_code": null,
    "comment_type": null,
    "controversiality": 0,
    "created": 1716746035,
    "created_utc": 1716746035,
    "distinguished": null,
    "downs": 0,
    "edited": false,
    "gilded": 0,
    "gildings": {},
    "id": "l5ruxhf",
    "is_submitter": false,
    "likes": null,
    "link_id": "t3_1d0c0w2",
    "locked": false,
    "mod_note": null,
    "mod_reason_by": null,
    "mod_reason_title": null,
    "mod_reports": [],
    "name": "t1_l5ruxhf",
    "no_follow": true,
    "num_reports": null,
    "parent_id": "t3_1d0c0w2",
    "permalink": "/r/ChatGPT/comments/1d0c0w2/chat_gpt_is_really_scary/l5ruxhf/",
    "removal_reason": null,
    "replies": "",
    "report_reasons": null,
    "retrieved_on": 1716746050,
    "saved": false,
    "score": 1,
    "score_hidden": false,
    "send_replies": true,
    "stickied": false,
    "subreddit": "ChatGPT",
    "subreddit_id": "t5_7hqomg",
    "subreddit_name_prefixed": "r/ChatGPT",
    "subreddit_type": "public",
    "top_awarded_type": null,
    "total_awards_received": 0,
    "treatment_tags": [],
    "unrepliable_reason": null,
    "ups": 1,
    "user_reports": []
}