{
    "_meta": {
        "is_edited": true,
        "retrieved_2nd_on": 1716895199
    },
    "all_awardings": [],
    "approved_at_utc": null,
    "approved_by": null,
    "archived": false,
    "associated_award": null,
    "author": "RickDripps",
    "author_flair_background_color": null,
    "author_flair_css_class": null,
    "author_flair_richtext": [],
    "author_flair_template_id": null,
    "author_flair_text": null,
    "author_flair_text_color": null,
    "author_flair_type": "text",
    "author_fullname": "t2_5l93v",
    "author_is_blocked": false,
    "author_patreon_flair": false,
    "author_premium": false,
    "awarders": [],
    "banned_at_utc": null,
    "banned_by": null,
    "body": "So using ChatGPT, I usually paste methods into it and work from there.  I never use Claude but if I was looking at it from a ChatGPT perspective, you've given too much information up front and asked for the resolution.  This isn't something AI is really exceptional at yet.\n\nIf you're trying to troubleshoot the entire workflow between several different classes then it'll fall back to giving generic tips instead of trying to actually dive into your specific scenario.\n\nThe better approach is to give it a method or a class per prompt and let it get \"up to speed\" on what's happening.  If you don't want to explain the code then you can do something like this:\n\n>I have this class/method and I would like to make changes to it/it's not working well/I am getting an error...  \n`Paste dump of the entire class or method, assuming it's not too large for the prompt.`\nDoes this make sense to you so far?\n\nThen let it observe and comprehend and puke back some useless info you already know to make sure it understands it correctly.  Then add another class or other methods in the second prompt and do all of that until you've gotten a response on how it all looks/works.  I do this a lot with my Data Class and Services (and Controllers when applicable too).  Look at it exactly like you're helping it build its understanding of all the code you're feeding it.  Because that is precisely what is happening.  It's a conversation with someone to get your problems solved. \n\nThen you start describing the problem and what you'd like to correct/change.\n\nIn my experiences, attaching files for the AI is for really large things that you don't want to dig through so that you can ask the AI for information on it.  Not a \"Here's a class, now let's work on it together.\" scenarios.  I've had infinitely better luck not attaching code files at all and just working through it like you're asking a Junior dev that just happens to have a tremendous amount of surface-level knowledge from going through the documentation on everything.\n\nIt's incredibly helpful but not smart enough to do everything we need to solve something deeper.  Off-by-one errors or looking for potential exception scenarios are absolutely within its wheelhouse.  But if you've got something that potentially has 5-10 code adjustments at once then you'll have to do them one-by-one with the AI.\n\nI do honestly hope this helps man.  It's a fantastic tool but it's absolutely still got many limitations for complex issues that we face as developers.  One AI gets past those, though...  We're screwed.",
    "can_gild": false,
    "can_mod_post": false,
    "collapsed": false,
    "collapsed_because_crowd_control": null,
    "collapsed_reason": null,
    "collapsed_reason_code": null,
    "comment_type": null,
    "controversiality": 0,
    "created": 1716765590,
    "created_utc": 1716765590,
    "distinguished": null,
    "downs": 0,
    "edited": false,
    "gilded": 0,
    "gildings": {},
    "id": "l5t7ogn",
    "is_submitter": false,
    "likes": null,
    "link_id": "t3_1d1beeb",
    "locked": false,
    "mod_note": null,
    "mod_reason_by": null,
    "mod_reason_title": null,
    "mod_reports": [],
    "name": "t1_l5t7ogn",
    "no_follow": true,
    "num_reports": null,
    "parent_id": "t1_l5t2ryg",
    "permalink": "/r/ChatGPT/comments/1d1beeb/so_is_everyone_that_claims_ai_is_great_for/l5t7ogn/",
    "removal_reason": null,
    "replies": "",
    "report_reasons": null,
    "retrieved_on": 1716765604,
    "saved": false,
    "score": 26,
    "score_hidden": false,
    "send_replies": true,
    "stickied": false,
    "subreddit": "ChatGPT",
    "subreddit_id": "t5_7hqomg",
    "subreddit_name_prefixed": "r/ChatGPT",
    "subreddit_type": "public",
    "top_awarded_type": null,
    "total_awards_received": 0,
    "treatment_tags": [],
    "unrepliable_reason": null,
    "ups": 26,
    "user_reports": []
}