{
    "_meta": {
        "retrieved_2nd_on": 1716904924
    },
    "all_awardings": [],
    "approved_at_utc": null,
    "approved_by": null,
    "archived": false,
    "associated_award": null,
    "author": "starcoll3ctor",
    "author_flair_background_color": null,
    "author_flair_css_class": null,
    "author_flair_richtext": [],
    "author_flair_template_id": null,
    "author_flair_text": null,
    "author_flair_text_color": null,
    "author_flair_type": "text",
    "author_fullname": "t2_10xet14xls",
    "author_is_blocked": false,
    "author_patreon_flair": false,
    "author_premium": false,
    "awarders": [],
    "banned_at_utc": null,
    "banned_by": null,
    "body": "A factual invasion of privacy (at least for US customers) I don't care if it's encrypted, I don't care if it could be \"toggled off\" (if you can toggle it off they can toggle it on, potentially without it showing on your screen). \n\nI don't care if it's saved locally or uploaded to the most highly encrypted storage server ever known to human beings, clearly said it's for research purposes which means either somebody alive or an AI will read it. Anybody who thinks it will not be looking for certain keywords to invade your privacy is clueless.\n\nYOU DO NOT NEED \"SOMETHING TO HIDE\" TO EXPECT AND DEMAND PRIVACY, AS IS GUARANTEED TO ALL US CITIZENS WITHIN THE US. A human beings right to privacy is not up to their government, AS You're born with that right end of story. I haven't trusted Mr Gates for years and now this is another reason to boycott Microsoft. I'm doing some research to find out what Linux build will be best for me and I will have it installed within a month. Thankfully neither of my PCs seem to have this feature yet, plus my desktop has hardly been used since I had it built and I screen every update as I always have. It may only be co-pilot plus PCs for now but eventually I'm sure it will be in all Microsoft PC's. Actually now that they see the backlash albeit on a much smaller level than it should be on, they probably won't be so public about it being installed and everyone else's PC's next time... But they will never get this software or anything even remotely similar to it on a device I OWN. \n\nBTW in case anyone doesn't know The terms of service for Windows tells you Microsoft can BAN YOU from any one of their services or applications if you do something they don't like, most likely based off of keywords or trigger words etc. including live meetings with coworkers and private meetings with friends and family. In order to ban you in response to something you say or do with means they are always watching, otherwise how can they ban you? Hmmm Not sure about the exact wording Go check it out yourself.\n\nLet's just say anyone who knowingly lets themselves acquire a PC with this feature is obviously clueless about the ways it could be abused. As if we really think there's any billionaires out there that give a crap about our rights. 🤣 I hope nobody really thinks that because they don't. No amount of public announcements saying \"your privacy will be respected\" means anything, because they could do whatever they want and they have the power, connections AKA authority, and team of lawyers to defend themselves, where as the average person does not. So as usual the rich will do as they please and you won't be able to do nothing about it. Except not install it be clued in and awake, and/or do not buy a co-pilot plus PC.\n\nDown with the idea of copilot+ Recall. It's your device you pay for it outright and you own it. The only way they have leverage over you is because Windows is \"licensed to you\"  etc, BUT YOUR HARDWARE IS YOURS!! Install Linux and learn how to use it. \n\nDon't trust Bill Gates when he says it can be opted out of or toggle off. That'll be the famous last words before people's lives are giving up to an AI database without them knowing.",
    "can_gild": false,
    "can_mod_post": false,
    "collapsed": false,
    "collapsed_because_crowd_control": null,
    "collapsed_reason": null,
    "collapsed_reason_code": null,
    "comment_type": null,
    "controversiality": 0,
    "created": 1716775314,
    "created_utc": 1716775314,
    "distinguished": null,
    "downs": 0,
    "edited": false,
    "gilded": 0,
    "gildings": {},
    "id": "l5tt26v",
    "is_submitter": false,
    "likes": null,
    "link_id": "t3_1cx6tr3",
    "locked": false,
    "mod_note": null,
    "mod_reason_by": null,
    "mod_reason_title": null,
    "mod_reports": [],
    "name": "t1_l5tt26v",
    "no_follow": true,
    "num_reports": null,
    "parent_id": "t3_1cx6tr3",
    "permalink": "/r/ChatGPT/comments/1cx6tr3/i_find_instant_recall_and_realtime_live/l5tt26v/",
    "removal_reason": null,
    "replies": "",
    "report_reasons": null,
    "retrieved_on": 1716787667,
    "saved": false,
    "score": 1,
    "score_hidden": false,
    "send_replies": true,
    "stickied": false,
    "subreddit": "ChatGPT",
    "subreddit_id": "t5_7hqomg",
    "subreddit_name_prefixed": "r/ChatGPT",
    "subreddit_type": "public",
    "top_awarded_type": null,
    "total_awards_received": 0,
    "treatment_tags": [],
    "unrepliable_reason": null,
    "ups": 1,
    "user_reports": []
}