{
    "_meta": {
        "retrieved_2nd_on": 1716948906
    },
    "all_awardings": [],
    "approved_at_utc": null,
    "approved_by": null,
    "archived": false,
    "associated_award": null,
    "author": "Pianol7",
    "author_flair_background_color": null,
    "author_flair_css_class": null,
    "author_flair_richtext": [],
    "author_flair_template_id": null,
    "author_flair_text": null,
    "author_flair_text_color": null,
    "author_flair_type": "text",
    "author_fullname": "t2_9xy1gqrb",
    "author_is_blocked": false,
    "author_patreon_flair": false,
    "author_premium": false,
    "awarders": [],
    "banned_at_utc": null,
    "banned_by": null,
    "body": "First, you need a therapist, absolutely 100% you need to get one, no question about that. If your trajectory is going down, and nobody and nothing is able to change that, then you need a therapist asap.\n\nTwo, I’m using ChatGPT the same way you are using, throwing every single emotions at it, processing them, no matter how ridiculous they are. But, you need a therapist to teach you how to process them, and ChatGPT is an amazing tool to help you implement those techniques. Generate 50 daily affirmations for mornings? Boom done. Reframe my negative thoughts? Boom done. Use the IFS system to help identify my inner voice? ChatGPT will handhold me and give me good suggestions based on my feedback. Roleplay as my inner critic, and help me response to the inner critic. I will describe my inner child to you, and you will roleplay as that inner child, I want to talk to him. etc etc.\n\nChatgpt isn’t going to come up with these techniques. If you ask it for advice, it will just say exactly what you’ve been receiving: mindfulness, deep breathing, hobbies, breaking down into small tasks…. My goodness I’ve heard these a thousand times already. You need a therapist to actually diagnose you and give specific treatments for your mental illness, and you use ChatGPT as a tool to help with the treatment. ADHD, grief, depression, anhedonia, whatever it is…. They need specific treatment, that’s tailored to you. ChatGPT isn’t gonna do that, a therapist will.\n\nWhat ChatGPT is really good at is processing my emotions, I can just blabber on about some vague feelings, and its good at summarising and making sense of it, and it’s made me much better at articulating and understanding my own emotions.\n\nChatGPT also has knowledge about therapy techniques (IFS is one of them that I really love), but it’s not a good therapist. But, if you have a technique, and describe that to ChatGPT, it can help you navigate those techniques much better than just filling up worksheets from a therapist. It’s a great sounding board.\n\nYou’re cooked but the cooking is reversible. Good luck bro.",
    "can_gild": false,
    "can_mod_post": false,
    "collapsed": false,
    "collapsed_because_crowd_control": null,
    "collapsed_reason": null,
    "collapsed_reason_code": null,
    "comment_type": null,
    "controversiality": 0,
    "created": 1716819294,
    "created_utc": 1716819294,
    "distinguished": null,
    "downs": 0,
    "edited": false,
    "gilded": 0,
    "gildings": {},
    "id": "l5vvhd3",
    "is_submitter": false,
    "likes": null,
    "link_id": "t3_1d1qitj",
    "locked": false,
    "mod_note": null,
    "mod_reason_by": null,
    "mod_reason_title": null,
    "mod_reports": [],
    "name": "t1_l5vvhd3",
    "no_follow": true,
    "num_reports": null,
    "parent_id": "t3_1d1qitj",
    "permalink": "/r/ChatGPT/comments/1d1qitj/am_i_cooked/l5vvhd3/",
    "removal_reason": null,
    "replies": "",
    "report_reasons": null,
    "retrieved_on": 1716819312,
    "saved": false,
    "score": 6,
    "score_hidden": false,
    "send_replies": true,
    "stickied": false,
    "subreddit": "ChatGPT",
    "subreddit_id": "t5_7hqomg",
    "subreddit_name_prefixed": "r/ChatGPT",
    "subreddit_type": "public",
    "top_awarded_type": null,
    "total_awards_received": 0,
    "treatment_tags": [],
    "unrepliable_reason": null,
    "ups": 6,
    "user_reports": []
}