{
    "_meta": {
        "is_edited": true,
        "retrieved_2nd_on": 1717012433
    },
    "all_awardings": [],
    "approved_at_utc": null,
    "approved_by": null,
    "archived": false,
    "associated_award": null,
    "author": "Quiet-Money7892",
    "author_flair_background_color": null,
    "author_flair_css_class": null,
    "author_flair_richtext": [],
    "author_flair_template_id": null,
    "author_flair_text": null,
    "author_flair_text_color": null,
    "author_flair_type": "text",
    "author_fullname": "t2_9uany3f5",
    "author_is_blocked": false,
    "author_patreon_flair": false,
    "author_premium": false,
    "awarders": [],
    "banned_at_utc": null,
    "banned_by": null,
    "body": "Can not talk of my opinion CP. Both because I am unsure of what is bannable and what is not and because I have never seen such researches, except for speculations, but I can tell of my experience with AI ERP, that may connect to this theme. Downvote me if you may.\n\nFirst - It can get highly addictive. I started using AI for writing (starting with NovelAI). What I realized later was how good AI can sometimes capture the most sick and crazy themes and fetishes. After realization hit me - I tried all I could think of. Over the term of half a year I spent almost 800 dollars on both GPT-4 and Claude API. (Of course, smaller half of it was spent on work. But the problem is - just the smaller half.) For now I feel that itbis under control. All the hype have run out, as well as my fantasy. At some things I hit a ceiling of AI capabilities and have not spent a coin on it for several months at least.\n\nSecond - We still don't have idea, what people actually should do with such people in general. This whole discussion reminds me of a stories of video games, that encourage people into violence. My psychiatrist told me once - addiction is what addicted people get. Which means - the problem is not that some psycho doing things on the internet. The problem is that this psycho will be afraid to ask for help and will marinate in his own problems, until it all explodes. I don't see how AI is any dreadful or helpful in this equation). Same I don't see how an absence of it is any helpful or dreadful. The absence of culture of dealing with such things, unless it is sending SWAT to the desperate sicko's house when they are in the middle of ruining their and possibly someone's other's life - is. And putting them in jail - makes situation even worse. I've seen this plenty of times.\n\nThird - As everything, it is inevitable. I'm not saying that you can't ban all such generations from the internet. I am saying that is now way to stop people from creating it. There is demand and there is proposition. Duscuss of eather lowering the demand by threatening or lowering the proposition by putting people into jails is an empty talk. Agressive strategy will only throw this demand further into illegal field. The best result of it is it becomes not the problem of AI companies since they will not be responsible for someone hacking their generations into doing inappropriate things. But the problem itself goes nowhere. And probably never will, while people still have their dopamine addicted monkey brains inside their heads.\n\nSorry if I sppoked some grammar nazis. Still learning English.",
    "can_gild": false,
    "can_mod_post": false,
    "collapsed": false,
    "collapsed_because_crowd_control": null,
    "collapsed_reason": null,
    "collapsed_reason_code": null,
    "comment_type": null,
    "controversiality": 1,
    "created": 1716882818,
    "created_utc": 1716882818,
    "distinguished": null,
    "downs": 0,
    "edited": false,
    "gilded": 0,
    "gildings": {},
    "id": "l5zvfar",
    "is_submitter": false,
    "likes": null,
    "link_id": "t3_1d25133",
    "locked": false,
    "mod_note": null,
    "mod_reason_by": null,
    "mod_reason_title": null,
    "mod_reports": [],
    "name": "t1_l5zvfar",
    "no_follow": true,
    "num_reports": null,
    "parent_id": "t3_1d25133",
    "permalink": "/r/ChatGPT/comments/1d25133/images_of_ai_kids_on_tiktok_and_instagram_are/l5zvfar/",
    "removal_reason": null,
    "replies": "",
    "report_reasons": null,
    "retrieved_on": 1716882837,
    "saved": false,
    "score": 3,
    "score_hidden": false,
    "send_replies": true,
    "stickied": false,
    "subreddit": "ChatGPT",
    "subreddit_id": "t5_7hqomg",
    "subreddit_name_prefixed": "r/ChatGPT",
    "subreddit_type": "public",
    "top_awarded_type": null,
    "total_awards_received": 0,
    "treatment_tags": [],
    "unrepliable_reason": null,
    "ups": 3,
    "user_reports": []
}