{
    "_meta": {
        "is_edited": true,
        "retrieved_2nd_on": 1717049436
    },
    "all_awardings": [],
    "approved_at_utc": null,
    "approved_by": null,
    "archived": false,
    "associated_award": null,
    "author": "Daekar3",
    "author_flair_background_color": null,
    "author_flair_css_class": null,
    "author_flair_richtext": [],
    "author_flair_template_id": null,
    "author_flair_text": null,
    "author_flair_text_color": null,
    "author_flair_type": "text",
    "author_fullname": "t2_10lonk",
    "author_is_blocked": false,
    "author_patreon_flair": false,
    "author_premium": false,
    "awarders": [],
    "banned_at_utc": null,
    "banned_by": null,
    "body": "It's not really their fault, there are really two problems that are blinding them.\n\n1) They have been given incorrect information about what gives their creations economic value.  Their entire lives (or at least careers) they have been told that their creativity is what sets them apart from the crowd.  This is sometimes correct, for the truly great, but most of the time it's wrong.  What gives value to the output of most artists is the investment of time in developing skills involved in the creation process, and thus the opportunity cost of that time.  \n\nAs technology has changed over the past few centuries it has incrementally increased the ability of everyone to create artistic works in one way or another.  Woodblock prints made it possible for a single artist to reach people within the range of paper distribution of the time.  Standardized instruments available for sale meant that musicians were relieved of much of the burden of achieving quality of sound and let them focus on composition more than their forebears.  Photographs removed the need to learn to paint, emphasizing composition and technical acumen.  Studio developments in the 1950s through 1970s let musicians create sounds and mixes that were previously impossible or impractical.  Midi and sequencers removed the need to touch an instrument at all.  Photoshop removed the need to get things perfect in the lens and enabled multitudes of people to create things that didn't even exist.  Improved smartphone cameras freed everyone from almost all technical constraints of photography leaving composition as the primary differentiator.  3D printers made it so anyone who can figure out some CAD software is a sculptor now.\n\nThe point is that technology decreases the opportunity cost of pursuing any artistic endeavor because it decreases the time investment required to achieve any given outcome.  The AI tools of the last 5 years have largely removed the opportunity cost for creating all kinds of things, from images, writing, to music, and soon video.  This means that the number of people that can, and will, create their own art of any kind will increase drastically, and the inconvenient truth is that there are a whole lot more people who are creative than the artists thought.  When the moat of technical implementation of creativity is removed, it turns out there isn't much left to defend the artistic bastion.\n\n2) They think they'll always be better because in the past the moat of implementation friction hasn't been completely destroyed.  It got easier to make art (how many painters grind their own pigments?) but the opportunity cost was still high enough that most people elected to outsource their art creation to specialists.  Going only by past changes, they have plenty of reason to believe that they'll be correct - but this time is different.  \n\nIt's not that there won't be artists anymore, of course, but the vastly increased supply means that there will be fewer, and that the nature of their work will be different.  As the supply of art goes up, the value of each commoditized piece of art goes down - and in some cases practically approaches zero, like the value of a cute anime waifu picture that previously would have required a real human to spend significant time and effort on.",
    "can_gild": false,
    "can_mod_post": false,
    "collapsed": false,
    "collapsed_because_crowd_control": null,
    "collapsed_reason": null,
    "collapsed_reason_code": null,
    "comment_type": null,
    "controversiality": 0,
    "created": 1716919820,
    "created_utc": 1716919820,
    "distinguished": null,
    "downs": 0,
    "edited": false,
    "gilded": 0,
    "gildings": {},
    "id": "l622vjr",
    "is_submitter": false,
    "likes": null,
    "link_id": "t3_1d2h0p1",
    "locked": false,
    "mod_note": null,
    "mod_reason_by": null,
    "mod_reason_title": null,
    "mod_reports": [],
    "name": "t1_l622vjr",
    "no_follow": true,
    "num_reports": null,
    "parent_id": "t3_1d2h0p1",
    "permalink": "/r/ChatGPT/comments/1d2h0p1/imagining_being_surpassed_requires_creativity/l622vjr/",
    "removal_reason": null,
    "replies": "",
    "report_reasons": null,
    "retrieved_on": 1716919836,
    "saved": false,
    "score": 1,
    "score_hidden": false,
    "send_replies": true,
    "stickied": false,
    "subreddit": "ChatGPT",
    "subreddit_id": "t5_7hqomg",
    "subreddit_name_prefixed": "r/ChatGPT",
    "subreddit_type": "public",
    "top_awarded_type": null,
    "total_awards_received": 0,
    "treatment_tags": [],
    "unrepliable_reason": null,
    "ups": 1,
    "user_reports": []
}