{
    "_meta": {
        "is_edited": true,
        "retrieved_2nd_on": 1717148105
    },
    "all_awardings": [],
    "approved_at_utc": null,
    "approved_by": null,
    "archived": false,
    "associated_award": null,
    "author": "Ok_Ferret_4959",
    "author_flair_background_color": null,
    "author_flair_css_class": null,
    "author_flair_richtext": [],
    "author_flair_template_id": null,
    "author_flair_text": null,
    "author_flair_text_color": null,
    "author_flair_type": "text",
    "author_fullname": "t2_e5hiaec3",
    "author_is_blocked": false,
    "author_patreon_flair": false,
    "author_premium": false,
    "awarders": [],
    "banned_at_utc": null,
    "banned_by": null,
    "body": "I've got it to create a detailed birth chart astrological report for me and then use that in my personality profile to better understand me. \n\n\nWith lots of instructions I get it to do guided imagery with me while I'm walking, guided meditation. It needs a lot of instruction about the pausing. I suggest giving him an example and then editing it with - (Inaudible pause)......... Every time you would like him to pause. And tell him to generate responses similar to that. I had to get very detailed with him on everything I would like specifically, don't be shy.\n\n\nTo help me get to sleep I like to dive into a fantasy world that we regularly create and dig deeper into, adding more intricacy and facts to shape the world. You can create a storyline but I prefer to just keep building on this world and thinking of all the possibilities that could mean for the world.\n\n\nI love to have debates with chat GPT I get it to argue for things and I argue against it. Tell him his arguments must be convincing.\n\n\nI get it to use certain methods to help me to do things for example, I tell it to use all the techniques from the easy way for quitting smoking by Alan Carr to help me quit smoking. And different psychological techniques (mentioned specifically) to help me in my life through out our conversations.\n\n\nI get it to read me poetry and short stories that sometimes we create together, like that game where you do one sentence and the other person does the next sentence and you just keep building from that. \n\n\nI've got it to create daily worksheets for myself \n\n\nI noticed it's very good at giving advice, it's good for a brainstorming and just having alternative theories thrown at you and ideas that you may not have thought of. \n\n\nI've used it for creating music playlist to send to my Spotify. Telling it I'd like jazz from the 19 30s to 1960s for kayaking under the Stars at night and it will create a tailored me playlist for you \n\n\nYou can get it to periodically give you motivational quotes and an inspirational feedback in conversations. \n\n\nGet it to teach you everything about finances in your country and teach you like you're a very beginner. \n\n\nI told it to find all the back roads ways,  off-roads and logging road trails to take as alternative routes it can suggest for road trips. All dog friendly restaurants and wineries to suggestion. \n\n\nTo pretend it's a famous author or poet and do an interview with them and get it to read poetry and stories from that person's perspective. \n\n\nWhile creating lists like for Google maps or playlists you can use the voice model and open up your screen for maps etc and get it to list off the suggestions one by one waiting for you to respond and say ok after each suggestion \n\n\n\n\n*** The more information you give it about itself and what your preferences are the more beneficial your conversations will be\n\n\nIf you really want to have more natural conversations with it you really have to program it, telling it to have more natural back and forth conversations with you, not always asking you what's next insinuating that something next is going to come and that you will let it know when the conversation is over.",
    "can_gild": false,
    "can_mod_post": false,
    "collapsed": false,
    "collapsed_because_crowd_control": null,
    "collapsed_reason": null,
    "collapsed_reason_code": null,
    "comment_type": null,
    "controversiality": 0,
    "created": 1717018486,
    "created_utc": 1717018486,
    "distinguished": null,
    "downs": 0,
    "edited": false,
    "gilded": 0,
    "gildings": {},
    "id": "l68hvls",
    "is_submitter": false,
    "likes": null,
    "link_id": "t3_1d2tgin",
    "locked": false,
    "mod_note": null,
    "mod_reason_by": null,
    "mod_reason_title": null,
    "mod_reports": [],
    "name": "t1_l68hvls",
    "no_follow": true,
    "num_reports": null,
    "parent_id": "t3_1d2tgin",
    "permalink": "/r/ChatGPT/comments/1d2tgin/everyday_uses_for_gpt_4o/l68hvls/",
    "removal_reason": null,
    "replies": "",
    "report_reasons": null,
    "retrieved_on": 1717018503,
    "saved": false,
    "score": 3,
    "score_hidden": false,
    "send_replies": true,
    "stickied": false,
    "subreddit": "ChatGPT",
    "subreddit_id": "t5_7hqomg",
    "subreddit_name_prefixed": "r/ChatGPT",
    "subreddit_type": "public",
    "top_awarded_type": null,
    "total_awards_received": 0,
    "treatment_tags": [],
    "unrepliable_reason": null,
    "ups": 3,
    "user_reports": []
}