{
    "_meta": {
        "is_edited": true,
        "retrieved_2nd_on": 1717168085
    },
    "all_awardings": [],
    "approved_at_utc": null,
    "approved_by": null,
    "archived": false,
    "associated_award": null,
    "author": "314159265358979326",
    "author_flair_background_color": null,
    "author_flair_css_class": null,
    "author_flair_richtext": [],
    "author_flair_template_id": null,
    "author_flair_text": null,
    "author_flair_text_color": null,
    "author_flair_type": "text",
    "author_fullname": "t2_bc9m4qj",
    "author_is_blocked": false,
    "author_patreon_flair": false,
    "author_premium": false,
    "awarders": [],
    "banned_at_utc": null,
    "banned_by": null,
    "body": "Resume and cover letter writing. There's a GPT for each of those. Cover letters come naturally to it (at least as far as \"nature\" applies to AI). Resumes do not. I wrangled with it for about four hours, using old, professionally-approved resumes as source material. Now if I see a job I sort of want I can produce a high quality application in 2 or 3 minutes. For a job I really want, it's closer to 15 minutes as I tweak it quite a bit more. Before having all of this it was closer to 1-2 hours, so I didn't apply for the vast majority of jobs that would be an improvement over what I have now. I sent out 6 applications two weeks ago and I got called out of the blue for an interview this morning. 1 in 6 is pretty fucking good.\n\nNow, I have covid, so I felt I shouldn't do the interview. I explained it to the guy and we've agreed to reschedule it when I feel better. I wasn't sure if this was a good move, so I asked the interview GPT, and it reassured me. I've since been using Interview to practice for when I call him back.\n\nI'm working on an MBA that's graded exclusively on essays. In undergrad I never broke a B+ on an essay, with B or B- being typical. What I do now is do my research, write my essay, cite my sources, and then ask ChatGPT to evaluate it. I intentionally ignore any specific changes it recommends because I am worried about plagiarism accusations since the use of LLMs in education is the wild West right now. Things like \"add an example\" I'll follow. I was worried that I would become dependent on it, but the opposite has occurred: for my first few essays, it took 10+ feedback cycles to reach my desired quality, I can now do it in just one or two. I have learned to write good essays thanks to immediate feedback. My current essay average is 95%.\n\nI'm working on an Arduino project. It's helping me code and troubleshoot hardware. I'm not very good at using it for this yet. One major failure is that it always tries to do things on its own when there are libraries that already do it well. I just found out that there are Git-based GPTs that might actually use libraries. Going to try that soon.\n\nI use it for advertising purposes at work. I've generated advertising posters and slogans. Be careful here, because these are not copyrightable, where if I produced them on my own they would be. The posters are fairly obviously AI, because they're too detailed to be drawn by a human and not realistic enough to be photos. But if a competitor wants to steal our posters, I don't care. Slogans are impossible to tell from human-created, so for now I guess it's fine.\n\nI've asked it to help me shop for things on Amazon. I was also looking for a book earlier today for being organized at work; most search engines conflate \"organized\" with \"organization\", i.e. a place where someone works, and can't find shit. It actually suggested a book on ADHD that I'm very excited about.\n\nI used it for comparing one of our contracts from last year with a similar one from this year. It accurately found the differences and presented them to me. This was a low-stakes assignment worth a few thousand so I didn't really have to worry about hallucinations. I could have replied to my boss \"contract looks great\" without looking at it.\n\nI talked to a therapy GPT about my speech impediment and it was waaaay more helpful than it had any right to be.\n\nI'll use it to do preliminary research on a topic. Search engines only work if you know what words to use. I don't always, so ChatGPT can have me caught up on the lingo; it can't be trusted - yet - so I then have to do the actual research on my own.\n\nThere's so much you can do with it.",
    "can_gild": false,
    "can_mod_post": false,
    "collapsed": false,
    "collapsed_because_crowd_control": null,
    "collapsed_reason": null,
    "collapsed_reason_code": null,
    "comment_type": null,
    "controversiality": 0,
    "created": 1717037936,
    "created_utc": 1717037936,
    "distinguished": null,
    "downs": 0,
    "edited": false,
    "gilded": 0,
    "gildings": {},
    "id": "l69u3ge",
    "is_submitter": false,
    "likes": null,
    "link_id": "t3_1d3q2qr",
    "locked": false,
    "mod_note": null,
    "mod_reason_by": null,
    "mod_reason_title": null,
    "mod_reports": [],
    "name": "t1_l69u3ge",
    "no_follow": true,
    "num_reports": null,
    "parent_id": "t1_l69qnm5",
    "permalink": "/r/ChatGPT/comments/1d3q2qr/hardly_any_of_us_are_using_ai_tools_like_chatgpt/l69u3ge/",
    "removal_reason": null,
    "replies": "",
    "report_reasons": null,
    "retrieved_on": 1717037951,
    "saved": false,
    "score": 222,
    "score_hidden": false,
    "send_replies": true,
    "stickied": false,
    "subreddit": "ChatGPT",
    "subreddit_id": "t5_7hqomg",
    "subreddit_name_prefixed": "r/ChatGPT",
    "subreddit_type": "public",
    "top_awarded_type": null,
    "total_awards_received": 0,
    "treatment_tags": [],
    "unrepliable_reason": null,
    "ups": 222,
    "user_reports": []
}