{
    "_meta": {
        "removal_type": "deleted",
        "retrieved_2nd_on": 1717210283,
        "was_deleted_later": true
    },
    "all_awardings": [],
    "approved_at_utc": null,
    "approved_by": null,
    "archived": false,
    "associated_award": null,
    "author": "Stap_it",
    "author_flair_background_color": null,
    "author_flair_css_class": null,
    "author_flair_richtext": [],
    "author_flair_template_id": null,
    "author_flair_text": null,
    "author_flair_text_color": null,
    "author_flair_type": "text",
    "author_fullname": "t2_483bo",
    "author_is_blocked": false,
    "author_patreon_flair": false,
    "author_premium": false,
    "awarders": [],
    "banned_at_utc": null,
    "banned_by": null,
    "body": "I have been using it since GPT-3 came out. It is a game changer for coding. I was learning to code on my own for several years before going back to school for CS. GPT-3 released as I was starting my first semester. Living through the AI boom at school, it is clear my peers don't know how useful it really is. Everyone is hellbent on talking it down, saying it's \"dumb\". I feel like I'm living in an alternate reality.\n\nAs someone with adult ADHD, it has been so useful for brainstorming and getting through analysis paralysis or writer's block. I've used it for generating name ideas, giving ideas for code refactoring, I even had it walk me through using Unity (game engine), with just text. I've also used it for game design as someone to bounce ideas off of or come up with possible solutions to various issues. It helps me \"get going\" which has always been the hardest part for me.\n\nAs someone who is already an intermediate coder, I feel like I can get to any solution by using the correct lingo. I don't Google this stuff anymore. I can literally ask it about a concept, give me the big picture, and show me a real world example with code. This sort of thing used to take me hours just looking for example code of something similar to what I needed in some random Python GUI library.  I've even used it to ELI 20 years old.\n\nThere are times I know what to do... I have most of the logic written out but just can't think of the math part - it helps with that too. As it gets better with math, things will only get crazier. I've had it write really monotonous code for me as well. I give it an example of the format I want it to follow, like a template, and it does the busy work. It can comment code pretty well too if you give it instructions. It was very verbose with comments by default but does a good job keeping things concise when I tell it to. \n\nI worked in tech before and had a job that allowed me to jump disciplines in my down time. As a result I worked in Software/Firmware/Hardware QA for some big projects. I really firmly believe that the QA experience is helping me talk to AI more effectively. I got a lot of praise at work for writing repro steps in a way that anyone new to the project was able to hit the ground running. Being able to give it all the necessary info, formatting, and all the context necessary so that some poor noob doesn't have to talk to 3 different people and waste a bunch of time to just test something simple.\n\nSometimes I just feel like I'm wasting time at school, worrying about my poor test-taking abilities and the like. I always did well on the job but have PTSD from my previous school experiences. Now it feels like I'm learning how to do things in an obsolete manner. Part of me would just rather quit school and work on portfolio projects full time with the help of AI.\n\nI have a lot of ideas for incorporating AI into creative (art) workflows as well, but am acutely aware of the stigma. I've never been more confident about being a jack of all trades than I am now and I've seen friends with ADHD having similar experiences with AI.\n\nAnyways, sorry for the book. I'm half awake right now, I hope it was somewhat readable.",
    "can_gild": false,
    "can_mod_post": false,
    "collapsed": false,
    "collapsed_because_crowd_control": null,
    "collapsed_reason": null,
    "collapsed_reason_code": null,
    "comment_type": null,
    "controversiality": 0,
    "created": 1717080674,
    "created_utc": 1717080674,
    "distinguished": null,
    "downs": 0,
    "edited": false,
    "gilded": 0,
    "gildings": {},
    "id": "l6byvor",
    "is_submitter": false,
    "likes": null,
    "link_id": "t3_1d3q2qr",
    "locked": false,
    "mod_note": null,
    "mod_reason_by": null,
    "mod_reason_title": null,
    "mod_reports": [],
    "name": "t1_l6byvor",
    "no_follow": true,
    "num_reports": null,
    "parent_id": "t3_1d3q2qr",
    "permalink": "/r/ChatGPT/comments/1d3q2qr/hardly_any_of_us_are_using_ai_tools_like_chatgpt/l6byvor/",
    "removal_reason": null,
    "replies": "",
    "report_reasons": null,
    "retrieved_on": 1717080691,
    "saved": false,
    "score": 1,
    "score_hidden": false,
    "send_replies": true,
    "stickied": false,
    "subreddit": "ChatGPT",
    "subreddit_id": "t5_7hqomg",
    "subreddit_name_prefixed": "r/ChatGPT",
    "subreddit_type": "public",
    "top_awarded_type": null,
    "total_awards_received": 0,
    "treatment_tags": [],
    "unrepliable_reason": null,
    "ups": 1,
    "user_reports": []
}