{
    "_meta": {
        "retrieved_2nd_on": 1717281920
    },
    "all_awardings": [],
    "approved_at_utc": null,
    "approved_by": null,
    "archived": false,
    "associated_award": null,
    "author": "serafinawriter",
    "author_flair_background_color": null,
    "author_flair_css_class": null,
    "author_flair_richtext": [],
    "author_flair_template_id": null,
    "author_flair_text": null,
    "author_flair_text_color": null,
    "author_flair_type": "text",
    "author_fullname": "t2_w7tb3w57",
    "author_is_blocked": false,
    "author_patreon_flair": false,
    "author_premium": false,
    "awarders": [],
    "banned_at_utc": null,
    "banned_by": null,
    "body": "Musicians will probably be replaced in certain ways. Corporate music, background music for YouTube and social media content, and other places where there is a need for cheap or free music without much need for originality or high quality - all areas that are already starting to use AI created music. I could even see music streaming services creating original music based off your listening tastes, and there are probably people who listen to music in the background who won't care much. I sometimes listen to lo-fi stuff when working on my administrative stuff and it really wouldn't make a difference to me if it was human or AI created. \n\nBut it should be pretty obvious that musicians and composers are still irreplaceable in many areas. Live music being the most obvious one. \n\nI doubt people will stop wanting to hear real music made by real people either. Already we're starting to see musicians start to *show* their music writing and playing process, which not only is a way to prove that they create the music themselves, but it also serves to bring artist and listener closer together. In a way, the pressures of AI might even create a sort of renaissance of interest in music and the value of man-made art. \n\nAnd without wanting to sound elitist or gatekeepy, it's easy to think songwriters and composers can be replaced when someone isn't familiar with composition and music theory (and I don't just mean knowing how chords work etc., but the whole philosophy and study of music and its effect on psychology). To laypeople, the result of this is subconscious, but it's still important and I don't see the potential for AI to replicate this any time soon. \n\nAn example I often like to draw on is the soundtrack to Star Wars: A New Hope. Most people are familiar with the scene where Luke is standing under the setting twin suns, and John Williams's beautiful score painting a clear and bittersweet musical painting of Luke's yearning to escape Tatooine and his obligations to his aunt and uncle. That music becomes a motif that we subconsciously associate with feeling trapped and wanting to escape. \n\nThen, a bit later, Luke returns to find the Empire has destroyed his home and brutally killed his aunt and uncle. As he stands there in front of the burning farm, John Williams brings back that same musical motif of yearning to escape, but now it is much darker and tragic in tone. In a way, Luke has got what he was wanting so desperately, but at a terrible cost, and Williams's masterful use of restating and transforming music really drives that experience home to our soul. Again, it's not something you think about consciously whole watching, but it makes the moment so powerful. \n\nPersonally I don't see how AI can do this without essentially being an AGI on the level of a human.",
    "can_gild": false,
    "can_mod_post": false,
    "collapsed": false,
    "collapsed_because_crowd_control": null,
    "collapsed_reason": null,
    "collapsed_reason_code": null,
    "comment_type": null,
    "controversiality": 0,
    "created": 1717152308,
    "created_utc": 1717152308,
    "distinguished": null,
    "downs": 0,
    "edited": false,
    "gilded": 0,
    "gildings": {},
    "id": "l6ghuuk",
    "is_submitter": false,
    "likes": null,
    "link_id": "t3_1d4r8un",
    "locked": false,
    "mod_note": null,
    "mod_reason_by": null,
    "mod_reason_title": null,
    "mod_reports": [],
    "name": "t1_l6ghuuk",
    "no_follow": true,
    "num_reports": null,
    "parent_id": "t3_1d4r8un",
    "permalink": "/r/ChatGPT/comments/1d4r8un/have_we_surpassed_the_need_for_musicians/l6ghuuk/",
    "removal_reason": null,
    "replies": "",
    "report_reasons": null,
    "retrieved_on": 1717152325,
    "saved": false,
    "score": 1,
    "score_hidden": false,
    "send_replies": true,
    "stickied": false,
    "subreddit": "ChatGPT",
    "subreddit_id": "t5_7hqomg",
    "subreddit_name_prefixed": "r/ChatGPT",
    "subreddit_type": "public",
    "top_awarded_type": null,
    "total_awards_received": 0,
    "treatment_tags": [],
    "unrepliable_reason": null,
    "ups": 1,
    "user_reports": []
}