{
    "_meta": {
        "retrieved_2nd_on": 1717312839
    },
    "all_awardings": [],
    "approved_at_utc": null,
    "approved_by": null,
    "archived": false,
    "associated_award": null,
    "author": "Celeria_Andranym",
    "author_flair_background_color": null,
    "author_flair_css_class": null,
    "author_flair_richtext": [],
    "author_flair_template_id": null,
    "author_flair_text": null,
    "author_flair_text_color": null,
    "author_flair_type": "text",
    "author_fullname": "t2_i05e5",
    "author_is_blocked": false,
    "author_patreon_flair": false,
    "author_premium": false,
    "awarders": [],
    "banned_at_utc": null,
    "banned_by": null,
    "body": "Either I misunderstood you, or you are being daft. Of course the official app is using their own API. The difference is that there's no ads in the official app, for paid and free users alike. Furthermore, the cost is capped at 20 dollars a month, and generally there's been no \"trickery\" that I was able to see.\n\nFor randoms out there, they all pretend like either they are the original, or pretend it can do something that the normal GPT can't do, or can already do. And if I was to guess, they are almost certainly flooded with ads.\n\nTheir pricing is either \"unlimited access for a year for (suspiciously low price, but not that low compared to API), where it's almost certain they assume you lose interest far before you actually make them make a loss\" or even worse \"just straight up a scam price like 20 or more dollars a month for an identical at best but probably worse product\", which they get away with by tricking uninformed people, because as we all know, to someone whose never seen GPT in action before, it does seem rather miraculous in what it seems to be capable of, if you were the first to \"grab a consumer\" they could be paying 50 dollars a month without even noticing, and Google is getting their 30% cut of that for each sale. That's why Google has no incentive to remove even blatantly false apps, since they make money.\n\n\n\nThe craziest example of this I've seen out in the wild is the Samsung smartthings app. If you own a samsung tv (many do), they'll say \"get that app to control the tv with your phone\". Not a bad deal, especially if you lost the remote or etc. \n\nApparently, the #1 app on google play is literally a scam version of it, that somehow got away with being called \"Samsung SmartThings\". So you don't pay attention, download it. Once you open it and notice all the ads, anyone with a brain cell goes \"oh what the heck I downloaded a fake\", then you delete it, look around for the real one, and use it.\n\nSomehow, in the reviews there are people complaining about \"having to pay 20 dollars a month to access the remote on their phone when they already paid for the TV, and being like well, I guess it works, but the price seems a little high\", and then you realize \"wow there really is so much money to be made from idiots\".",
    "can_gild": false,
    "can_mod_post": false,
    "collapsed": false,
    "collapsed_because_crowd_control": null,
    "collapsed_reason": null,
    "collapsed_reason_code": null,
    "comment_type": null,
    "controversiality": 0,
    "created": 1717183227,
    "created_utc": 1717183227,
    "distinguished": null,
    "downs": 0,
    "edited": false,
    "gilded": 0,
    "gildings": {},
    "id": "l6iq5ya",
    "is_submitter": false,
    "likes": null,
    "link_id": "t3_1d4z1m5",
    "locked": false,
    "mod_note": null,
    "mod_reason_by": null,
    "mod_reason_title": null,
    "mod_reports": [],
    "name": "t1_l6iq5ya",
    "no_follow": true,
    "num_reports": null,
    "parent_id": "t1_l6idk24",
    "permalink": "/r/ChatGPT/comments/1d4z1m5/how_is_this_even_allowed/l6iq5ya/",
    "removal_reason": null,
    "replies": "",
    "report_reasons": null,
    "retrieved_on": 1717183243,
    "saved": false,
    "score": 37,
    "score_hidden": false,
    "send_replies": true,
    "stickied": false,
    "subreddit": "ChatGPT",
    "subreddit_id": "t5_7hqomg",
    "subreddit_name_prefixed": "r/ChatGPT",
    "subreddit_type": "public",
    "top_awarded_type": null,
    "total_awards_received": 0,
    "treatment_tags": [],
    "unrepliable_reason": null,
    "ups": 37,
    "user_reports": []
}