{
    "_meta": {
        "retrieved_2nd_on": 1717321164
    },
    "all_awardings": [],
    "approved_at_utc": null,
    "approved_by": null,
    "archived": false,
    "associated_award": null,
    "author": "letmeseem",
    "author_flair_background_color": null,
    "author_flair_css_class": null,
    "author_flair_richtext": [],
    "author_flair_template_id": null,
    "author_flair_text": null,
    "author_flair_text_color": null,
    "author_flair_type": "text",
    "author_fullname": "t2_pwhzii5",
    "author_is_blocked": false,
    "author_patreon_flair": false,
    "author_premium": false,
    "awarders": [],
    "banned_at_utc": null,
    "banned_by": null,
    "body": "No. And that is the precise problem I'm talking about. \"Anything that's currently known\" for someone who is interested in AI looks very differently than for someone who is actually building it.  \n\nThis is a very common problem in science though. The explanation model being believed to be the real thing by people who isn't involved.  \n\nHere's a few other examples you might be familiar with:  \n\nYou might believe atoms consist of a small, dense nucleus surrounded by orbiting electrons, analogous to the structure of the Solar System, but with attraction provided by electrostatic force rather than gravity, and with the electron energies quantized in discreet values and being confined to shells.  \n\nThis is the Rutherford -Bohr model, and it's only an explanation model. We use it because it makes it easy for students to understand how photons can be made, so most children are taught this model.  If you pursue physics after highschool though, you pretty quickly learn that this isn't anything remotely close to the real world, and a bit further into your education it becomes even weirder. Then you discover there are no shells at all, and there's really no evidence that there's more than one electron in the entire universe. I mean it would make SENSE if there were more, but there's actually no real evidence for more than one.  \n\nAlso, there's no time on that scale. No.. not that time has stopped. The whole concept of time doesn't exist on that scale. It can't. The real world looks NOTHING like the Rutherford -Bohr model most people think is actual science. Not a single physisist on the planet thinks so though, or anyone who has had a physics class in college for that matter.  \n\nAnother example involving Niels Bohr is Schrödingers cat.  \n\nMost people are familiar with the concept, but are not familiar with its actual intention. This was Edwin Schrödinger making fun of Bohr, Heisenberg, Born and a few others collected thoughts about the meaning of quantum mechanics, dubbed the Copenhagen interpretation.  \n\nA bit overly simplistic: they all saw it as necessary to see measurements and observations in the quantum physics as a part of classical physics. In a discussion with Einstein Schrödinger invented this example to show how ridiculous it would be to expect a Classical physics observations of the quantum mechanics,  and thereby transposing the concept of superposition into classical \"real world\" physics.  \n\nAgain the problem is time. It doesn't exist at a quantum level, so trying to understand or translate it to classical physics makes no sense.",
    "can_gild": false,
    "can_mod_post": false,
    "collapsed": false,
    "collapsed_because_crowd_control": null,
    "collapsed_reason": null,
    "collapsed_reason_code": null,
    "comment_type": null,
    "controversiality": 0,
    "created": 1717191540,
    "created_utc": 1717191540,
    "distinguished": null,
    "downs": 0,
    "edited": false,
    "gilded": 0,
    "gildings": {},
    "id": "l6jcwkr",
    "is_submitter": false,
    "likes": null,
    "link_id": "t3_1d4p1gm",
    "locked": false,
    "mod_note": null,
    "mod_reason_by": null,
    "mod_reason_title": null,
    "mod_reports": [],
    "name": "t1_l6jcwkr",
    "no_follow": true,
    "num_reports": null,
    "parent_id": "t1_l6j0f8k",
    "permalink": "/r/ChatGPT/comments/1d4p1gm/i_robot_then_vs_now/l6jcwkr/",
    "removal_reason": null,
    "replies": "",
    "report_reasons": null,
    "retrieved_on": 1717191557,
    "saved": false,
    "score": 1,
    "score_hidden": false,
    "send_replies": true,
    "stickied": false,
    "subreddit": "ChatGPT",
    "subreddit_id": "t5_7hqomg",
    "subreddit_name_prefixed": "r/ChatGPT",
    "subreddit_type": "public",
    "top_awarded_type": null,
    "total_awards_received": 0,
    "treatment_tags": [],
    "unrepliable_reason": null,
    "ups": 1,
    "user_reports": []
}