{
    "all_awardings": [],
    "approved_at_utc": null,
    "approved_by": null,
    "archived": false,
    "associated_award": null,
    "author": "farfignewton",
    "author_flair_background_color": null,
    "author_flair_css_class": null,
    "author_flair_richtext": [],
    "author_flair_template_id": null,
    "author_flair_text": null,
    "author_flair_text_color": null,
    "author_flair_type": "text",
    "author_fullname": "t2_25m5b",
    "author_is_blocked": false,
    "author_patreon_flair": false,
    "author_premium": false,
    "awarders": [],
    "banned_at_utc": null,
    "banned_by": null,
    "body": "First of all, even if all the necessary technical breakthroughs happened tomorrow, it does not seem physically possible to ramp up the robot factories fast enough to replace all the jobs in 5 years. Second, it is hard to forecast when breakthroughs will occur. Worse, it is hard to come up with a definitive list of what the necessary breakthroughs in AI even are!\n\nSo where is that Level 5 self-driving car I was promised 10 years ago? If the OP is correct, and AI ends employment as we know it, then all Uber, Lyft, taxi, and truck drivers will be out of work by the year 2030, and a Level-5 autonomous vehicle will show up in my driveway - for free, of course, because there are no human workers to pay at the car companies... Ha! Dream on.\n\nAlso, it is easy to paint with broad brushstrokes about AI taking all jobs, but have you surveyed all the jobs?  From a distance, most jobs look easier than they are. From a distance, most jobs just look like a bag of skills. (As a software engineer for 30+ years, I am no stranger to being judged as just a bag of skills.) But there is humanity in us all, and it is essential in some jobs:\n\n1. Who would go to a concert to see robots perform songs by your favorite band? Who would like to see human pitchers in baseball replaced by machines? Nobody! Humans want to see humans perform. Performers may be trained differently in the future, but they will not be out. They are, for the most part, safe.\n\n2. You might think LLMs would replace all psychiatrists and therapists soon. But what has already been found is that while LLMs have advantages such as cheapness, 24/7 availability, and infinite patience, there is value in the empathy of a human therapist. If a person looks you in the eye and says \"I know how you feel. I've been there,\" the impact will be different than a robot saying the same thing. It doesn't matter how good the robot is at emulating empathic speech patterns. That robot is a goddamn liar! Some jobs bank on human empathy, and those cannot be fully replaced.\n\n3. Testers. In the optimistic vision of a future of abundance where everything we need is provided for us by robots, there will still be a place for humans to serve as Quality Assurance for products intended to be rolled out to the general public. It's hard to imagine that none of those testers would be paid. \n\n4. Also in the optimistic vision of our AI future, we should have human representatives in positions of power - otherwise, it would seem likely to devolve into a dystopian future. But even in the dystopian vision, there might be jobs in the Resistance. Not sure if being part of the Resistance would bring in a steady income, though. Being a human representative should, I think.\n\nThis list is almost certainly incomplete. I have not surveyed all possible jobs. I still agree that many - or most - jobs will be taken by AI eventually, but I don't think it will be in 5 years, and it won't be all jobs. I am also not saying that the diminished job market for humans will be able to sustain high labor force participation rates. Let's keep thinking ahead.",
    "can_gild": false,
    "can_mod_post": false,
    "collapsed": false,
    "collapsed_because_crowd_control": null,
    "collapsed_reason": null,
    "collapsed_reason_code": null,
    "comment_type": null,
    "controversiality": 0,
    "created": 1717254372,
    "created_utc": 1717254372,
    "distinguished": null,
    "downs": 0,
    "edited": false,
    "gilded": 0,
    "gildings": {},
    "id": "l6mtpjp",
    "is_submitter": false,
    "likes": null,
    "link_id": "t3_1d5haqv",
    "locked": false,
    "mod_note": null,
    "mod_reason_by": null,
    "mod_reason_title": null,
    "mod_reports": [],
    "name": "t1_l6mtpjp",
    "no_follow": true,
    "num_reports": null,
    "parent_id": "t3_1d5haqv",
    "permalink": "/r/ChatGPT/comments/1d5haqv/anthropics_chief_of_staff_thinks_agi_is_almost/l6mtpjp/",
    "removal_reason": null,
    "replies": "",
    "report_reasons": null,
    "retrieved_on": 1717254391,
    "saved": false,
    "score": 1,
    "score_hidden": true,
    "send_replies": true,
    "stickied": false,
    "subreddit": "ChatGPT",
    "subreddit_id": "t5_7hqomg",
    "subreddit_name_prefixed": "r/ChatGPT",
    "subreddit_type": "public",
    "top_awarded_type": null,
    "total_awards_received": 0,
    "treatment_tags": [],
    "unrepliable_reason": null,
    "ups": 1,
    "user_reports": []
}