{
    "all_awardings": [],
    "approved_at_utc": null,
    "approved_by": null,
    "archived": false,
    "associated_award": null,
    "author": "Wollff",
    "author_flair_background_color": null,
    "author_flair_css_class": null,
    "author_flair_richtext": [],
    "author_flair_template_id": null,
    "author_flair_text": null,
    "author_flair_text_color": null,
    "author_flair_type": "text",
    "author_fullname": "t2_4kqj1",
    "author_is_blocked": false,
    "author_patreon_flair": false,
    "author_premium": false,
    "awarders": [],
    "banned_at_utc": null,
    "banned_by": null,
    "body": "No, this is not how this works. This is not how any of this works.\n\n> at the very least they have access to the same LLMs with unbiased and more complete datasets.\n\nYes? Source? None? Thought so.\n\n> at the very least they have access to the same LLMs with unbiased and more complete datasets.\n\nNo, probably not.\n\nI mean, how do you imaine this works? OpenAI has a limited number of servers which can run the computations they need to train new models, and to keep their services running. They want and need every high value datacenter with the computing power they need, for running their business. Especially with big brother Mircrosoft now looking over their shoulder, they better do a good job at using their resources well, and not wasting anyting on nonsense that doesn't produce tangible outcomes.\n\nSo, given this situation, what do you think is the result when some government agency comes along and asks for access to a very special model, very special servers, plus the necessary people to support all of that, in order to keep the thing running, just for them? I can tell you. The answer will be: \"Pay us a fucking premium for that, or fuck off, because we are a business, and we have better things to do than handing out gifts to random government agencies\"\n\nThe response will me significantly more rude and curt, as soon as the words \"secrecy\" enter the conversation.\n\nIn addition to that: If that kind of service exists, and if it's as well paid as it needs to be, that will show up in the books of the company. Everyone would notice.\n\n> not to mention self improving llm models.\n\nYes. Let's not mention them, because they probably don't exist. The specialists which can do LLM stuff are currently all very well paid and very sought after in the industry which is digging for gold on the commercial cuttintg edge with those models.\n\nSame with the servers which can do the computations that can train the \"normal versions\" of those models.\n\nIf I am a programmer with the skills which could eventually enable me to design a self improving LLM... Who do you think I want to work for? In short: Not the government. That's who. If I produce chips which can train the models which everyone wants, who will I sell them to? To the one who pays best. And that's definitely not the government.\n\n> Given what we know about Facebook AI development years ago there's no reason to think they do not have a more capable AI not based on the LLM model.\n\nFacebook is a publicly traded company. If I am a shareholder, and they have an incredibly advanced AI model, and they don't making incredible money off of that incredibly advanced technology, then I can sue their pants off. Because they are obviously not acting in the interest of their shareholders.\n\nIf Facebook isn't selling an incredibly advanced AI model for incredible amounts of money, and if that doesn't show up in their books, then they don't have an incredibly advanced AI model. They can't possibly have that.\n\nIf they had one, and they gave it away for free, their shareholders would sue their pants off.\n\n> just learn about DARPA\n\nNo, you. DARPA gives grants to promising research which might have applications for national defense. That can happen on pretty much all levels. In the best case, it leads to the development of a product. And the production of that product is then formalized in a defense contract.\n\nAFAIK on all of those levels DARPA can swoop in, and, if they have given money, and if they deem it necessary, shroud the reserach in secrecy for some time, if they deem it necessary. So students and universities will take DARPA grants. They are starved for money. Certain companies will take those grants. After all, that might get them a defense contract, and they won't lose anything by having to keep stuff secret.\n\nSo what about OpenAI? In the beginning they were all about being Open. That means they had to keep away from DARPA money, because their research and work could have been locked down. So, definitely no DARPA in past OpenAI.\n\nAnd current OpenAI, which EVERYONE wants to invest in? They will get their money elsewhere. They don't need DARPA money. The government can give them nothing. They will stay away from any contracts which can hold them up, which could keep their products from the market, and which could force them to keep stuff secret. They will stay the fuck away from DARPA, and anything related.",
    "can_gild": false,
    "can_mod_post": false,
    "collapsed": false,
    "collapsed_because_crowd_control": null,
    "collapsed_reason": null,
    "collapsed_reason_code": null,
    "comment_type": null,
    "controversiality": 0,
    "created": 1717273436,
    "created_utc": 1717273436,
    "distinguished": null,
    "downs": 0,
    "edited": false,
    "gilded": 0,
    "gildings": {},
    "id": "l6o9hje",
    "is_submitter": false,
    "likes": null,
    "link_id": "t3_1d5p15t",
    "locked": false,
    "mod_note": null,
    "mod_reason_by": null,
    "mod_reason_title": null,
    "mod_reports": [],
    "name": "t1_l6o9hje",
    "no_follow": true,
    "num_reports": null,
    "parent_id": "t1_l6nduvr",
    "permalink": "/r/ChatGPT/comments/1d5p15t/do_you_think_governments_had_advanced_llms_prior/l6o9hje/",
    "removal_reason": null,
    "replies": "",
    "report_reasons": null,
    "retrieved_on": 1717273451,
    "saved": false,
    "score": 1,
    "score_hidden": true,
    "send_replies": true,
    "stickied": false,
    "subreddit": "ChatGPT",
    "subreddit_id": "t5_7hqomg",
    "subreddit_name_prefixed": "r/ChatGPT",
    "subreddit_type": "public",
    "top_awarded_type": null,
    "total_awards_received": 0,
    "treatment_tags": [],
    "unrepliable_reason": null,
    "ups": 1,
    "user_reports": []
}