{
    "all_awardings": [],
    "approved_at_utc": null,
    "approved_by": null,
    "archived": false,
    "associated_award": null,
    "author": "Pleasant-Contact-556",
    "author_flair_background_color": null,
    "author_flair_css_class": null,
    "author_flair_richtext": [],
    "author_flair_template_id": null,
    "author_flair_text": null,
    "author_flair_text_color": null,
    "author_flair_type": "text",
    "author_fullname": "t2_52hwiins",
    "author_is_blocked": false,
    "author_patreon_flair": false,
    "author_premium": false,
    "awarders": [],
    "banned_at_utc": null,
    "banned_by": null,
    "body": "That is a fair point, though.. when it changes it does tend to be something very small that catalyzes something far, far beyond the most outrageous ideas of the person inventing it.\n\nPeople like to view this as being equivalent to the invention of automated factories, with the luddites, but that's totally the wrong way to view it.\n\nThis is Printing Press 2.0. The invention of the printing press allowed for an amplification of ideas and dissemination of knowledge which was absolutely critical to both the Renaissance and Reformation, at least as we know them.\n\nThe renaissance required widespread dissemination of knowledge, standardization of texts, commonplace literacy, increased education standards, exchange of cultural ideas, the scientific revolution, etc. Without the printing press, it would've likely still happened, but civilization could be centuries behind where it is right now. \n\nThe reformation required the same rapid dissemination of ideas like Luther's 95 Theses, the mass production of the Bible, the production of pamphlets and treatises criticizing the catholic church and promoting Protestant ideas. Without the increased accessibility to religious texts, plus the ability to mass-produce them, we'd probably still be being ruled by the clergy. \n\nMy favorite part is the fact that people feared it from its inception just like we do artificial intelligence. Pretty much exact same reasons.   \nReligious authorities feared the spread of heresy and false teachings.   \nPolitical figures feared unrest through the spread of 'seditious' materials.   \nBoth authorities were afraid of losing control of information. Be it through spreading misinformation, propaganda, slander, etc.   \nSome feared a cultural and moral decay due to the spread of sensationalist ideas.\n\nAnd let's not even mention the scribes and copyists who lost their jobs.",
    "can_gild": false,
    "can_mod_post": false,
    "collapsed": false,
    "collapsed_because_crowd_control": null,
    "collapsed_reason": null,
    "collapsed_reason_code": null,
    "comment_type": null,
    "controversiality": 0,
    "created": 1717283896,
    "created_utc": 1717283896,
    "distinguished": null,
    "downs": 0,
    "edited": false,
    "gilded": 0,
    "gildings": {},
    "id": "l6ozwbq",
    "is_submitter": false,
    "likes": null,
    "link_id": "t3_1d5haqv",
    "locked": false,
    "mod_note": null,
    "mod_reason_by": null,
    "mod_reason_title": null,
    "mod_reports": [],
    "name": "t1_l6ozwbq",
    "no_follow": true,
    "num_reports": null,
    "parent_id": "t1_l6oncfc",
    "permalink": "/r/ChatGPT/comments/1d5haqv/anthropics_chief_of_staff_thinks_agi_is_almost/l6ozwbq/",
    "removal_reason": null,
    "replies": "",
    "report_reasons": null,
    "retrieved_on": 1717283910,
    "saved": false,
    "score": 1,
    "score_hidden": true,
    "send_replies": true,
    "stickied": false,
    "subreddit": "ChatGPT",
    "subreddit_id": "t5_7hqomg",
    "subreddit_name_prefixed": "r/ChatGPT",
    "subreddit_type": "public",
    "top_awarded_type": null,
    "total_awards_received": 0,
    "treatment_tags": [],
    "unrepliable_reason": null,
    "ups": 1,
    "user_reports": []
}