{
    "_meta": {
        "retrieved_2nd_on": 1717308990
    },
    "all_awardings": [],
    "approved_at_utc": null,
    "approved_by": null,
    "archived": false,
    "associated_award": null,
    "author": "OftenAmiable",
    "author_flair_background_color": null,
    "author_flair_css_class": null,
    "author_flair_richtext": [],
    "author_flair_template_id": null,
    "author_flair_text": null,
    "author_flair_text_color": null,
    "author_flair_type": "text",
    "author_fullname": "t2_i2blb6kh8",
    "author_is_blocked": false,
    "author_patreon_flair": false,
    "author_premium": false,
    "awarders": [],
    "banned_at_utc": null,
    "banned_by": null,
    "body": "I am old enough to have grown up without computers. When they started entering homes and workplaces plenty of people like OP were talking about how they were going to change the world, and plenty of people like you were arguing the point, citing things like, \"you have to hang up your phone to connect to a bulletin board and you need all those stupid disks and you don't even have enough memory to store a teacher's gradebook and who would want to have to enter your business ledger into a computer when you've already got it all written down and I can't use it to buy my groceries or pay my electric bill and you can't carry them around with you so what's so great about them?\"\n\nAnd of course I remember before there was a world wide web. When that first started there were people like OP who were talking about how that was going to change the world, and there were people like you who pointed out that business always has and always will need physical stores and people will visit their neighborhood stores or find what they need in a phone book and so advertising business on the web is pointless, just a fad, because surely nobody is going to wait for something to be shipped when they could just hop in their car and go pick it up at the local store? And who is going to go to the effort of typing up all the information in an encyclopedia when they know everybody who wants to have access to that information will just buy a set of encyclopedias or visit them at the local library? Besides, if some idiot did actually waste their time typing all that into a web page, only their friends are going to know because it's not like there's any kind of search engine that will find web pages for you, you have to know the URL or get lucky enough to find it by clicking enough hyperlinks to randomly come across something interesting. \n\nThose who fail to study history....\n\nYou are making the same mistake those other people like you made: the mistake of thinking that just because it hasn't changed the world in the first few years, it isn't going to. It's a failure of imagination coupled with a failure to understand the exponential growth of such technologies. \n\nYour insistence on believing that it isn't going to revolutionize the world because it hasn't revolutionized the world yet will secure your feelings of dismissive superiority today, because you're right, so far the only big wins for AI are only minor stuff like writing novel computer code, mastering language better than any human, creating art on demand, and being better at health care diagnostics than trained doctors. \n\nBut AI still hasn't matured as a technology. It's just getting started, and its rate of progress is accelerating.",
    "can_gild": false,
    "can_mod_post": false,
    "collapsed": false,
    "collapsed_because_crowd_control": null,
    "collapsed_reason": null,
    "collapsed_reason_code": null,
    "comment_type": null,
    "controversiality": 0,
    "created": 1717308922,
    "created_utc": 1717308922,
    "distinguished": null,
    "downs": 0,
    "edited": false,
    "gilded": 0,
    "gildings": {},
    "id": "l6qeuh0",
    "is_submitter": false,
    "likes": null,
    "link_id": "t3_1d61qvl",
    "locked": false,
    "mod_note": null,
    "mod_reason_by": null,
    "mod_reason_title": null,
    "mod_reports": [],
    "name": "t1_l6qeuh0",
    "no_follow": true,
    "num_reports": null,
    "parent_id": "t1_l6ph4us",
    "permalink": "/r/ChatGPT/comments/1d61qvl/anyone_else_feel_like_theyre_going_crazy/l6qeuh0/",
    "removal_reason": null,
    "replies": "",
    "report_reasons": null,
    "retrieved_on": 1717308938,
    "saved": false,
    "score": 1,
    "score_hidden": true,
    "send_replies": true,
    "stickied": false,
    "subreddit": "ChatGPT",
    "subreddit_id": "t5_7hqomg",
    "subreddit_name_prefixed": "r/ChatGPT",
    "subreddit_type": "public",
    "top_awarded_type": null,
    "total_awards_received": 0,
    "treatment_tags": [],
    "unrepliable_reason": null,
    "ups": 1,
    "user_reports": []
}