{
    "all_awardings": [],
    "approved_at_utc": null,
    "approved_by": null,
    "archived": false,
    "associated_award": null,
    "author": "SnooGiraffes2854",
    "author_flair_background_color": null,
    "author_flair_css_class": null,
    "author_flair_richtext": [],
    "author_flair_template_id": null,
    "author_flair_text": null,
    "author_flair_text_color": null,
    "author_flair_type": "text",
    "author_fullname": "t2_4ofdosd5",
    "author_is_blocked": false,
    "author_patreon_flair": false,
    "author_premium": false,
    "awarders": [],
    "banned_at_utc": null,
    "banned_by": null,
    "body": "LLMs are pretty cool.\n\nI'm working in the field for a while and based on that I tell you I don't find it impressive anymore. It's indeed a tremendous technology, and the doors it opens are of such size that I am eager to say it has no precedent for us mare mortals.\n\nThe thing is ... Two things:\n1. Most people, even tech-driven individuals, have no clue about how these tools work. Therefore they're inclined to think it is like a Google on steroids, (which it sorta is from inside). This mindset prevents them to think beyond the obvious and conclude that contemporary ML algorithms can improve our lives quality in multiple ways \n2. Webber-Fachner law. Novelty just becomes part of our day-to-day lives and as more people use it the less relevant it is, until it is seen as a commodity. Say if you were given today's tech in 1900, or even 2000 (25-ish years ago), you would have a considerable advantage when compared to your competitors (regardless the context). But, say, you could build a website, but then you barely had traction as people didn't use web that much back then, specially in 1900.\n\nSo. Yes. I see LLMs as tools. And as a hammer or a car, those tools are tailored for certain tasks, in which they're good at. GPT is far from logical, it mimics our communication patterns and that's it. GPT is not smart as we usually take smartness, it doesn't reason. These models, they're tremendous at text transformation, provide them with a framework, say coding in a particular language, and they're good at it, they're not good at building new algorithms, but they speed up your coding as a pretty advanced t9. \n\nLeveraging AI models, either text/speech/image ... -based, can speed-up your job as much as if you were to hire multiple junior-level employees. They're great at a particular task, but you must supervision the outcome and probably fix some bugs. This, I believe, is the right mindset for today's AI level-of-capabilities, therefore the amount of solo-entrepreneurs getting invested will increase in the following 2-3 years, but then it will find a new plateau again and everyone will be using these new tools either directly or indirectly.\n\nWhat is funny, is that kids at elementary school, or kindergarten, they'll use LLMs and other AI models in they're daily lives since forever, making this such a common-ground as TV is for boomers, or Internet-chat for millennials. And, like in the past, TV and internet speed-up our social-economics evolution, this new techs will do that too. Eventually we are so far from basic knowledge, that little to no-one will know how to bake bread. And I find that fascinating.\n\nAt last, yes. They're tools and pretty funny",
    "can_gild": false,
    "can_mod_post": false,
    "collapsed": false,
    "collapsed_because_crowd_control": null,
    "collapsed_reason": null,
    "collapsed_reason_code": null,
    "comment_type": null,
    "controversiality": 0,
    "created": 1717326447,
    "created_utc": 1717326447,
    "distinguished": null,
    "downs": 0,
    "edited": false,
    "gilded": 0,
    "gildings": {},
    "id": "l6r2yh7",
    "is_submitter": false,
    "likes": null,
    "link_id": "t3_1d61qvl",
    "locked": false,
    "mod_note": null,
    "mod_reason_by": null,
    "mod_reason_title": null,
    "mod_reports": [],
    "name": "t1_l6r2yh7",
    "no_follow": false,
    "num_reports": null,
    "parent_id": "t3_1d61qvl",
    "permalink": "/r/ChatGPT/comments/1d61qvl/anyone_else_feel_like_theyre_going_crazy/l6r2yh7/",
    "removal_reason": null,
    "replies": "",
    "report_reasons": null,
    "retrieved_on": 1717326462,
    "saved": false,
    "score": 1,
    "score_hidden": true,
    "send_replies": true,
    "stickied": false,
    "subreddit": "ChatGPT",
    "subreddit_id": "t5_7hqomg",
    "subreddit_name_prefixed": "r/ChatGPT",
    "subreddit_type": "public",
    "top_awarded_type": null,
    "total_awards_received": 0,
    "treatment_tags": [],
    "unrepliable_reason": null,
    "ups": 1,
    "user_reports": []
}