{
    "all_awardings": [],
    "approved_at_utc": null,
    "approved_by": null,
    "archived": false,
    "associated_award": null,
    "author": "Landaree_Levee",
    "author_flair_background_color": null,
    "author_flair_css_class": null,
    "author_flair_richtext": [],
    "author_flair_template_id": null,
    "author_flair_text": null,
    "author_flair_text_color": null,
    "author_flair_type": "text",
    "author_fullname": "t2_4cier2bs",
    "author_is_blocked": false,
    "author_patreon_flair": false,
    "author_premium": false,
    "awarders": [],
    "banned_at_utc": null,
    "banned_by": null,
    "body": "I’d say OpenAI’s GPT4o and Anthropic’s Claude 3 Opus. The issue isn’t so much which one (though of course flagship ones will tend to perform better), but the fact that none are *expressly* designed for summarizing alone. LLMs tend to follow a “path” of where they believe the text is going—and the longer the text is, the more they’ll stray from where it actually goes (or starts with). Sure, the rest of the text will *theoretically* keep it on track, but only to a point. To give you a (perhaps poor) simile, it’s like a rather creative person who’s asked to paraphrase a text: the longer it goes on, the more the person will be tempted to insert some of its own ideas.\n\nThe trick is to divide it in chunks and ask the AI to process them one at a time, since then each new chunk “resets” the AI’s thinking to whatever that segment leads with.\n\nThe problem is that ChatGPT Plus isn’t designed to do this—and neither is Anthropic’s Claude Pro, for that matter. By and large, you’d have to use external automated tools (that would then rely on the AI’s API service, which is a different one you have to pay for separately) to automatically divide the entire document into more manageable chunks, summarize each one (perhaps in the same “conversation”, but still different prompts), then combine the results.\n\nI don’t know any, sorry—there’s probably quite a few, I just don’t know any because I haven’t tried them—but, if you don’t want to go for extra (paid) services just for that, you could try doing it yourself, with ChatGPT. I grant you it might be a hassle, especially if you have to divide the document a lot to ensure faithfulness to the original… but if it helps, you can always temporarily set Custom Instructions to the effect that *“Everything I input, consider it a fragment of text I want you to summarize, outputting nothing else but the summary itself”*, to at least simplify the task a bit.",
    "can_gild": false,
    "can_mod_post": false,
    "collapsed": false,
    "collapsed_because_crowd_control": null,
    "collapsed_reason": null,
    "collapsed_reason_code": null,
    "comment_type": null,
    "controversiality": 0,
    "created": 1717337664,
    "created_utc": 1717337664,
    "distinguished": null,
    "downs": 0,
    "edited": false,
    "gilded": 0,
    "gildings": {},
    "id": "l6rp1hd",
    "is_submitter": false,
    "likes": null,
    "link_id": "t3_1d6diwm",
    "locked": false,
    "mod_note": null,
    "mod_reason_by": null,
    "mod_reason_title": null,
    "mod_reports": [],
    "name": "t1_l6rp1hd",
    "no_follow": false,
    "num_reports": null,
    "parent_id": "t3_1d6diwm",
    "permalink": "/r/ChatGPT/comments/1d6diwm/which_ai_is_best_at_summarizing_a_big_chunk_of/l6rp1hd/",
    "removal_reason": null,
    "replies": "",
    "report_reasons": null,
    "retrieved_on": 1717337680,
    "saved": false,
    "score": 1,
    "score_hidden": true,
    "send_replies": true,
    "stickied": false,
    "subreddit": "ChatGPT",
    "subreddit_id": "t5_7hqomg",
    "subreddit_name_prefixed": "r/ChatGPT",
    "subreddit_type": "public",
    "top_awarded_type": null,
    "total_awards_received": 0,
    "treatment_tags": [],
    "unrepliable_reason": null,
    "ups": 1,
    "user_reports": []
}