{
    "all_awardings": [],
    "approved_at_utc": null,
    "approved_by": null,
    "archived": false,
    "associated_award": null,
    "author": "will_waltz",
    "author_flair_background_color": null,
    "author_flair_css_class": null,
    "author_flair_richtext": [],
    "author_flair_template_id": null,
    "author_flair_text": null,
    "author_flair_text_color": null,
    "author_flair_type": "text",
    "author_fullname": "t2_10s66vn8z2",
    "author_is_blocked": false,
    "author_patreon_flair": false,
    "author_premium": true,
    "awarders": [],
    "banned_at_utc": null,
    "banned_by": null,
    "body": "I was the same way with the possibility space of apps built on ethereum. Still kind of am, but I see why adoption didn't really show up for it. Like, we could have a world where we don't need to sign in with different usernames/passwords for every web site we visit; credit card numbers and addresses don't need to be stored by merchants, we could have functional advertising across the web that doesn't exploit people's privacy while also letting everyone benefit from user attention, money transferred in a blink of an eye, etc etc..  \n\nThe problem is that it takes truly gigantic things to convince the world to shift toward better solutions, and typically the world only shifts toward adoption of other new/large systems when the previous world order crumbles enough or is otherwise broken 'enough'. The pandemic finally caused the world to lean on all the high-bandwidth, video-capable, home office setups that were basically just waiting there to be utilized before we stopped commuting to an office each day, even now, the economic and political interests to conform to that previous world order are so strong that remote jobs are disappearing and we're going back to a previous, far less efficient structure... \n\nIt takes gigantic and unavoidable circumstances to truly change humanity's course quickly. If not, we only slowly, messily evolve toward better solutions over much longer timescales. \n\nMost people do not have much systemic vision or creativity. Most people don't really value the possibility space. Most people don't care that much about technology. Most people do not think about how to solve large systemic problems. It isn't an intelligence thing, like you pointed out. ChatGPT is still \"out of the box\" that most people stay comfortable in. Now is the time to be making investments, utilizing the tech for your own benefit, being strategic about the near future you (and the rest of us here) see coming. Most people are not even aware their heads are in the sand. But, things are going to change in a matter of days. I think when Siri/Google's equivalent becomes this thing that EVERYONE can have vocal, conversational, visual, brainstorms with, when contextualized learning-based conversations with, \"smart\" speakers that can completely tutor a kid at home from grade school all the way through to a PhD dissertation, that will be the tipping point.",
    "can_gild": false,
    "can_mod_post": false,
    "collapsed": false,
    "collapsed_because_crowd_control": null,
    "collapsed_reason": null,
    "collapsed_reason_code": null,
    "comment_type": null,
    "controversiality": 0,
    "created": 1717348352,
    "created_utc": 1717348352,
    "distinguished": null,
    "downs": 0,
    "edited": false,
    "gilded": 0,
    "gildings": {},
    "id": "l6sgvv6",
    "is_submitter": false,
    "likes": null,
    "link_id": "t3_1d61qvl",
    "locked": false,
    "mod_note": null,
    "mod_reason_by": null,
    "mod_reason_title": null,
    "mod_reports": [],
    "name": "t1_l6sgvv6",
    "no_follow": true,
    "num_reports": null,
    "parent_id": "t3_1d61qvl",
    "permalink": "/r/ChatGPT/comments/1d61qvl/anyone_else_feel_like_theyre_going_crazy/l6sgvv6/",
    "removal_reason": null,
    "replies": "",
    "report_reasons": null,
    "retrieved_on": 1717348369,
    "saved": false,
    "score": 1,
    "score_hidden": true,
    "send_replies": true,
    "stickied": false,
    "subreddit": "ChatGPT",
    "subreddit_id": "t5_7hqomg",
    "subreddit_name_prefixed": "r/ChatGPT",
    "subreddit_type": "public",
    "top_awarded_type": null,
    "total_awards_received": 0,
    "treatment_tags": [],
    "unrepliable_reason": null,
    "ups": 1,
    "user_reports": []
}