{
    "all_awardings": [],
    "approved_at_utc": null,
    "approved_by": null,
    "archived": false,
    "associated_award": null,
    "author": "UnitSmall2200",
    "author_flair_background_color": null,
    "author_flair_css_class": null,
    "author_flair_richtext": [],
    "author_flair_template_id": null,
    "author_flair_text": null,
    "author_flair_text_color": null,
    "author_flair_type": "text",
    "author_fullname": "t2_11fjtzfyo1",
    "author_is_blocked": false,
    "author_patreon_flair": false,
    "author_premium": false,
    "awarders": [],
    "banned_at_utc": null,
    "banned_by": null,
    "body": "You want to get paid to make art and won't do art if nobody pays you? So you do want Capitalism because you do want to be paid for your art. \n\nThe ai isn't stopping you from doing art for pleasure, just for the sake of doing art and enjoying the process. \n\nOf course  paying people do to labor is preferred to paying people to do art that has no functional purpose. What makes you think that paying people for art should be preferred to paying people to do labour. Labour is in fact more essential than art, whether you like it or not. Art is a luxury. We are lucky that we can afford to do art and pay for art. Labour to make food, shelter and take care of people comes of course before any form of art. Some things are just more essential and have a bigger priority. If I have 20 bucks and have to choose between food and a painting, of course I will prioritize buying food. Art is a broad subject. Art isn't just a painting. Theater is art, dancing is art, stories are art, music is art, movies are art etc. And people do pay good money to see those things and they won't stop doing so. AI won't make studios fire their artists. It's just another tool in their toolbox. One that can help them achieve more. Most cartoons are mostly still images with barely any animation and animators are often overworked, with ai they can do more in the short periods they are given to finish the job, it will ease their job. Small groups and even individuals now have the means to do way more than was possible before. Rich people won't stop paying artists millions for whatever random things they do, just because ai can generate random images. \n\nYou people aren't worrying about art itself. All you worry about is your income. You worry about losing your job or worry about having an even lower chance of becoming instagram famous. Man made art hasn't been forbidden. And won't be forbidden, you are free to do art right now if you like. It's a silly worry. People will still hire artists. Even with these ai tools, companies will still pay someone to make stuff. They won't bother sitting in front of a PC and prompting until they get something they like. They'll just pay someone to do it.",
    "can_gild": false,
    "can_mod_post": false,
    "collapsed": false,
    "collapsed_because_crowd_control": null,
    "collapsed_reason": null,
    "collapsed_reason_code": null,
    "comment_type": null,
    "controversiality": 0,
    "created": 1717362230,
    "created_utc": 1717362230,
    "distinguished": null,
    "downs": 0,
    "edited": false,
    "gilded": 0,
    "gildings": {},
    "id": "l6tidai",
    "is_submitter": false,
    "likes": null,
    "link_id": "t3_1d6iibh",
    "locked": false,
    "mod_note": null,
    "mod_reason_by": null,
    "mod_reason_title": null,
    "mod_reports": [],
    "name": "t1_l6tidai",
    "no_follow": true,
    "num_reports": null,
    "parent_id": "t1_l6t8x7t",
    "permalink": "/r/ChatGPT/comments/1d6iibh/what_are_your_thoughts_on_the_following_statement/l6tidai/",
    "removal_reason": null,
    "replies": "",
    "report_reasons": null,
    "retrieved_on": 1717362243,
    "saved": false,
    "score": 1,
    "score_hidden": true,
    "send_replies": true,
    "stickied": false,
    "subreddit": "ChatGPT",
    "subreddit_id": "t5_7hqomg",
    "subreddit_name_prefixed": "r/ChatGPT",
    "subreddit_type": "public",
    "top_awarded_type": null,
    "total_awards_received": 0,
    "treatment_tags": [],
    "unrepliable_reason": null,
    "ups": 1,
    "user_reports": []
}